[
    {
        "id": "goog-10-k-2022.pdf_page_58_chunk_0",
        "text": "Table of Contents Alphabet Inc. Inventory Inventory consists primarily of finished goods and is stated at the lower of cost and net realizable value. Cost is computed using the first-in, first-out method. Variable Interest Entities We determine at the inception of each arrangement whether an entity in which we have made an investment or in which we have other variable interests is considered a variable interest entity (VIE). We consolidate VIEs when we are the primary beneficiary. We are the primary beneficiary of a VIE when we have the power to direct activities that most significantly affect the economic performance of the VIE and have the obligation to absorb the majority of their losses or benefits. If we are not the primary beneficiary in a VIE, we account for the investment or other variable interests in a VIE in accordance with applicable GAAP. Periodically, we assess whether any changes in our interest or relationship with the entity affect our determination of whether the entity is a VIE and, if so, whether we are the primary beneficiary. Property and Equipment Property and equipment includes the following categories: land and buildings, information technology assets, construction in progress, leasehold improvements, and furniture and fixtures. Land and buildings include land, offices, data centers, and related building improvements. Information technology assets include servers and network equipment. Construction in progress is the construction or development of property and equipment that have not yet been placed in service. We account for property and equipment at cost less accumulated depreciation. We compute depreciation using the straight-line method over the estimated useful lives of the assets, which we regularly evaluate. Land is not depreciated. We depreciate buildings over periods of seven to 25 years. We depreciate information technology assets generally over periods of four to five years (generally, four years for servers and five years for network equipment). We depreciate leasehold improvements over the shorter of the remaining lease term or the estimated useful lives of the assets. Depreciation for buildings, information technology assets, leasehold improvements, and furniture and fixtures commences once they are ready for our intended use. Leases We determine if an arrangement is a lease at inception. Our lease agreements generally contain lease and non- lease components. Payments under our lease arrangements are primarily fixed. Non-lease components primarily include payments for maintenance and utilities. We combine fixed payments for non-lease components with lease payments and account for them together as a single lease component which increases the amount of our lease assets and liabilities. Certain lease agreements contain variable payments, which are expensed as incurred and not included in the lease assets and liabilities. These amounts include payments affected by the Consumer Price Index, payments contingent on wind or solar production for power purchase arrangements, and payments for maintenance and utilities. Lease assets and liabilities are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value of the future lease payments is",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "58",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_58_chunk_1",
        "text": "our incremental borrowing rate, because the interest rate implicit in our leases is not readily determinable. Our incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments, and in economic environments where the leased asset is located. Our lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base, non-cancelable, lease term when determining the lease assets and liabilities. Lease assets also include any prepaid lease payments and lease incentives. Operating lease assets and liabilities are included on our Consolidated Balance Sheets. The current portion of our operating lease liabilities is included in accrued expenses and other current liabilities, and the long-term portion is included in operating lease liabilities. Finance lease assets are included in property and equipment, net. Finance lease liabilities are included in accrued expenses and other current liabilities or long-term debt. Operating lease expense (excluding variable lease costs) is recognized on a straight-line basis over the lease term. Long-Lived Assets, Goodwill and Other Acquired Intangible Assets We review property and equipment and intangible assets, excluding goodwill, for impairment when events or changes in circumstances indicate the carrying amount may not be recoverable. The evaluation is performed at the lowest level of identifiable cash flows independent of other assets. We measure recoverability of these assets by 57",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "58",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_69_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of December 31, 2022, our operating leases had a weighted average remaining lease term of eight years and a weighted average discount rate of 2.8%. Future lease payments under operating leases as of December 31, 2022 were as follows (in millions): 2023 $ 2,955 2024 2,771 2025 2,377 2026 1,953 2027 1,502 Thereafter 5,882 Total future lease payments 17,440 Less imputed interest (2,462) Total lease liability balance $ 14,978 As of December 31, 2022, we have entered into leases that have not yet commenced with short-term and long- term future lease payments of $630 million and $3.1 billion that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2023 and 2026 with non-cancelable lease terms between 1 and 25 years. Note 5. Variable Interest Entities Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2021 and 2022, assets that can only be used to settle obligations of these VIEs were $6.0 billion and $4.1 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.5 billion and $2.6 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Total noncontrolling interests (NCI) in our consolidated subsidiaries were $4.3 billion and $3.8 billion as of December 31, 2021 and 2022, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. We have determined that the single source of our exposure to these VIEs is our capital investments in them. The carrying value and maximum exposure of these unconsolidated VIEs were $2.7 billion and $2.9 billion, respectively, as of December 31, 2021 and $2.7 billion and $2.8 billion, respectively, as",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "69",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_69_chunk_1",
        "text": "of December 31, 2022. Note 6. Debt Short-Term Debt We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2021 and 2022. Our short-term debt balance also includes the current portion of certain long-term debt. 68",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "69",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_70_chunk_0",
        "text": "Table of Contents Alphabet Inc. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of December 31, Effective Maturity Coupon Rate Interest Rate 2021 2022 Debt 2014-2020 Notes issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000 Future finance lease payments, net and other (1) 2,086 2,142 Total debt 15,086 15,142 Unamortized discount and debt issuance costs (156) (143) Less: current portion of future finance lease payments, net and other current debt(1)(2) (113) (298) Total long-term debt $ 14,817 $ 14,701 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 7 for further details. The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $12.4 billion and $9.9 billion as of December 31, 2021 and December 31, 2022, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. As of December 31, 2022, the aggregate future principal payments for long-term debt, including finance lease liabilities, for each of the next five years and thereafter were as follows (in millions): 2023 $ 221 2024 1,156 2025 1,159 2026 2,163 2027 1,166 Thereafter 9,447 Total $ 15,312 Credit Facility As of December 31, 2022, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2023 and $6.0 billion expiring in April 2026. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2021 and 2022. Note 7. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $550 million and $754 million as of December 31, 2021 and 2022, respectively. 69",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "70",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_71_chunk_0",
        "text": "Table of Contents Alphabet Inc. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of December 31, 2021 2022 Land and buildings $ 58,881 $ 66,897 Information technology assets 55,606 66,267 Construction in progress 23,172 27,657 Leasehold improvements 9,146 10,575 Furniture and fixtures 208 314 Property and equipment, gross 147,013 171,710 Less: accumulated depreciation (49,414) (59,042) Property and equipment, net $ 97,599 $ 112,668 Accrued expenses and other current liabilities Accrued expenses and other current liabilities consisted of the following (in millions): As of December 31, 2021 2022 European Commission fines(1) $ 9,799 $ 9,106 Accrued customer liabilities 3,505 3,619 Accrued purchases of property and equipment 2,415 3,019 Current operating lease liabilities 2,189 2,477 Other accrued expenses and current liabilities 14,136 19,645 Accrued expenses and other current liabilities $ 32,044 $ 37,866 (1) While each EC decision is under appeal, the fines are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets, as we provided bank guarantees (in lieu of a cash payment) for the fines. Amounts include the effects of foreign exchange and interest. See Note 10 for further details. 70",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "71",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_62_chunk_0",
        "text": "Table of Contents Alphabet Inc. or benefits. If we are not the primary beneficiary in a VIE, we account for the investment or other variable interests in a VIE in accordance with applicable GAAP. Periodically, we assess whether any changes in our interest or relationship with the entity affect our determination of whether the entity is a VIE and, if so, whether we are the primary beneficiary. Property and Equipment Property and equipment includes the following categories: land and buildings, information technology assets, construction in progress, leasehold improvements, and furniture and fixtures. Land and buildings include land, offices, data centers, and related building improvements. Information technology assets include servers and network equipment. Construction in progress is the construction or development of property and equipment that have not yet been placed in service. Property and equipment are stated at cost less accumulated depreciation. Depreciation is recorded using the straight-line method over the estimated useful lives of the assets, which we regularly evaluate. Land is not depreciated. We depreciate buildings over periods of seven to 25 years. We depreciate information technology assets generally over a period of six years for servers and network equipment. We depreciate leasehold improvements over the shorter of the remaining lease term or the estimated useful lives of the assets. Depreciation for buildings, information technology assets, leasehold improvements, and furniture and fixtures commences once they are ready for our intended use. Goodwill We allocate goodwill to reporting units based on the expected benefit from the business combination. We evaluate our reporting units periodically, as well as when changes in our operating segments occur. For changes in reporting units, we reassign goodwill using a relative fair value allocation approach. We test our goodwill for impairment at least annually, or more frequently if events or changes in circumstances indicate that the asset may be impaired. Goodwill impairments were not material for the periods presented. Leases We determine if an arrangement is a lease at inception. Our lease agreements generally contain lease and non- lease components. Payments under our lease arrangements are primarily fixed. Non-lease components primarily include payments for maintenance and utilities. We combine fixed payments for non-lease components with lease payments and account for them together as a single lease component which increases the amount of our lease assets and liabilities. Certain lease agreements contain variable payments, which are expensed as incurred and not included in the lease assets and liabilities. These amounts primarily include payments affected by the Consumer Price Index, and payments for maintenance and utilities. Lease assets and liabilities are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value of the future lease payments is our incremental borrowing rate, because the interest rate implicit in our leases is not readily determinable. Our incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments, and in economic environments where the leased asset is located.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "62",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_62_chunk_1",
        "text": "Our lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base, non-cancelable, lease term when determining the lease assets and liabilities. Lease assets also include any prepaid lease payments and lease incentives. Operating lease assets and liabilities are included on our Consolidated Balance Sheets. The current portion of our operating lease liabilities is included in accrued expenses and other current liabilities, and the long-term portion is included in operating lease liabilities. Finance lease assets are included in property and equipment, net. Finance lease liabilities are included in accrued expenses and other current liabilities or long-term debt. Operating lease expense (excluding variable lease costs) is recognized on a straight-line basis over the lease term. Impairment of Long-Lived Assets We review leases, property and equipment, and intangible assets, excluding goodwill, for impairment when events or changes in circumstances indicate the carrying amount may not be recoverable. The evaluation is performed at the lowest level of identifiable cash flows independent of other assets. We measure recoverability of these assets by comparing the carrying amounts to the future undiscounted cash flows that the assets or the asset group are expected 61.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "62",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_73_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of December 31, 2023, our operating leases had a weighted average remaining lease term of 8.1 years and a weighted average discount rate of 3.1%. Future lease payments under operating leases as of December 31, 2023 were as follows (in millions): 2024 $ 3,179 2025 2,929 2026 2,450 2027 1,951 2028 1,488 Thereafter 5,685 Total future lease payments 17,682 Less imputed interest (2,431) Total lease liability balance $ 15,251 As of December 31, 2023, we have entered into leases that have not yet commenced with short-term and long- term future lease payments of $657 million and $3.3 billion that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2024 and 2026 with non-cancelable lease terms between one and 25 years. Note 5. Variable Interest Entities Consolidated Variable Interest Entities We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2022 and 2023, assets that can only be used to settle obligations of these VIEs were $4.1 billion and $4.9 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.6 billion and $2.5 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Total noncontrolling interests (NCI) in our consolidated subsidiaries were $3.8 billion and $3.4 billion as of December 31, 2022 and 2023, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E. Unconsolidated Variable Interest Entities We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments primarily as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. The maximum exposure and carrying value of these unconsolidated VIEs were $2.8 billion and $2.7 billion, respectively, as of December 31, 2022 and $5.7 billion and $4.0 billion, respectively, as of December 31, 2023. The difference between the maximum exposure and the carrying value",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "73",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_73_chunk_1",
        "text": "relates primarily to future funding commitments. Note 6. Debt Short-Term Debt We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2022 and 2023. Our short-term debt balance also includes the current portion of certain long-term debt. 72.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "73",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_74_chunk_0",
        "text": "Table of Contents Alphabet Inc. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of December 31, Effective Maturity Coupon Rate Interest Rate 2022 2023 Debt 2014-2020 Notes issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000 Future finance lease payments, net and other (1) 2,142 1,746 Total debt 15,142 14,746 Unamortized discount and debt issuance costs (143) (130) Less: Current portion of long-term notes(2) 0 (1,000) Less: Current portion of future finance lease payments, net and other current debt(1)(2) (298) (363) Total long-term debt $ 14,701 $ 13,253 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 7 for further details. The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $9.9 billion and $10.3 billion as of December 31, 2022 and December 31, 2023, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. As of December 31, 2023, the aggregate future principal payments for long-term debt, including finance lease liabilities, for each of the next five years and thereafter were as follows (in millions): 2024 $ 1,299 2025 1,163 2026 2,165 2027 1,143 2028 132 Thereafter 8,960 Total $ 14,862 Credit Facility As of December 31, 2023, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2024 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2022 and 2023. Note 7. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $754 million and $771 million as of December 31, 2022 and 2023, respectively. 73.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "74",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_75_chunk_0",
        "text": "Table of Contents Alphabet Inc. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of December 31, 2022 2023 Land and buildings $ 66,897 $ 74,083 Information technology assets 66,267 80,594 Construction in progress 27,657 35,229 Leasehold improvements 10,575 11,425 Furniture and fixtures 314 472 Property and equipment, gross 171,710 201,803 Less: accumulated depreciation (59,042) (67,458) Property and equipment, net $ 112,668 $ 134,345 Our technical infrastructure is comprised of information technology assets, including servers and networking equipment, and data center land and buildings. Accrued Expenses and Other Current Liabilities Accrued expenses and other current liabilities consisted of the following (in millions): As of December 31, 2022 2023 European Commission fines(1) $ 9,106 $ 9,525 Accrued purchases of property and equipment 3,019 4,679 Accrued customer liabilities 3,619 4,140 Current operating lease liabilities 2,477 2,791 Income taxes payable, net 1,632 2,748 Other accrued expenses and current liabilities 18,013 22,285 Accrued expenses and other current liabilities $ 37,866 $ 46,168 (1) While each EC decision is under appeal, the fines are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets, as we provided bank guarantees (in lieu of a cash payment) for the fines. Amounts include the effects of foreign exchange and interest. See Note 10 for further details. 74.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "75",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_88_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of December 31, 2022 2023 Long-lived assets: United States $ 93,565 $ 110,053 International 33,484 38,383 Total long-lived assets $ 127,049 $ 148,436 87.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "88",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_63_chunk_0",
        "text": "Table of Contents Alphabet Inc. the primary beneficiary. We are the primary beneficiary of a VIE when we have the power to direct activities that most significantly affect the economic performance of the VIE and have the obligation to absorb the majority of their losses or benefits. If we are not the primary beneficiary in a VIE, we account for the investment or other variable interests in a VIE in accordance with applicable GAAP. Periodically, we assess whether any changes in our interest or relationship with the entity affect our determination of whether the entity is a VIE and, if so, whether we are the primary beneficiary. Property and Equipment Property and equipment is comprised of technical infrastructure, office space, corporate and other assets currently in service, and assets not yet in service. Technical infrastructure includes data center land, buildings and leasehold improvements, and servers and network equipment. Office space includes office land, buildings and leasehold improvements. Assets not yet in service are those that are not ready for our intended use, including data center buildings and servers in the process of construction or assembly. Property and equipment are stated at cost less accumulated depreciation. Depreciation commences once assets are ready for our intended use and is recorded using the straight-line method over the estimated useful lives of the assets, which we regularly evaluate for factors such as technological obsolescence and our planned use and utilization. We depreciate data center and office buildings over periods of seven to 40 years. We depreciate servers and network equipment generally over a period of six years. We depreciate corporate and other assets over periods of two to 25 years. We depreciate leasehold improvements over the shorter of the remaining lease term or the estimated useful lives of the assets. Land is not depreciated. Goodwill We allocate goodwill to reporting units based on the expected benefit from the business combination. We evaluate our reporting units periodically, as well as when changes in our operating segments occur. For changes in reporting units, we reassign goodwill using a relative fair value allocation approach. We test our goodwill for impairment at least annually, or more frequently if events or changes in circumstances indicate that the asset may be impaired. Goodwill impairments were not material for the periods presented. Leases We determine if an arrangement is a lease at inception. Our lease agreements generally contain lease and non- lease components. Payments under our lease arrangements are primarily fixed. Non-lease components primarily include payments for maintenance and utilities. We combine fixed payments for non-lease components with lease payments and account for them together as a single lease component which increases the amount of our lease assets and liabilities. Certain lease agreements contain variable payments, which are expensed as incurred and not included in the lease assets and liabilities. These amounts primarily include payments affected by the Consumer Price Index, and payments for maintenance and utilities. Lease assets and liabilities are recognized at the present value of the future lease",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "63",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_63_chunk_1",
        "text": "payments at the lease commencement date. The interest rate used to determine the present value of the future lease payments is our incremental borrowing rate, because the interest rate implicit in our leases is not readily determinable. Our incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments, and in economic environments where the leased asset is located. Our lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base, non-cancelable, lease term when determining the lease assets and liabilities. Lease assets also include any prepaid lease payments and lease incentives. Lease assets and liabilities are included on our Consolidated Balance Sheets. The current portion of our operating lease liabilities is included in accrued expenses and other current liabilities, and the long-term portion is included in operating lease liabilities. Finance lease assets are included in property and equipment, net. Finance lease liabilities are included in accrued expenses and other current liabilities or other long-term liabilities. Operating lease expense (excluding variable lease costs) is recognized on a straight-line basis over the lease term. Finance lease expense is recognized on a straight-line basis over the shorter of the lease term or the useful life of the asset, and interest expense is recognized based on the incremental borrowing rate. Impairment of Long-Lived Assets We review leases, property and equipment, and intangible assets, excluding goodwill, for impairment when events or changes in circumstances indicate the carrying amount may not be recoverable. The evaluation is performed 62.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "63",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_74_chunk_0",
        "text": "Table of Contents Alphabet Inc. December 31, 2023 2024 Operating leases: Operating lease assets $ 14,091 $ 13,588 Accrued expenses and other liabilities $ 2,791 $ 2,887 Operating lease liabilities 12,460 11,691 Total operating lease liabilities $ 15,251 $ 14,578 Finance Leases: Property and equipment, at cost $ 4,403 $ 4,622 Accumulated depreciation (1,652) (2,037) Property and equipment, net $ 2,751 $ 2,585 Accrued expenses and other liabilities $ 283 $ 235 Other long-term liabilities 1,383 1,442 Total finance lease liabilities $ 1,666 $ 1,677 Supplemental cash flow information related to leases was as follows (in millions): Year Ended December 31, 2022 2023 2024 Cash payments for lease liabilities: Operating cash flows used for operating leases $ 2,722 $ 3,173 $ 3,425 Operating cash flows used for finance leases $ 34 $ 35 $ 31 Financing cash flows used for finance leases(1) $ 586 $ 705 $ 405 Assets obtained in exchange for lease liabilities: Operating leases $ 4,383 $ 2,877 $ 2,510 Finance leases $ 577 $ 564 $ 313 (1) Financing cash flows used for financing leases are included within financing activities of the Consolidated Statements of Cash Flows as repayments of debt. Future lease payments as of December 31, 2024 were as follows (in millions): Operating Finance Leases Leases 2025 $ 3,162 $ 257 2026 2,824 208 2027 2,311 208 2028 1,838 197 2029 1,448 166 Thereafter 5,455 852 Total future lease payments 17,038 1,888 Less imputed interest (2,460) (211) Total lease liability balance $ 14,578 $ 1,677 As of December 31, 2024, we have entered into leases that have not yet commenced with short-term and long- term future lease payments of $773 million and $6.5 billion, respectively, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2028 with non-cancelable lease terms between one and 25 years. Note 5. Variable Interest Entities Consolidated VIEs 73.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "74",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_75_chunk_0",
        "text": "Table of Contents Alphabet Inc. We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us, and their creditors do not have recourse to us. As of December 31, 2023 and 2024, assets that can only be used to settle obligations of these VIEs were $4.9 billion and $8.7 billion, respectively and are primarily included in cash and cash equivalents on our Consolidated Balance Sheets. As of December 31, 2023 and 2024, liabilities for which creditors only have recourse to the VIEs were $2.5 billion and $2.3 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Waymo, a fully autonomous driving technology company and a consolidated VIE, received $5.6 billion in funding during the year ended December 31, 2024, the majority of which was funded by Alphabet. Investments from external parties were accounted for as equity transactions and resulted in recognition of noncontrolling interests. As of December 31, 2023 and 2024, total noncontrolling interests (NCI) in our consolidated subsidiaries were $3.4 billion and $4.2 billion, respectively, of which $1.1 billion was redeemable noncontrolling interests (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments primarily as non-marketable equity securities or equity method investments, which are included within non-marketable securities on our Consolidated Balance Sheets. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. As of December 31, 2023 and 2024, our future funding commitments related to unconsolidated VIE investments were $1.7 billion and $1.5 billion, respectively. Note 6. Debt Short-Term Debt We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2023 and $2.3 billion of commercial paper outstanding with a weighted-average effective interest rate of 4.4% as of December 31, 2024.The estimated fair value of the commercial paper approximated its carrying value as of December 31, 2024",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "75",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_75_chunk_1",
        "text": "Our short-term debt balance also includes the current portion of certain long-term debt. Long-Term Debt Total outstanding long-term debt is summarized below (in millions, except percentages): As of December 31, Effective Maturity Coupon Rate Interest Rate 2023 2024 Debt 2014 Notes issuance 2024 3.38% 3.38% $ 1,000 $ 0 2016 Notes issuance 2026 2.00% 2.23% 2,000 2,000 2020 Notes issuance 2025 - 2060 0.45% - 2.25% 0.57% - 2.33% 10,000 10,000 Total face value of long-term debt 13,000 12,000 Unamortized discount and debt issuance costs (130) (118) Less: Current portion of long-term notes(1) (1,000) (999) Total long-term debt $ 11,870 $ 10,883 74.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "75",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_76_chunk_0",
        "text": "Table of Contents Alphabet Inc. (1) Total current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 7 for further details. The notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $10.3 billion and $9.0 billion as of December 31, 2023 and December 31, 2024, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. As of December 31, 2024, the future principal payments for long-term debt were as follows (in millions): 2025 $ 1,000 2026 2,000 2027 1,000 2028 0 2029 0 Thereafter 8,000 Total $ 12,000 Credit Facility As of December 31, 2024, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2025 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2023 and 2024. Note 7. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $771 million and $879 million as of December 31, 2023 and 2024, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of December 31, 2023 2024 Technical infrastructure $ 112,504 $ 139,596 Office space 40,435 43,714 Corporate and other assets 13,728 16,519 Property and equipment, in service 166,667 199,829 Less: accumulated depreciation (67,458) (79,390) Add: assets not yet in service 35,136 50,597 Property and equipment, net $ 134,345 $ 171,036 Accrued Expenses and Other Current Liabilities Accrued expenses and other current liabilities consisted of the following (in millions): 75.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "76",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_90_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of December 31, 2023 2024 Long-lived assets: United States $ 110,053 $ 138,993 International 38,383 45,631 Total long-lived assets $ 148,436 $ 184,624 Note 16. Subsequent Event In January 2025, we recognized an $8.0 billion unrealized gain on our non-marketable equity securities related to our investment in a private company. The unrealized gain reflects an increase in the fair value measurement of our investment following an observable transaction in January 2025. See Note 3 and Note 7 for further details on equity investments and OI&E. 89.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "90",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_20_chunk_0",
        "text": "Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of As of Effective Interest December 31, March 31, Maturity Coupon Rate Rate 2023 2024 Debt 2016-2020 Notes issuances 2025 - 2060 0.45% - 2.25% 0.57% - 2.33% $ 13,000 $ 12,000 Future finance lease payments, net and other (1) 1,746 1,672 Total debt 14,746 13,672 Unamortized discount and debt issuance costs (130) (127) Less: Current portion of long-term notes(2) (1,000) 0 Less: Current portion of future finance lease payments, net and other current debt(1)(2) (363) (317) Total long-term debt $ 13,253 $ 13,228 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 6 for further details. The notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $10.3 billion and $9.0 billion as of December 31, 2023 and March 31, 2024, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of March 31, 2024, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2024 and $6.0 billion expires in April 2028. In April 2024, we entered into a new $4.0 billion revolving credit facility expiring in April 2025. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2023 and March 31, 2024. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $771 million and $745 million as of December 31, 2023 and March 31, 2024, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2023 March 31, 2024 Land and buildings $ 74,083 $ 77,421 Information technology assets 80,594 85,976 Construction in progress 35,229 37,679 Leasehold improvements 11,425 11,576 Furniture and fixtures 472 534 Property and equipment, gross 201,803 213,186 Less: accumulated depreciation (67,458) (70,004) Property and equipment, net $ 134,345 $ 143,182 20",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "20",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_40_chunk_0",
        "text": "Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install information technology assets. During the three months ended March 31, 2023 and 2024, we spent $6.3 billion and $12.0 billion on capital expenditures, respectively. We expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the three months ended March 31, 2023 and 2024, our depreciation on property and equipment was $2.6 billion and $3.4 billion, respectively. Leases For the three months ended March 31, 2023 and 2024, we recognized total operating lease assets of $1.1 billion and $0.4 billion, respectively. As of March 31, 2024, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 8 years, was $17.2 billion. As of March 31, 2024, we have entered into leases that have not yet commenced with future lease payments of $3.6 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2024 and 2026 with non-cancelable lease terms of one to 25 years. For the three months ended March 31, 2023 and 2024, our operating lease expenses (including variable lease costs) were $1.1 billion and $1.1 billion, respectively. Finance lease costs were not material for the three months ended March 31, 2023 and 2024. Financing We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of March 31, 2024, we had no commercial paper outstanding. As of March 31, 2024, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2024 and $6.0 billion expiring in April 2028. In April 2024, we entered into a new $4.0 billion revolving credit facility expiring in April 2025.The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts have been borrowed under the credit facilities. As of March 31, 2024, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion. For additional information, see Note 5 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. We primarily utilize contract manufacturers for the assembly of our servers used in our technical",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_40_chunk_1",
        "text": "infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly Report on Form 10-Q. Share Repurchase Program During the three months ended March 31, 2024, we repurchased and subsequently retired 111 million shares for $16.1 billion. In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. As of March 31, 2024, $20.4 billion remained available for Class A and Class C share repurchases. In April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. The following table presents Class A and Class C shares repurchased and subsequently retired (in millions): 40",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_20_chunk_0",
        "text": "As of As of December 31, 2024 March 31, 2025 Operating leases: Operating lease assets $ 13,588 $ 13,722 Accrued expenses and other liabilities $ 2,887 $ 2,873 Operating lease liabilities 11,691 11,678 Total operating lease liabilities $ 14,578 $ 14,551 Finance Leases: Property and equipment, at cost $ 4,622 $ 5,219 Accumulated depreciation (2,037) (2,125) Property and equipment, net $ 2,585 $ 3,094 Accrued expenses and other liabilities $ 235 $ 100 Other long-term liabilities 1,442 1,961 Total finance lease liabilities $ 1,677 $ 2,061 Supplemental cash flow information related to leases was as follows (in millions): Three Months Ended March 31, 2024 2025 Cash payments for lease liabilities: Operating cash flows used for operating leases $ 842 $ 878 Operating cash flows used for finance leases $ 7 $ 15 Financing cash flows used for finance leases(1) $ 90 $ 192 Assets obtained in exchange for lease liabilities: Operating leases $ 404 $ 697 Finance leases $ 19 $ 523 (1) Financing cash flows used for financing leases are included within financing activities of the Consolidated Statements of Cash Flows as repayments of debt. Future lease payments as of March 31, 2025 were as follows (in millions): Operating Finance Leases Leases Remainder of 2025 $ 2,377 $ 224 2026 2,947 268 2027 2,425 270 2028 1,938 258 2029 1,536 232 Thereafter 5,741 1,254 Total future lease payments 16,964 2,506 Less imputed interest (2,413) (445) Total lease liability balance $ 14,551 $ 2,061 As of March 31, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $17.3 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years. 20",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "20",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_22_chunk_0",
        "text": "Long-Term Debt Total outstanding long-term debt is summarized below (in millions, except percentages): Effective Interest As of As of Maturity Coupon Rate Rate December 31, 2024 March 31, 2025 Debt 2016 Notes issuance 2026 2.00% 2.23% $ 2,000 $ 2,000 2020 Notes issuance 2025 - 2060 0.45% - 2.25% 0.57% - 2.33% 10,000 10,000 Total face value of long-term debt 12,000 12,000 Unamortized discount and debt issuance costs (118) (114) Less: Current portion of long-term notes(1) (999) (1,000) Total long-term debt $ 10,883 $ 10,886 (1) Total current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 7 for further details. The notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $9.0 billion and $9.1 billion as of December 31, 2024 and March 31, 2025, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of March 31, 2025, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2025 and $6.0 billion expires in April 2028. In April 2025, we entered into a new $4.0 billion revolving credit facility expiring in April 2026. Additionally, in April 2025 we terminated the $6.0 billion revolving credit facility expiring in April 2028 and entered into a new $6.0 billion revolving credit facility expiring in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts were outstanding under the credit facilities as of December 31, 2024 and March 31, 2025. Note 7. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $879 million and $915 million as of December 31, 2024 and March 31, 2025, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2024 March 31, 2025 Technical infrastructure(1) $ 139,596 $ 150,992 Office space 43,714 44,871 Corporate and other assets 16,519 17,336 Property and equipment, in service 199,829 213,199 Less: accumulated depreciation (79,390) (83,778) Add: assets not yet in service 50,597 55,641 Property and equipment, net $ 171,036 $ 185,062 (1) As of December 31, 2024 and March 31, 2025, approximately 60% of technical infrastructure assets were comprised of servers and network equipment. The remaining balance was comprised of data center land and buildings and related assets. 22",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_21_chunk_0",
        "text": "Table of Contents Alphabet Inc. Offsetting of Derivatives The gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions): Offsetting of Assets As of December 31, 2021 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Assets Assets Sheets Sheets Instruments Received Received Exposed Derivatives $ 999 $ (38) $ 961 $ (434) (1) $ (394) $ (12) $ 121 As of June 30, 2022 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Assets Assets Sheets Sheets Instruments Received Received Exposed Derivatives $ 1,773 $ (76) $ 1,697 $ (736) (1) $ (880) $ (18) $ 63 (1) The balances as of December 31, 2021 and June 30, 2022 were related to derivative liabilities which are allowed to be net settled against derivative assets in accordance with our master netting agreements. Offsetting of Liabilities As of December 31, 2021 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Liabilities Sheets Sheets Instruments Pledged Pledged Liabilities Derivatives $ 619 $ (38) $ 581 $ (434) (2) $ (4) $ (110) $ 33 As of June 30, 2022 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Liabilities Sheets Sheets Instruments Pledged Pledged Liabilities Derivatives $ 917 $ (76) $ 841 $ (736) (2) $ (13) $ (1) $ 91 (2) The balances as of December 31, 2021 and June 30, 2022 were related to derivative assets which are allowed to be net settled against derivative liabilities in accordance with our master netting agreements. 21",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "21",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_22_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 4. Variable Interest Entities (VIE) Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2021 and June 30, 2022, assets that can only be used to settle obligations of these VIEs were $6.0 billion and $4.5 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.5 billion for both periods. As of December 31, 2021 and June 30, 2022, total noncontrolling interests (NCI), including redeemable noncontrolling interests (RNCI), in our consolidated subsidiaries was $4.3 billion and $4.1 billion, respectively. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of other income (expense), net. See Note 6 for further details on other income (expense), net. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. We have determined that the single source of our exposure to these VIEs is our capital investments in them. The carrying value and maximum exposure of these unconsolidated VIEs were $2.7 billion and $2.9 billion, respectively, as of December 31, 2021 and $2.4 billion and $2.4 billion, respectively, as of June 30, 2022. Note 5. Debt Short-Term Debt We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2021 and June 30, 2022. Our short-term debt balance also includes the current portion of certain long-term debt. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of Effective Interest December 31, As of Maturity Coupon Rate Rate 2021 June 30, 2022 Debt 2014-2020 Notes Issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000 Future finance lease payments, net and other (1) 2,086 1,966 Total debt 15,086 14,966 Unamortized discount and debt issuance costs (156) (150) Less: Current portion future finance lease payments,",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_22_chunk_1",
        "text": "net and other current debt(1)(2) (113) (82) Total long-term debt $ 14,817 $ 14,734 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 6. 22",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "22",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_22_chunk_0",
        "text": "Table of Contents Alphabet Inc. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of Effective Interest December 31, As of Maturity Coupon Rate Rate 2022 June 30, 2023 Debt 2014-2020 Notes issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000 Future finance lease payments, net and other (1) 2,142 2,159 Total debt 15,142 15,159 Unamortized discount and debt issuance costs (143) (137) Less: Current portion of long-term notes(2) 0 (999) Less: Current portion future finance lease payments, net and other current debt(1)(2) (298) (318) Total long-term debt $ 14,701 $ 13,705 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 6 for further details. The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $9.9 billion and $10.1 billion as of December 31, 2022 and June 30, 2023, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of June 30, 2023, we had $10.0 billion of revolving credit facilities of which $4.0 billion expires in April 2024 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2022 and June 30, 2023. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $754 million and $836 million as of December 31, 2022 and June 30, 2023, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2022 June 30, 2023 Land and buildings $ 66,897 $ 68,890 Information technology assets 66,267 71,592 Construction in progress 27,657 32,019 Leasehold improvements 10,575 11,286 Furniture and fixtures 314 338 Property and equipment, gross 171,710 184,125 Less: accumulated depreciation (59,042) (62,917) Property and equipment, net $ 112,668 $ 121,208 22",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_22_chunk_0",
        "text": "Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of Effective Interest December 31, As of Maturity Coupon Rate Rate 2023 June 30, 2024 Debt 2016-2020 Notes issuances 2025 - 2060 0.45% - 2.25% 0.57% - 2.33% $ 13,000 $ 12,000 Future finance lease payments, net and other debt (1) 1,746 2,280 Total debt 14,746 14,280 Unamortized discount and debt issuance costs (130) (124) Less: Current portion of long-term notes(2) (1,000) 0 Less: Current portion of future finance lease payments, net and other current debt(1)(2) (363) (918) Total long-term debt $ 13,253 $ 13,238 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 6 for further details. The notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $10.3 billion and $8.9 billion as of December 31, 2023 and June 30, 2024, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of June 30, 2024, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2025 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2023 and June 30, 2024. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $771 million and $850 million as of December 31, 2023 and June 30, 2024, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2023 June 30, 2024 Land and buildings $ 74,083 $ 78,641 Information technology assets 80,594 91,994 Construction in progress 35,229 40,742 Leasehold improvements 11,425 12,010 Furniture and fixtures 472 584 Property and equipment, gross 201,803 223,971 Less: accumulated depreciation (67,458) (72,816) Property and equipment, net $ 134,345 $ 151,155 22",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_45_chunk_0",
        "text": "Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install information technology assets. During the six months ended June 30, 2023 and 2024, we spent $13.2 billion and $25.2 billion on capital expenditures, respectively. We expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the six months ended June 30, 2023 and 2024, our depreciation on property and equipment was $5.5 billion and $7.1 billion, respectively. Leases For the six months ended June 30, 2023 and 2024, we recognized total operating lease assets of $1.7 billion and $897 million, respectively. As of June 30, 2024, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 7.9 years, was $16.9 billion. As of June 30, 2024, we have entered into leases that have not yet commenced with future lease payments of $5.2 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2024 and 2027 with non-cancelable lease terms of one to 25 years. For the six months ended June 30, 2023 and 2024, our operating lease expenses (including variable lease costs) were $2.2 billion and $2.3 billion, respectively. Finance lease costs were not material for the six months ended June 30, 2023 and 2024. Financing We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of June 30, 2024, we had no commercial paper outstanding. As of June 30, 2024, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2025 and $6.0 billion expiring in April 2028.The interest",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "45",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_45_chunk_1",
        "text": "rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts have been borrowed under the credit facilities. As of June 30, 2024, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion. For additional information, see Note 5 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. We primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly Report on Form 10-Q. Share Repurchase Program 45",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "45",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_23_chunk_0",
        "text": "As of As of December 31, 2024 June 30, 2025 Operating leases: Operating lease assets $ 13,588 $ 14,255 Accrued expenses and other liabilities $ 2,887 $ 3,007 Operating lease liabilities 11,691 11,952 Total operating lease liabilities $ 14,578 $ 14,959 Finance Leases: Property and equipment, at cost $ 4,622 $ 5,410 Accumulated depreciation (2,037) (2,209) Property and equipment, net $ 2,585 $ 3,201 Accrued expenses and other liabilities $ 235 $ 100 Other long-term liabilities 1,442 2,002 Total finance lease liabilities $ 1,677 $ 2,102 Supplemental cash flow information related to leases was as follows (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Cash payments for lease liabilities: Operating cash flows used for operating leases $ 844 $ 783 $ 1,686 $ 1,661 Operating cash flows used for finance leases $ 7 $ 16 $ 14 $ 31 Financing cash flows used for finance leases(1) $ 97 $ 110 $ 187 $ 302 Assets obtained in exchange for lease liabilities: Operating leases $ 493 $ 831 $ 897 $ 1,528 Finance leases $ 146 $ 83 $ 165 $ 606 (1) Financing cash flows used for financing leases are included within financing activities of the Consolidated Statements of Cash Flows as repayments of debt. Future lease payments as of June 30, 2025 were as follows (in millions): Operating Finance Leases Leases Remainder of 2025 $ 2,095 $ 162 2026 3,078 299 2027 2,549 301 2028 2,042 290 2029 1,630 268 Thereafter 6,035 1,310 Total future lease payments 17,429 2,630 Less imputed interest (2,470) (528) Total lease liability balance $ 14,959 $ 2,102 As of June 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $23.9 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years. 23",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "23",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_21_chunk_0",
        "text": "Table of Contents Alphabet Inc. Offsetting of Derivatives The gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions): Offsetting of Assets As of December 31, 2021 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Assets Assets Sheets Sheets Instruments Received Received Exposed Derivatives $ 999 $ (38) $ 961 $ (434) (1) $ (394) $ (12) $ 121 As of September 30, 2022 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Assets Assets Sheets Sheets Instruments Received Received Exposed Derivatives $ 2,639 $ (50) $ 2,589 $ (755) (1) $ (1,609) $ (32) $ 193 (1) The balances as of December 31, 2021 and September 30, 2022 were related to derivative liabilities which are allowed to be net settled against derivative assets in accordance with our master netting agreements. Offsetting of Liabilities As of December 31, 2021 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Liabilities Sheets Sheets Instruments Pledged Pledged Liabilities Derivatives $ 619 $ (38) $ 581 $ (434) (2) $ (4) $ (110) $ 33 As of September 30, 2022 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Presented in Gross Offset in the the Amounts of Consolidated Consolidated Cash Non-Cash Recognized Balance Balance Financial Collateral Collateral Net Liabilities Sheets Sheets Instruments Pledged Pledged Liabilities Derivatives $ 928 $ (50) $ 878 $ (755) (2) $ (15) $ (2) $ 106 (2) The balances as of December 31, 2021 and September 30, 2022 were related to derivative assets which are allowed to be net settled against derivative liabilities in accordance with our master netting agreements. 21",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "21",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_22_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 4. Variable Interest Entities (VIE) Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2021 and September 30, 2022, assets that can only be used to settle obligations of these VIEs were $6.0 billion and $4.8 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.5 billion and $2.7 billion, respectively. As of December 31, 2021 and September 30, 2022, total noncontrolling interests (NCI), including redeemable noncontrolling interests (RNCI), in our consolidated subsidiaries were $4.3 billion and $3.9 billion, respectively. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of other income (expense), net. See Note 6 for further details on other income (expense), net. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. We have determined that the single source of our exposure to these VIEs is our capital investments in them. The carrying value and maximum exposure of these unconsolidated VIEs were $2.7 billion and $2.9 billion, respectively, as of December 31, 2021 and $2.6 billion and $2.6 billion, respectively, as of September 30, 2022. Note 5. Debt Short-Term Debt We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2021 and September 30, 2022. Our short-term debt balance also includes the current portion of certain long-term debt. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of As of Effective Interest December 31, September 30, Maturity Coupon Rate Rate 2021 2022 Debt 2014-2020 Notes Issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000 Future finance lease payments, net and other (1) 2,086 2,213 Total debt 15,086 15,213 Unamortized discount and debt issuance costs (156) (146) Less: Current portion future finance lease",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_22_chunk_1",
        "text": "payments, net and other current debt(1)(2) (113) (414) Total long-term debt $ 14,817 $ 14,653 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 6 for further details. 22",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "22",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of investments in servers and network equipment for computing, storage and networking requirements for ongoing business activities, including machine learning (collectively referred to as information technology assets) and data center land and building construction; and • office facilities, ground up development projects, and related building improvements. Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service for our intended use. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi- year projects with multiple phases, where we acquire qualified land and buildings, construct buildings, and secure and install information technology assets. During the nine months ended September 30, 2021 and 2022, capital expenditures were $18.3 billion and $23.9 billion, respectively. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the nine months ended September 30, 2021 and 2022, depreciation and impairment expenses on property and equipment were $8.3 billion and $11.2 billion, respectively. Leases For the nine months ended September 30, 2021 and 2022, we recognized total operating lease assets of $2.2 billion and $3.4 billion, respectively. As of September 30, 2022, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 9 years, was $16.8 billion. As of September 30, 2022, we have entered into leases that have not yet commenced with future lease payments of $4.1 billion, excluding purchase options, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2022 and 2026 with non-cancelable lease terms of 1 to 25 years. For the nine months ended September 30, 2021 and 2022, our operating lease expenses (including variable lease costs) were $2.5 billion and $2.7 billion, respectively. Finance lease costs were not material for the nine months ended September 30, 2021 and 2022. Financing We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of September 30, 2022, we had no commercial paper outstanding. As of September 30, 2022, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2023 and $6.0 billion expiring in April 2026. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "46",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_46_chunk_1",
        "text": "have been borrowed under the credit facilities. As of September 30, 2022, we had senior unsecured notes outstanding with a total carrying value of $12.9 billion. See Note 5 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information on our debt. Share Repurchase Program In April 2022, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. As of September 30, 2022, $43.5 billion remains available for Class A and Class C share repurchases. In accordance with the authorization of the Board of Directors of Alphabet, during the three and nine months ended September 30, 2022, we repurchased and subsequently retired 138 million and 369 million aggregate shares for $15.4 billion and $43.9 billion, respectively. Of the aggregate amount repurchased and subsequently retired during the three months ended September 30, 2022, 25 million shares were Class A stock for $2.7 billion and 113 million shares were Class C stock for $12.7 billion. Of the aggregate amount repurchased and 46",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "46",
            "chunk_index": 1,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_22_chunk_0",
        "text": "Table of Contents Alphabet Inc. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): As of As of Effective Interest December 31, September 30, Maturity Coupon Rate Rate 2022 2023 Debt 2014-2020 Notes issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000 Future finance lease payments, net and other (1) 2,142 2,314 Total debt 15,142 15,314 Unamortized discount and debt issuance costs (143) (133) Less: Current portion of long-term notes(2) 0 (1,000) Less: Current portion of future finance lease payments, net and other current debt(1)(2) (298) (400) Total long-term debt $ 14,701 $ 13,781 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 6 for further details. The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $9.9 billion and $9.6 billion as of December 31, 2022 and September 30, 2023, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of September 30, 2023, we had $10.0 billion of revolving credit facilities of which $4.0 billion expires in April 2024 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2022 and September 30, 2023. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $754 million and $832 million as of December 31, 2022 and September 30, 2023, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2022 September 30, 2023 Land and buildings $ 66,897 $ 71,357 Information technology assets 66,267 74,928 Construction in progress 27,657 32,305 Leasehold improvements 10,575 11,441 Furniture and fixtures 314 424 Property and equipment, gross 171,710 190,455 Less: accumulated depreciation (59,042) (64,750) Property and equipment, net $ 112,668 $ 125,705 22",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_22_chunk_0",
        "text": "Our short-term debt balance also includes the current portion of certain long-term debt. Long-Term Debt Total outstanding debt is summarized below (in millions, except percentages): Effective Interest As of As of Maturity Coupon Rate Rate December 31, 2023 September 30, 2024 Debt 2016-2020 Notes 2025 - 2060 0.45% - 2.25% 0.57% - 2.33% $ 13,000 $ 12,000 issuances Future finance lease payments, net and other debt (1) 1,746 2,785 Total debt 14,746 14,785 Unamortized discount and debt issuance costs (130) (121) Less: Current portion of long-term notes(2) (1,000) (999) Less: Current portion of future finance lease payments, net and other current debt(1)(2) (363) (1,368) Total long-term debt $ 13,253 $ 12,297 (1) Future finance lease payments are net of imputed interest. (2) Total current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 6 for further details. The notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $10.3 billion and $9.5 billion as of December 31, 2023 and September 30, 2024, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of September 30, 2024, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2025 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2023 and September 30, 2024. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $771 million and $857 million as of December 31, 2023 and September 30, 2024, respectively.",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "22",
            "chunk_index": 0,
            "page_section": "balance_sheet"
        }
    }
]