[
    {
        "id": "goog-10-k-2023-final.pdf-page-46-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to financial market risks, including changes in foreign currency exchange rates, interest rates,\nand equity investment risks.\nForeign Currency Exchange Risk\nWe transact business globally in multiple currencies. International revenues, as well as costs and expenses\ndenominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the\nU.S. dollar. As discussed below, we enter into derivative instruments to hedge foreign currency risk. Principal\ncurrencies hedged included the Australian dollar, British pound, Canadian dollar, Euro, and Japanese yen. For the\npurpose of analyzing foreign currency exchange risk, we considered the historical trends in foreign currency exchange\nrates and determined that it was reasonably possible that adverse changes in exchange rates of 10% could be\nexperienced.\nWe use foreign currency forward and option contracts to offset the foreign exchange risk on assets and liabilities\ndenominated in currencies other than the functional currency of the subsidiary. These forward and option contracts\nreduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements on our assets and\nliabilities. The foreign currency gains and losses on these assets and liabilities are recorded in OI&E, which are offset\nby the gains and losses on the forward and option contracts.\nIf an adverse 10% foreign currency exchange rate change was applied to total monetary assets, liabilities, and\ncommitments denominated in currencies other than the functional currencies at the balance sheet date, it would have\nresulted in an adverse effect on income before income taxes of approximately $136 million and $503 million as of\nDecember 31, 2022 and 2023, respectively, after consideration of the effect of foreign exchange contracts in place for\nthe years ended December 31, 2022 and 2023.\nWe use foreign currency forward and option contracts, including collars (an option strategy comprised of a\ncombination of purchased and written options) to protect forecasted U.S. dollar-equivalent earnings from changes in\nforeign currency exchange rates. When the U.S. dollar strengthens, gains from foreign currency forward and option\ncontacts reduce the foreign currency losses related to our earnings. When the U.S. dollar weakens, losses from foreign\ncurrency forward and option contracts offset the foreign currency gains related to our earnings. These hedging\ncontracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements. We designate\nthese contracts as cash flow hedges for accounting purposes. We reflect the gains or losses of foreign currency spot\nrate changes as a component of accumulated other comprehensive income (AOCI) and subsequently reclassify them\ninto revenues to offset the hedged exposures as they occur.\nIf the U.S. dollar weakened by 10% as of December 31, 2022 and 2023, the amount recorded in AOCI related to\nour cash flow hedges before tax effect would have been approximately $1.3 billion and $1.5 billion lower as of\nDecember 31, 2022 and 2023, respectively. The change in the value recorded in AOCI would be expected to offset a\ncorresponding foreign currency change in forecasted hedged revenues when recognized.\nWe use foreign exchange forward contracts designated as net investment hedges to hedge the foreign currency\nrisks related to investment in foreign subsidiaries. These forward contracts serve to offset the foreign currency\ntranslation risk from our foreign operations.\nIf the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI\nrelated to our net investment hedges before tax effect would have been approximately $903 million and $946 million\nlower as of December 31, 2022 and 2023, respectively. The change in value recorded in CTA would be expected to\noffset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries.\nInterest Rate Risk\nOur Corporate Treasury investment strategy is to achieve a return that will allow us to preserve capital and\nmaintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities,\nmortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate\nderivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and\nfloating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair\nmarket value adversely affected due to a rise in interest rates, while floating rate securities may produce less income\nthan predicted if interest rates fall. Unrealized gains or losses on our marketable debt securities are primarily due to\ninterest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt\nsecurities, we have elected the fair value option for which changes in fair value are recorded in OI&E. We measure\nsecurities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until\nthe securities are sold, less any expected credit losses.\n45.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "46",
            "page_section": "market_risk_disclosures",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf-page-47-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nWe use value-at-risk (VaR) analysis to determine the potential effect of fluctuations in interest rates on the value\nof our marketable debt security portfolio. The VaR is the expected loss in fair value, for a given confidence interval, for\nour investment portfolio due to adverse movements in interest rates. We use a variance/covariance VaR model with\n95% confidence interval. The estimated one-day loss in fair value of marketable debt securities as of December 31,\n2022 and 2023 are shown below (in millions):\n12-Month Average\nAs of December 31, As of December 31,\n2022 2023 2022 2023\nRisk category - interest rate $ 256 $ 296 $ 198 $ 271\nActual future gains and losses associated with our marketable debt security portfolio may differ materially from the\nsensitivity analyses performed as of December 31, 2022 and 2023 due to the inherent limitations associated with\npredicting the timing and amount of changes in interest rates and our actual exposures and positions. VaR analysis is\nnot intended to represent actual losses but is used as a risk estimation.\nEquity Investment Risk\nOur marketable and non-marketable equity securities are subject to a wide variety of market-related risks that\ncould substantially reduce or increase the fair value of our holdings.\nOur marketable equity securities are publicly traded stocks or funds and our non-marketable equity securities are\ninvestments in privately held companies, some of which are in the startup or development stages.\nWe record marketable equity securities not accounted for under the equity method at fair value based on readily\ndeterminable market values, of which publicly traded stocks and mutual funds are subject to market price volatility, and\nrepresent $5.2 billion and $6.0 billion of our investments as of December 31, 2022 and 2023, respectively. A\nhypothetical adverse price change of 10% on our December 31, 2023 balance would decrease the fair value of\nmarketable equity securities by $597 million. From time to time, we may enter into derivatives to hedge the market\nprice risk on certain of our marketable equity securities.\nOur non-marketable equity securities not accounted for under the equity method are adjusted to fair value for\nobservable transactions for identical or similar investments of the same issuer or impairment (referred to as the\nmeasurement alternative). The fair value measured at the time of the observable transaction is not necessarily an\nindication of the current fair value as of the balance sheet date. These investments, especially those that are in the\nearly stages, are inherently risky because the technologies or products these companies have under development are\ntypically in the early phases and may never materialize, and they may experience a decline in financial condition,\nwhich could result in a loss of a substantial part of our investment in these companies. Valuations of our equity\ninvestments in private companies are inherently more complex due to the lack of readily available market data and\nobservable transactions at lower valuations could result in significant losses. In addition, global economic conditions\ncould result in additional volatility. The success of our investment in any private company is also typically dependent on\nthe likelihood of our ability to realize appreciation in the value of investments through liquidity events such as public\nofferings, acquisitions, private sales or other market events. Changes in the valuation of non-marketable equity\nsecurities may not directly correlate with changes in valuation of marketable equity securities. As of December 31,\n2022 and 2023, the carrying value of our non-marketable equity securities, which were accounted for under the\nmeasurement alternative, was $28.5 billion and $28.8 billion, respectively.\nThe carrying values of our equity method investments, which totaled approximately $1.7 billion as of\nDecember 31, 2022 and 2023, generally do not fluctuate based on market price changes. However, these investments\ncould be impaired if the carrying value exceeds the fair value and is not expected to recover.\nFor additional information about our equity investments, see Note 1 and Note 3 of the Notes to Consolidated\nFinancial Statements included in Item 8 of this Annual Report on Form 10-K.\n46.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "47",
            "page_section": "market_risk_disclosures",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf-page-69-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nDerivative Financial Instruments\nWe use derivative instruments to manage risks relating to our ongoing business operations. The primary risk\nmanaged is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings,\nand investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We\nalso enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns.\nWe recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives\nprimarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a\ncombination of purchased and written options) at net fair values and present all other derivatives at gross fair values.\nThe accounting treatment for derivatives is based on the intended use and hedge designation.\nCash Flow Hedges\nWe designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge\ncertain forecasted revenue transactions denominated in currencies other than the U.S. dollar. These contracts have\nmaturities of 24 months or less.\nCash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and\nsubsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and\ntime value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the\nhedging instrument in revenues. The difference between fair value changes of the excluded component and the\namount amortized to revenues is recorded in AOCI.\nAs of December 31, 2023, the net accumulated gain on our foreign currency cash flow hedges before tax effect\nwas $47 million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nFair Value Hedges\nWe designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our\nmarketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the\nassessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related\nhedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the\nexcluded component in OI&E.\nNet Investment Hedges\nWe designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks\nrelated to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge\neffectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude forward\npoints from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nOther Derivatives\nWe enter into foreign currency forward and option contracts that are not designated as hedging instruments to\nhedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the\nfunctional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting\nhedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and\nliabilities.\nWe also use derivatives not designated as hedging instruments to manage risks relating to interest rates,\ncommodity prices, credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to\nhedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other\nderivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details.\n68.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "69",
            "page_section": "market_risk_disclosures",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2024.pdf-page-70-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nDerivative Financial Instruments\nWe use derivative instruments to manage risks relating to our ongoing business operations. The primary risk\nmanaged is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings,\nand investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We\nalso enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns.\nWe recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives\nprimarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a\ncombination of purchased and written options) at net fair values and present all other derivatives at gross fair values.\nThe accounting treatment for derivatives is based on the intended use and hedge designation.\nCash Flow Hedges\nWe designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge\ncertain forecasted revenue transactions denominated in currencies other than the U.S. dollar. These contracts have\nmaturities of 24 months or less.\nCash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and\nsubsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and\ntime value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the\nhedging instrument in revenues. The difference between fair value changes of the excluded component and the\namount amortized to revenues is recorded in AOCI.\nAs of December 31, 2024, the net accumulated gain on our foreign currency cash flow hedges before tax effect\nwas $731 million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nFair Value Hedges\nWe designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our\nmarketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the\nassessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related\nhedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the\nexcluded component in OI&E.\nNet Investment Hedges\nWe designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks\nrelated to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge\neffectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude forward\npoints from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nOther Derivatives\nWe enter into foreign currency forward and option contracts that are not designated as hedging instruments to\nhedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the\nfunctional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting\nhedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and\nliabilities.\nWe also use derivatives not designated as hedging instruments to manage risks relating to interest rates,\ncommodity prices, and credit exposures, and to enhance investment returns. From time to time, we enter into\nderivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from\nother derivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details.\n69.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "70",
            "page_section": "market_risk_disclosures",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf-page-16-text",
        "text": "Financial filing text section: Derivative Financial Instruments\nWe use derivative instruments to manage risks relating to our ongoing business operations. The primary risk\nmanaged is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows,\nearnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate\nfluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance\ninvestment returns.\nWe recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the\nderivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy\ncomprised of a combination of purchased and written options) at net fair values and present all other derivatives at\ngross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation.\nCash Flow Hedges\nWe designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge\ncertain forecasted revenue transactions denominated in currencies other than the United States (U.S.) dollar. These\ncontracts have maturities of 24 months or less.\nCash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and\nsubsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points\nand time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life\nof the hedging instrument in revenues. The difference between fair value changes of the excluded component and\nthe amount amortized to revenues is recorded in AOCI.\nAs of March 31, 2024, the net accumulated gain on our foreign currency cash flow hedges before tax effect\nwas $128 million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nFair Value Hedges\nWe designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our\nmarketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in\nthe assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the\nrelated hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize\nchanges in the excluded component in OI&E.\nNet Investment Hedges\nWe designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks\nrelated to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of\nhedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude\nforward points from the assessment of hedge effectiveness and recognize changes in the excluded component in\nOI&E.\nOther Derivatives\nWe enter into foreign currency forward and option contracts that are not designated as hedging instruments to\nhedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the\nfunctional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting\nhedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and\nliabilities.\nWe also use derivatives not designated as hedging instruments to manage risks relating to interest rates,\ncommodity prices, and credit exposures, and to enhance investment returns. From time to time, we enter into\nderivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising\nfrom other derivatives are primarily reflected within the “other” component of OI&E. See Note 6 for further details.\n16",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "16",
            "page_section": "market_risk_disclosures",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf-page-48-text",
        "text": "Financial filing text section: ITEM 3. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nFor quantitative and qualitative disclosures about market risk, refer to Part II, Item 7A, Quantitative and\nQualitative Disclosures About Market Risk, in our Annual Report on Form 10-K for the year ended December 31,\n2023.\nITEM 4. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our chief executive officer and chief financial officer, evaluated the\neffectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 under the Exchange Act, as of the\nend of the period covered by this Quarterly Report on Form 10-Q.\nBased on this evaluation, our chief executive officer and chief financial officer concluded that, as of\nSeptember 30, 2024, our disclosure controls and procedures are designed at a reasonable assurance level and are\neffective to provide reasonable assurance that information we are required to disclose in reports that we file or\nsubmit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified\nin the SEC’s rules and forms, and that such information is accumulated and communicated to our management,\nincluding our chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding\nrequired disclosure.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the quarter\nended September 30, 2024 that have materially affected, or are reasonably likely to materially affect, our internal\ncontrol over financial reporting.\nLimitations on Effectiveness of Controls and Procedures\nIn designing and evaluating the disclosure controls and procedures, management recognizes that any controls\nand procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving\nthe desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that\nthere are resource constraints and that management is required to apply its judgment in evaluating the benefits of\npossible controls and procedures relative to their costs.\n48",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "48",
            "page_section": "market_risk_disclosures",
            "chunk_type": "prose"
        }
    }
]