[
    {
        "id": "goog-10-k-2022.pdf_page_38_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents our cash flows (in millions): Year Ended December 31, 2021 2022 Net cash provided by operating activities $ 91,652 $ 91,495 Net cash used in investing activities $ (35,523) $ (20,298) Net cash used in financing activities $ (61,362) $ (69,757) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. Additionally, we generate cash through sales of apps and in-app purchases, and hardware; and licensing and service fees, including fees received for Google Cloud offerings and subscription-based products. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for hardware, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities decreased from 2021 to 2022 primarily due to the net effect of an increase in cash received from revenues, offset by increases in cash paid for cost of revenues and operating expenses and an increase in tax payments driven by the effects of capitalization and amortization of R&D expenses beginning in 2022 as required by the 2017 Tax Cuts and Jobs Act. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non- marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities decreased from 2021 to 2022 as a result of a decrease in net purchases of and maturities and sales of marketable securities, partially offset by an increase in purchases of property and equipment. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interest in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from 2021 to 2022 primarily due to an increase in repurchases of stock. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "38",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_38_chunk_1",
        "text": "for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple 37",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "38",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_52_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions) Year Ended December 31, 2020 2021 2022 Operating activities Net income $ 40,269 $ 76,033 $ 59,972 Adjustments: Depreciation and impairment of property and equipment 12,905 11,555 15,287 Amortization and impairment of intangible assets 792 886 641 Stock-based compensation expense 12,991 15,376 19,362 Deferred income taxes 1,390 1,808 (8,081) (Gain) loss on debt and equity securities, net (6,317) (12,270) 5,519 Other 1,267 (213) 1,030 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net (6,524) (9,095) (2,317) Income taxes, net 1,209 (625) 584 Other assets (1,330) (1,846) (5,046) Accounts payable 694 283 707 Accrued expenses and other liabilities 5,504 7,304 3,915 Accrued revenue share 1,639 1,682 (445) Deferred revenue 635 774 367 Net cash provided by operating activities 65,124 91,652 91,495 Investing activities Purchases of property and equipment (22,281) (24,640) (31,485) Purchases of marketable securities (136,576) (135,196) (78,874) Maturities and sales of marketable securities 132,906 128,294 97,822 Purchases of non-marketable securities (7,175) (2,838) (2,531) Maturities and sales of non-marketable securities 1,023 934 150 Acquisitions, net of cash acquired, and purchases of intangible assets (738) (2,618) (6,969) Other investing activities 68 541 1,589 Net cash used in investing activities (32,773) (35,523) (20,298) Financing activities Net payments related to stock-based award activities (5,720) (10,162) (9,300) Repurchases of stock (31,149) (50,274) (59,296) Proceeds from issuance of debt, net of costs 11,761 20,199 52,872 Repayments of debt (2,100) (21,435) (54,068) Proceeds from sale of interest in consolidated entities, net 2,800 310 35 Net cash used in financing activities (24,408) (61,362) (69,757) Effect of exchange rate changes on cash and cash equivalents 24 (287) (506) Net increase (decrease) in cash and cash equivalents 7,967 (5,520) 934 Cash and cash equivalents at beginning of period 18,498 26,465 20,945 Cash and cash equivalents at end of period $ 26,465 $ 20,945 $ 21,879 Supplemental disclosures of cash flow information Cash paid for income taxes, net of refunds $ 4,990 $ 13,412 $ 18,892 See accompanying notes. 51",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "52",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents our cash flows (in millions): Year Ended December 31, 2022 2023 Net cash provided by operating activities $ 91,495 $ 101,746 Net cash used in investing activities $ (20,298) $ (27,063) Net cash used in financing activities $ (69,757) $ (72,093) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions and the sale of apps and in-app purchases and devices. In Google Cloud we generate cash through consumption-based fees and subscriptions for infrastructure, platform, collaboration tools, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from 2022 to 2023 due to the increase in cash received from customers, partially offset by increases in cash paid for cost of revenues and operating expenses. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non- marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from 2022 to 2023 due to a decrease in maturities and sales of marketable securities, partially offset by a decrease in payments for acquisitions. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from 2022 to 2023 due to an increase in repurchases of stock. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities,",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "42",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_42_chunk_1",
        "text": "ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install information technology assets. 41.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "42",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_56_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions) Year Ended December 31, 2021 2022 2023 Operating activities Net income $ 76,033 $ 59,972 $ 73,795 Adjustments: Depreciation of property and equipment 10,273 13,475 11,946 Stock-based compensation expense 15,376 19,362 22,460 Deferred income taxes 1,808 (8,081) (7,763) (Gain) loss on debt and equity securities, net (12,270) 5,519 823 Other 1,955 3,483 4,330 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net (9,095) (2,317) (7,833) Income taxes, net (625) 584 523 Other assets (1,846) (5,046) (2,143) Accounts payable 283 707 664 Accrued expenses and other liabilities 7,304 3,915 3,937 Accrued revenue share 1,682 (445) 482 Deferred revenue 774 367 525 Net cash provided by operating activities 91,652 91,495 101,746 Investing activities Purchases of property and equipment (24,640) (31,485) (32,251) Purchases of marketable securities (135,196) (78,874) (77,858) Maturities and sales of marketable securities 128,294 97,822 86,672 Purchases of non-marketable securities (2,838) (2,531) (3,027) Maturities and sales of non-marketable securities 934 150 947 Acquisitions, net of cash acquired, and purchases of intangible assets (2,618) (6,969) (495) Other investing activities 541 1,589 (1,051) Net cash used in investing activities (35,523) (20,298) (27,063) Financing activities Net payments related to stock-based award activities (10,162) (9,300) (9,837) Repurchases of stock (50,274) (59,296) (61,504) Proceeds from issuance of debt, net of costs 20,199 52,872 10,790 Repayments of debt (21,435) (54,068) (11,550) Proceeds from sale of interest in consolidated entities, net 310 35 8 Net cash used in financing activities (61,362) (69,757) (72,093) Effect of exchange rate changes on cash and cash equivalents (287) (506) (421) Net increase (decrease) in cash and cash equivalents (5,520) 934 2,169 Cash and cash equivalents at beginning of period 26,465 20,945 21,879 Cash and cash equivalents at end of period $ 20,945 $ 21,879 $ 24,048 Supplemental disclosures of cash flow information Cash paid for income taxes, net of refunds $ 13,412 $ 18,892 $ 19,164 See accompanying notes. 55.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "56",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. expenses. Additionally, a decrease in the 2024 U.S. federal Foreign Derived Intangible Income tax deduction contributed to an increase in the effective tax rate. These factors were partially offset by an increase in stock-based compensation-related tax benefits in 2024. The OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the 2024 fiscal year. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of December 31, 2024, we had $95.7 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Year Ended December 31, 2023 2024 Net cash provided by operating activities $ 101,746 $ 125,299 Net cash used in investing activities $ (27,063) $ (45,536) Net cash used in financing activities $ (72,093) $ (79,733) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from 2023 to 2024 due to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non- marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from 2023 to 2024 primarily due to an increase in purchases of property and equipment and purchases of",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "42",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_42_chunk_1",
        "text": "marketable securities, partially offset by increases in maturities and sales of marketable securities. The increase in purchases of property and equipment is primarily driven by investments in technical infrastructure. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt. Net cash used in financing activities increased from 2023 to 2024 due to dividend payments and net payments related to stock-based award activities, partially offset by an increase in proceeds from issuance of debt, net of repayments. 41.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "42",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_43_chunk_0",
        "text": "Table of Contents Alphabet Inc. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Assets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment. During the years ended December 31, 2023 and 2024, we spent $32.3 billion and $52.5 billion on capital expenditures, respectively. We expect to increase, relative to 2024, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. For the years ended December 31, 2023 and 2024, our depreciation on property and equipment was $11.9 billion and $15.3 billion, respectively. Leases For the years ended December 31, 2023 and 2024, we recognized additional operating lease assets of $2.9 billion and $2.5 billion, and additional finance lease assets of $564 million and $313 million, respectively. As of December 31, 2024, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 7.8 years, was $17.0 billion, of which $3.2 billion is short-term, and total future lease payments under finance leases, which had a weighted average remaining lease term of 10.4 years, was $1.9 billion, of which $257 million is short-term. As of December 31, 2024, we have entered into leases that have not yet commenced with future short-term and long-term lease payments of $773 million and $6.5 billion, respectively, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2028 with non-cancelable lease terms of one to 25 years. For the years ended December 31, 2023",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "43",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_43_chunk_1",
        "text": "and 2024, our operating lease expenses (including variable lease costs) were $4.5 billion and $4.7 billion, respectively. Finance lease costs were $504 million and $444 million for the years ended December 31, 2023 and 2024, respectively. For additional information, see Note 4 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Financing We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of December 31, 2024, we had $2.3 billion of short-term commercial paper outstanding. As of December 31, 2024, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion with short-term and long-term future interest payments of $197 million and $3.4 billion, respectively. As of December 31, 2024, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2025 and $6.0 billion expiring in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts have been borrowed under the credit facilities. For additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. 42.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "43",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_57_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions) Year Ended December 31, 2022 2023 2024 Operating activities Net income $ 59,972 $ 73,795 $ 100,118 Adjustments: Depreciation of property and equipment 13,475 11,946 15,311 Stock-based compensation expense 19,362 22,460 22,785 Deferred income taxes (8,081) (7,763) (5,257) Loss (gain) on debt and equity securities, net 5,519 823 (2,671) Other 3,483 4,330 3,419 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net (2,317) (7,833) (5,891) Income taxes, net 584 523 (2,418) Other assets (5,046) (2,143) (1,397) Accounts payable 707 664 359 Accrued expenses and other liabilities 3,915 3,937 (1,161) Accrued revenue share (445) 482 1,059 Deferred revenue 367 525 1,043 Net cash provided by operating activities 91,495 101,746 125,299 Investing activities Purchases of property and equipment (31,485) (32,251) (52,535) Purchases of marketable securities (78,874) (77,858) (86,679) Maturities and sales of marketable securities 97,822 86,672 103,428 Purchases of non-marketable securities (2,531) (3,027) (5,034) Maturities and sales of non-marketable securities 150 947 882 Acquisitions, net of cash acquired, and purchases of intangible assets (6,969) (495) (2,931) Other investing activities 1,589 (1,051) (2,667) Net cash used in investing activities (20,298) (27,063) (45,536) Financing activities Net payments related to stock-based award activities (9,300) (9,837) (12,190) Repurchases of stock (59,296) (61,504) (62,222) Dividend payments 0 0 (7,363) Proceeds from issuance of debt, net of costs 52,872 10,790 13,589 Repayments of debt (54,068) (11,550) (12,701) Proceeds from sale of interest in consolidated entities, net 35 8 1,154 Net cash used in financing activities (69,757) (72,093) (79,733) Effect of exchange rate changes on cash and cash equivalents (506) (421) (612) Net increase (decrease) in cash and cash equivalents 934 2,169 (582) Cash and cash equivalents at beginning of period 20,945 21,879 24,048 Cash and cash equivalents at end of period $ 21,879 $ 24,048 $ 23,466 See accompanying notes. 56.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "57",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_9_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Three Months Ended March 31, 2021 2022 Operating activities Net income $ 17,930 $ 16,436 Adjustments: Depreciation and impairment of property and equipment 2,525 3,591 Amortization and impairment of intangible assets 228 191 Stock-based compensation expense 3,745 4,504 Deferred income taxes 1,100 (2,090) (Gain) loss on debt and equity securities, net (4,751) 1,437 Other (255) 140 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable 2,794 4,364 Income taxes, net 785 3,820 Other assets 7 (776) Accounts payable (982) (2,373) Accrued expenses and other liabilities (3,530) (3,216) Accrued revenue share (444) (828) Deferred revenue 137 (94) Net cash provided by operating activities 19,289 25,106 Investing activities Purchases of property and equipment (5,942) (9,786) Purchases of marketable securities (36,426) (28,462) Maturities and sales of marketable securities 39,248 29,779 Purchases of non-marketable securities (646) (776) Maturities and sales of non-marketable securities 19 12 Acquisitions, net of cash acquired, and purchases of intangible assets (1,666) (173) Other investing activities 30 355 Net cash used in investing activities (5,383) (9,051) Financing activities Net payments related to stock-based award activities (2,184) (2,916) Repurchases of stock (11,395) (13,300) Proceeds from issuance of debt, net of costs 900 16,422 Repayments of debt (937) (16,420) Proceeds from sale of interest in consolidated entities, net 10 0 Net cash used in financing activities (13,606) (16,214) Effect of exchange rate changes on cash and cash equivalents (143) 100 Net increase (decrease) in cash and cash equivalents 157 (59) Cash and cash equivalents at beginning of period 26,465 20,945 Cash and cash equivalents at end of period $ 26,622 $ 20,886 See accompanying notes. 9",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "9",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended March 31, 2021 2022 Income before provision for income taxes $ 21,283 $ 18,934 Provision for income taxes $ 3,353 $ 2,498 Effective tax rate 15.8 % 13.2 % The effective tax rate decreased 2.6% from the three months ended March 31, 2021 to the three months ended March 31, 2022. The decrease was primarily due to a benefit driven by the effects of capitalization and amortization of research and development expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign-Derived Intangible Income tax deduction. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of March 31, 2022, we had $134.0 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are our cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace and form of capital return to stockholders. The following table presents our cash flows (in millions): Three Months Ended March 31, 2021 2022 Net cash provided by operating activities $ 19,289 $ 25,106 Net cash used in investing activities $ (5,383) $ (9,051) Net cash used in financing activities $ (13,606) $ (16,214) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties and YouTube ads. Additionally, we generate cash through sales of apps and in-app purchases, digital content products, and hardware; and licensing and service fees including fees received for Google Cloud offerings and subscription-based products. Our primary uses of cash from our operating activities include payments to distribution and Google Network partners, for compensation and related costs, and for content acquisition costs. In addition, uses of cash from operating activities include hardware inventory costs, income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the three months ended March 31, 2021 to the three months ended March 31, 2022 primarily due to the net effect of an increase in cash received from revenues and cash paid for cost of revenues and operating expenses, and changes in operating assets and liabilities. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "39",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_39_chunk_1",
        "text": "activities increased from the three months ended March 31, 2021 to the three months ended March 31, 2022 primarily due to an increase of purchases of property and equipment, partially offset 39",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "39",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. by a net decrease in maturities and sales of securities. The increase in property and equipment was primarily due to the purchases of office facilities. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interest in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from the three months ended March 31, 2021 to the three months ended March 31, 2022 primarily due to an increase in repurchases of stock. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of investments in servers and network equipment for computing, storage and networking requirements for ongoing business activities, including machine learning (collectively referred to as information technology assets) and data center land and building construction; and • office facilities, ground up development projects, and related building improvements. Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service for our intended use. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi- year projects with multiple phases, where we acquire qualified land and buildings, construct buildings, and secure and install information technology assets. During the three months ended March 31, 2021 and 2022, capital expenditures were $5.9 billion and $9.8 billion, respectively. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the three months ended March 31, 2021 and 2022, depreciation and impairment expenses on property and equipment were $2.5 billion and $3.6 billion, respectively. Leases For the three months ended March 31, 2021 and 2022, we recognized total operating lease assets of $769 million and $915 million, respectively. As of March 31, 2022, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 8 years, was $15.6 billion. As of March 31, 2022, we have entered into leases that have not yet commenced with future lease payments of $5.8 billion, excluding purchase options, that are not yet recorded on our",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "40",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_40_chunk_1",
        "text": "Consolidated Balance Sheets. These leases will commence between 2022 and 2026 with non-cancelable lease terms of 1 to 25 years. For the three months ended March 31, 2021 and 2022, our operating lease expenses (including variable lease costs) were $794 million and $880 million, respectively. Finance lease costs were not material for the three months ended March 31, 2021 and 2022. Financing We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of March 31, 2022, we had no commercial paper outstanding. As of March 31, 2022, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2022 and $6.0 billion expiring in April 2026. In April 2022, we entered into a new $4.0 billion credit facility expiring in April 40",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "40",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_9_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Three Months Ended March 31, 2022 2023 Operating activities Net income $ 16,436 $ 15,051 Adjustments: Depreciation and impairment of property and equipment 3,591 3,060 Amortization and impairment of intangible assets 191 126 Stock-based compensation expense 4,504 5,284 Deferred income taxes (2,090) (1,854) Loss (gain) on debt and equity securities, net 1,437 (84) Other 140 553 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 4,364 4,454 Income taxes, net 3,820 4,069 Other assets (776) (746) Accounts payable (2,373) (1,105) Accrued expenses and other liabilities (3,216) (4,496) Accrued revenue share (828) (602) Deferred revenue (94) (201) Net cash provided by operating activities 25,106 23,509 Investing activities Purchases of property and equipment (9,786) (6,289) Purchases of marketable securities (28,462) (14,227) Maturities and sales of marketable securities 29,779 18,327 Purchases of non-marketable securities (776) (626) Maturities and sales of non-marketable securities 12 36 Acquisitions, net of cash acquired, and purchases of intangible assets (173) (42) Other investing activities 355 (125) Net cash used in investing activities (9,051) (2,946) Financing activities Net payments related to stock-based award activities (2,916) (1,989) Repurchases of stock (13,300) (14,557) Proceeds from issuance of debt, net of costs 16,422 6,927 Repayments of debt (16,420) (6,952) Proceeds from sale of interest in consolidated entities, net 0 3 Net cash used in financing activities (16,214) (16,568) Effect of exchange rate changes on cash and cash equivalents 100 50 Net increase (decrease) in cash and cash equivalents (59) 4,045 Cash and cash equivalents at beginning of period 20,945 21,879 Cash and cash equivalents at end of period $ 20,886 $ 25,924 See accompanying notes. 9",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "9",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended March 31, 2022 2023 Income before provision for income taxes $ 18,934 $ 18,205 Provision for income taxes $ 2,498 $ 3,154 Effective tax rate 13.2 % 17.3 % The effective tax rate increased from the three months ended March 31, 2022 to the three months ended March 31, 2023, primarily driven by a decrease in the stock-based compensation-related tax benefit and proportionally less pre-tax earnings generated in countries that have lower statutory tax rates. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of March 31, 2023, we had $115.1 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Three Months Ended March 31, 2022 2023 Net cash provided by operating activities $ 25,106 $ 23,509 Net cash used in investing activities $ (9,051) $ (2,946) Net cash used in financing activities $ (16,214) $ (16,568) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. Additionally, we generate cash through sales of apps and in-app purchases, and hardware; and licensing and service fees, including fees received for Google Cloud offerings and subscription-based products. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for hardware, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities decreased from the three months ended March 31, 2022 to the three months ended March 31, 2023 due to increased cash payments for costs and expenses, partially offset by an increase in cash received from revenues. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities decreased from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily due to a decrease in purchases of property and equipment and a decrease in net purchases of",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "40",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_40_chunk_1",
        "text": "and maturities and sales of marketable securities. 40",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "40",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_41_chunk_0",
        "text": "Table of Contents Alphabet Inc. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interest in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily due to an increase in repurchases of stock partially offset by a decrease in net payments related to stock-based award activities. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire qualified land and buildings, construct buildings, and secure and install information technology assets. During the three months ended March 31, 2022 and 2023, we spent $9.8 billion and $6.3 billion on capital expenditures, respectively. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the three months ended March 31, 2022 and 2023, our depreciation and impairment expenses on property and equipment were $3.6 billion and $3.1 billion, respectively. Leases For the three months ended March 31, 2022 and 2023, we recognized total operating lease assets of $915 million and $1.1 billion, respectively. As of March 31, 2023, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 8.4 years, was $18.0 billion. As of March 31, 2023, we have entered into leases that have not yet commenced with future lease payments of $3.0 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2023 and 2026 with non-cancelable",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "41",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_41_chunk_1",
        "text": "lease terms of 1 to 25 years. As of March 31, 2023 our actions to optimize our office space did not affect our operating lease obligations. For the three months ended March 31, 2022 and 2023, our operating lease expenses (including variable lease costs) were $880 million and $1.1 billion, respectively. Finance lease costs were not material for the three months ended March 31, 2022 and 2023. Financing We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of March 31, 2023, we had no commercial paper outstanding. As of March 31, 2023, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2023 and $6.0 billion expiring in April 2026. In April 2023, we entered into a new $4.0 billion revolving credit facility expiring in April 2024 and we also terminated the existing $6.0 billion revolving credit facility expiring in April 2026 and entered into a new $6.0 billion revolving credit facility expiring in April 2028. The interest rates for all credit facilities are 41",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "41",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_9_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Three Months Ended March 31, 2023 2024 Operating activities Net income $ 15,051 $ 23,662 Adjustments: Depreciation of property and equipment 2,635 3,413 Stock-based compensation expense 5,284 5,264 Deferred income taxes (1,854) 419 Loss (gain) on debt and equity securities, net (84) (1,781) Other 1,104 334 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 4,454 3,167 Income taxes, net 4,069 3,011 Other assets (746) (1,000) Accounts payable (1,105) (2,124) Accrued expenses and other liabilities (4,496) (5,054) Accrued revenue share (602) (322) Deferred revenue (201) (141) Net cash provided by operating activities 23,509 28,848 Investing activities Purchases of property and equipment (6,289) (12,012) Purchases of marketable securities (14,227) (20,684) Maturities and sales of marketable securities 18,327 24,985 Purchases of non-marketable securities (626) (1,206) Maturities and sales of non-marketable securities 36 313 Acquisitions, net of cash acquired, and purchases of intangible assets (42) (61) Other investing activities (125) 101 Net cash used in investing activities (2,946) (8,564) Financing activities Net payments related to stock-based award activities (1,989) (2,929) Repurchases of stock (14,557) (15,696) Proceeds from issuance of debt, net of costs 6,927 1,982 Repayments of debt (6,952) (3,079) Proceeds from sale of interest in consolidated entities, net 3 8 Net cash used in financing activities (16,568) (19,714) Effect of exchange rate changes on cash and cash equivalents 50 (125) Net increase (decrease) in cash and cash equivalents 4,045 445 Cash and cash equivalents at beginning of period 21,879 24,048 Cash and cash equivalents at end of period $ 25,924 $ 24,493 See accompanying notes. 9",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "9",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_39_chunk_0",
        "text": "The following table presents our cash flows (in millions): Three Months Ended March 31, 2023 2024 Net cash provided by operating activities $ 23,509 $ 28,848 Net cash used in investing activities $ (2,946) $ (8,564) Net cash used in financing activities $ (16,568) $ (19,714) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions and the sale of apps and in-app purchases and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, collaboration tools, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the three months ended March 31, 2023 to the three months ended March 31, 2024 due to the increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from the three months ended March 31, 2023 to the three months ended March 31, 2024 primarily due to an increase in purchases of property and equipment. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from the three months ended March 31, 2023 to the three months ended March 31, 2024 due to increases in net repayments related to debt, net payments related to stock- based award activities, and repurchases of stock. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "39",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_39_chunk_1",
        "text": "in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). 39",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "39",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_9_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Three Months Ended March 31, 2024 2025 Operating activities Net income $ 23,662 $ 34,540 Adjustments: Depreciation of property and equipment 3,413 4,487 Stock-based compensation expense 5,264 5,516 Deferred income taxes 419 (1,152) Loss (gain) on debt and equity securities, net (1,781) (9,960) Other 334 481 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 3,167 1,638 Income taxes, net 3,011 7,197 Other assets (1,000) (1,288) Accounts payable (2,124) (880) Accrued expenses and other liabilities (5,054) (5,045) Accrued revenue share (322) 116 Deferred revenue (141) 500 Net cash provided by operating activities 28,848 36,150 Investing activities Purchases of property and equipment (12,012) (17,197) Purchases of marketable securities (20,684) (18,453) Maturities and sales of marketable securities 24,985 20,345 Purchases of non-marketable securities (1,206) (958) Maturities and sales of non-marketable securities 313 259 Acquisitions, net of cash acquired, and purchases of intangible assets (61) (340) Other investing activities 101 150 Net cash used in investing activities (8,564) (16,194) Financing activities Net payments related to stock-based award activities (2,929) (3,110) Repurchases of stock (15,696) (15,068) Dividend payments 0 (2,434) Proceeds from issuance of debt, net of costs 1,982 4,532 Repayments of debt (3,079) (4,521) Proceeds from sale of interest in consolidated entities, net 8 400 Net cash used in financing activities (19,714) (20,201) Effect of exchange rate changes on cash and cash equivalents (125) 43 Net increase (decrease) in cash and cash equivalents 445 (202) Cash and cash equivalents at beginning of period 24,048 23,466 Cash and cash equivalents at end of period $ 24,493 $ 23,264 See accompanying notes. 9",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "9",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_42_chunk_0",
        "text": "Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended March 31, 2024 2025 Income before provision for income taxes $ 28,315 $ 41,789 Provision for income taxes $ 4,653 $ 7,249 Effective tax rate 16.4 % 17.3 % The effective tax rate increased from the three months ended March 31, 2024 to the three months ended March 31, 2025. This increase was primarily due to lower effective tax rate impacts in the U.S. federal Foreign Derived Intangible Income tax deduction, R&D credits, and stock-based compensation-related tax benefits. The OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the period ending March 31, 2025. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of March 31, 2025, we had $95.3 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents cash flows (in millions): Three Months Ended March 31, 2024 2025 Net cash provided by operating activities $ 28,848 $ 36,150 Net cash used in investing activities $ (8,564) $ (16,194) Net cash used in financing activities $ (19,714) $ (20,201) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the three months ended March 31, 2024 to the three months ended March 31, 2025 due to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses. 42",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "42",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_43_chunk_0",
        "text": "Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from the three months ended March 31, 2024 to the three months ended March 31, 2025 primarily due to an increase in purchases of property and equipment and a decrease in maturities and sales of marketable securities, partially offset by a decrease in purchases of marketable securities. The increase in purchases of property and equipment is primarily driven by investments in technical infrastructure. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt. Net cash used in financing activities increased from the three months ended March 31, 2024 to the three months ended March 31, 2025 due to dividend payments, partially offset by an increase in proceeds from issuance of debt, net of repayments. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Assets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment. During the three months ended March 31, 2024 and 2025, we spent $12.0 billion and $17.2 billion on capital expenditures, respectively. We expect to increase, relative to 2024, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "43",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_43_chunk_1",
        "text": "and services. Depreciation of our property and equipment commences when such assets are ready for our intended use. For the three months ended March 31, 2024 and 2025, depreciation on property and equipment was $3.4 billion and $4.5 billion, respectively. Leases As of March 31, 2025, the amount of total future lease payments under operating and finance leases was $17.0 billion and $2.5 billion, respectively. As of March 31, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $17.3 billion. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years. 43",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "43",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Six Months Ended June 30, 2021 2022 Operating activities Net income $ 36,455 $ 32,438 Adjustments: Depreciation and impairment of property and equipment 5,255 7,289 Amortization and impairment of intangible assets 443 392 Stock-based compensation expense 7,548 9,286 Deferred income taxes 1,479 (4,237) (Gain) loss on debt and equity securities, net (7,634) 2,478 Other (263) 202 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable (867) 2,395 Income taxes, net (297) (253) Other assets (192) (1,621) Accounts payable (1,112) (1,172) Accrued expenses and other liabilities 201 (1,719) Accrued revenue share 29 (942) Deferred revenue 134 (8) Net cash provided by operating activities 41,179 44,528 Investing activities Purchases of property and equipment (11,438) (16,614) Purchases of marketable securities (60,609) (50,199) Maturities and sales of marketable securities 60,667 55,374 Purchases of non-marketable securities (1,412) (1,264) Maturities and sales of non-marketable securities 256 125 Acquisitions, net of cash acquired, and purchases of intangible assets (1,974) (1,236) Other investing activities 53 576 Net cash used in investing activities (14,457) (13,238) Financing activities Net payments related to stock-based award activities (4,637) (5,180) Repurchases of stock (24,191) (28,497) Proceeds from issuance of debt, net of costs 7,599 29,228 Repayments of debt (8,678) (29,582) Proceeds from sale of interest in consolidated entities, net 310 0 Net cash used in financing activities (29,597) (34,031) Effect of exchange rate changes on cash and cash equivalents 40 (268) Net decrease in cash and cash equivalents (2,835) (3,009) Cash and cash equivalents at beginning of period 26,465 20,945 Cash and cash equivalents at end of period $ 23,630 $ 17,936 See accompanying notes. 10",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "10",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_43_chunk_0",
        "text": "Table of Contents Alphabet Inc. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Income before provision for income taxes $ 21,985 $ 19,014 $ 43,268 $ 37,948 Provision for income taxes $ 3,460 $ 3,012 $ 6,813 $ 5,510 Effective tax rate 15.7 % 15.8 % 15.7 % 14.5 % The effective tax rate increased 0.1% from the three months ended June 30, 2021 to the three months ended June 30, 2022. The effective tax rate was affected by offsetting factors including decreases in the stock-based compensation-related tax benefit, and in pre-tax earnings (including in countries that have lower statutory rates), offset primarily by the effects of capitalization and amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign-Derived Intangible Income tax deduction. The effective tax rate decreased 1.2% from the six months ended June 30, 2021 to the six months ended June 30, 2022. The decrease was primarily driven by the effects of capitalization and amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign- Derived Intangible Income tax deduction, offset primarily by a decrease in pre-tax earnings, including in countries that have lower statutory rates. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of June 30, 2022, we had $125.0 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are our cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace and form of capital return to stockholders. The following table presents our cash flows (in millions): Six Months Ended June 30, 2021 2022 Net cash provided by operating activities $ 41,179 $ 44,528 Net cash used in investing activities $ (14,457) $ (13,238) Net cash used in financing activities $ (29,597) $ (34,031) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties and YouTube ads. Additionally, we generate cash through sales of apps and in-app purchases, digital content products, and hardware; and licensing and service fees including fees received for Google Cloud offerings and subscription-based products. Our primary uses of cash from our operating activities include payments to distribution and Google Network partners, for compensation and related costs, and for content acquisition costs. In addition, uses of cash from",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "43",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_43_chunk_1",
        "text": "operating activities include hardware inventory costs, income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the six months ended June 30, 2021 to the six months ended June 30, 2022 primarily due to the net effect of increases in cash received from revenues, increases in cash paid for cost of revenues and operating expenses, offset by an increase in tax payments driven by the 43",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "43",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Six Months Ended June 30, 2022 2023 Operating activities Net income $ 32,438 $ 33,419 Adjustments: Depreciation and impairment of property and equipment 7,289 6,339 Amortization and impairment of intangible assets 392 244 Stock-based compensation expense 9,286 11,058 Deferred income taxes (4,237) (4,269) Loss (gain) on debt and equity securities, net 2,478 425 Other 202 650 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 2,395 1,506 Income taxes, net (253) 8,520 Other assets (1,621) (1,259) Accounts payable (1,172) 14 Accrued expenses and other liabilities (1,719) (4,037) Accrued revenue share (942) (418) Deferred revenue (8) (17) Net cash provided by operating activities 44,528 52,175 Investing activities Purchases of property and equipment (16,614) (13,177) Purchases of marketable securities (50,199) (35,589) Maturities and sales of marketable securities 55,374 37,049 Purchases of non-marketable securities (1,264) (1,513) Maturities and sales of non-marketable securities 125 181 Acquisitions, net of cash acquired, and purchases of intangible assets (1,236) (340) Other investing activities 576 (357) Net cash used in investing activities (13,238) (13,746) Financing activities Net payments related to stock-based award activities (5,180) (4,725) Repurchases of stock (28,497) (29,526) Proceeds from issuance of debt, net of costs 29,228 8,050 Repayments of debt (29,582) (8,207) Proceeds from sale of interest in consolidated entities, net 0 5 Net cash used in financing activities (34,031) (34,403) Effect of exchange rate changes on cash and cash equivalents (268) 24 Net increase (decrease) in cash and cash equivalents (3,009) 4,050 Cash and cash equivalents at beginning of period 20,945 21,879 Cash and cash equivalents at end of period $ 17,936 $ 25,929 See accompanying notes. 10",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "10",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_45_chunk_0",
        "text": "Table of Contents Alphabet Inc. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Income before provision for income taxes $ 19,014 $ 21,903 $ 37,948 $ 40,108 Provision for income taxes $ 3,012 $ 3,535 $ 5,510 $ 6,689 Effective tax rate 15.8 % 16.1 % 14.5 % 16.7 % The effective tax rate increased from the three months ended June 30, 2022 to the three months ended June 30, 2023, primarily driven by changes in certain tax return positions, partially offset by a decrease in the tax rate due to reduced 2023 tax losses of certain subsidiaries for which there is no tax benefit. The effective tax rate increased from the six months ended June 30, 2022 to the six months ended June 30, 2023, primarily driven by a decrease in the stock-based compensation-related tax benefit and changes in certain tax return positions. On July 21, 2023 the IRS announced in a notice that taxpayers can temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits. This relief applies to foreign taxes paid or accrued in our fiscal years 2022 and 2023. We are currently evaluating the effect on our consolidated financial statements and expect to recognize any changes in our financial results for the period ending September 30, 2023. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of June 30, 2023, we had $118.3 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Six Months Ended June 30, 2022 2023 Net cash provided by operating activities $ 44,528 $ 52,175 Net cash used in investing activities $ (13,238) $ (13,746) Net cash used in financing activities $ (34,031) $ (34,403) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. Additionally, we generate cash through sales of apps and in-app purchases, and hardware; and licensing and service fees, including fees received for Google Cloud offerings and subscription-based products. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for hardware,",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "45",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_45_chunk_1",
        "text": "to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the six months ended June 30, 2022 to the six months ended June 30, 2023 due to the 2023 IRS payment deferral relief made available to taxpayers 45",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "45",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. headquartered in designated counties in California, partially offset by increased cash payments for costs and expenses. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from the six months ended June 30, 2022 to the six months ended June 30, 2023 as a result of an increase in net purchases of and maturities and sales of marketable securities, partially offset by a decrease in purchases of property and equipment. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interest in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from the six months ended June 30, 2022 to the six months ended June 30, 2023 primarily due to an increase in repurchases of stock partially offset by a decrease in net payments related to stock-based award activities. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire qualified land and buildings, construct buildings, and secure and install information technology assets. During the six months ended June 30, 2022 and 2023, we spent $16.6 billion and $13.2 billion on capital expenditures, respectively. We expect to continue to invest in our technical infrastructure, including servers, network equipment, and data centers, over the remainder of 2023 and into 2024 to support the growth of our business and our",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "46",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_46_chunk_1",
        "text": "long-term initiatives, in particular in support of AI. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the six months ended June 30, 2022 and 2023, our depreciation and impairment expenses on property and equipment were $7.3 billion and $6.3 billion, respectively. Leases For the six months ended June 30, 2022 and 2023, we recognized total operating lease assets of $2.2 billion and $1.7 billion, respectively. As of June 30, 2023, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 8.2 years, was $18.2 billion. As of June 30, 2023, we have entered into leases that have not yet commenced with future lease payments of $2.9 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2023 and 2027 with non- cancelable lease terms of 1 to 34 years. As of June 30, 2023 our actions to optimize our office space did not affect our operating lease obligations. 46",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "46",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Six Months Ended June 30, 2023 2024 Operating activities Net income $ 33,419 $ 47,281 Adjustments: Depreciation of property and equipment 5,459 7,121 Stock-based compensation expense 11,058 11,129 Deferred income taxes (4,269) (2,738) Loss (gain) on debt and equity securities, net 425 (757) Other 1,774 1,185 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 1,506 110 Income taxes, net 8,520 (889) Other assets (1,259) (1,532) Accounts payable 14 (563) Accrued expenses and other liabilities (4,037) (5,176) Accrued revenue share (418) 97 Deferred revenue (17) 220 Net cash provided by operating activities 52,175 55,488 Investing activities Purchases of property and equipment (13,177) (25,198) Purchases of marketable securities (35,589) (43,011) Maturities and sales of marketable securities 37,049 58,577 Purchases of non-marketable securities (1,513) (2,199) Maturities and sales of non-marketable securities 181 605 Acquisitions, net of cash acquired, and purchases of intangible assets (340) (87) Other investing activities (357) (32) Net cash used in investing activities (13,746) (11,345) Financing activities Net payments related to stock-based award activities (4,725) (6,138) Repurchases of stock (29,526) (31,380) Dividend payments 0 (2,466) Proceeds from issuance of debt, net of costs 8,050 4,875 Repayments of debt (8,207) (5,502) Proceeds from sale of interest in consolidated entities, net 5 8 Net cash used in financing activities (34,403) (40,603) Effect of exchange rate changes on cash and cash equivalents 24 (363) Net increase (decrease) in cash and cash equivalents 4,050 3,177 Cash and cash equivalents at beginning of period 21,879 24,048 Cash and cash equivalents at end of period $ 25,929 $ 27,225 See accompanying notes. 10",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "10",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_44_chunk_0",
        "text": "government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Six Months Ended June 30, 2023 2024 Net cash provided by operating activities $ 52,175 $ 55,488 Net cash used in investing activities $ (13,746) $ (11,345) Net cash used in financing activities $ (34,403) $ (40,603) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, collaboration tools, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the six months ended June 30, 2023 to the six months ended June 30, 2024 due to an increase in cash received from customers, partially offset by an increase in tax payments. The increase in tax payments in comparison to the prior year comparable period was primarily due to the 2023 IRS payment deferral relief made available to taxpayers headquartered in designated counties in California. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities decreased from the six months ended June 30, 2023 to the six months ended June 30, 2024 primarily due to an increase in maturities and sales of marketable securities, partially offset by increases in purchases of property and equipment and purchases of marketable securities. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from the six months ended June 30, 2023 to the six months ended June 30, 2024 due to dividend payments, increases in repurchases of stock, and net payments related to stock-based award activities.",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "44",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_44_chunk_1",
        "text": "Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future. 44",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "44",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_11_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Six Months Ended June 30, 2024 2025 Operating activities Net income $ 47,281 $ 62,736 Adjustments: Depreciation of property and equipment 7,121 9,485 Stock-based compensation expense 11,129 11,514 Deferred income taxes (2,738) (1,596) Loss (gain) on debt and equity securities, net (757) (11,411) Other 1,185 1,041 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 110 (1,201) Income taxes, net (889) (2,434) Other assets (1,532) (2,767) Accounts payable (563) (327) Accrued expenses and other liabilities (5,176) (1,560) Accrued revenue share 97 (219) Deferred revenue 220 636 Net cash provided by operating activities 55,488 63,897 Investing activities Purchases of property and equipment (25,198) (39,643) Purchases of marketable securities (43,011) (39,870) Maturities and sales of marketable securities 58,577 40,930 Purchases of non-marketable securities (2,199) (2,312) Maturities and sales of non-marketable securities 605 873 Acquisitions, net of cash acquired, and purchases of intangible assets (87) (353) Other investing activities (32) (363) Net cash used in investing activities (11,345) (40,738) Financing activities Net payments related to stock-based award activities (6,138) (5,731) Repurchases of stock (31,380) (28,706) Dividend payments (2,466) (4,977) Proceeds from issuance of debt, net of costs 4,875 31,378 Repayments of debt (5,502) (18,397) Proceeds from sale of interest in consolidated entities, net 8 400 Net cash used in financing activities (40,603) (26,033) Effect of exchange rate changes on cash and cash equivalents (363) 444 Net increase (decrease) in cash and cash equivalents 3,177 (2,430) Cash and cash equivalents at beginning of period 24,048 23,466 Cash and cash equivalents at end of period $ 27,225 $ 21,036 See accompanying notes. 11",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "11",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_48_chunk_0",
        "text": "including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the period ending June 30, 2025. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of June 30, 2025, we had $95.1 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents cash flows (in millions): Six Months Ended June 30, 2024 2025 Net cash provided by operating activities $ 55,488 $ 63,897 Net cash used in investing activities $ (11,345) $ (40,738) Net cash used in financing activities $ (40,603) $ (26,033) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the six months ended June 30, 2024 to the six months ended June 30, 2025 due to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses and an increase in income tax payments. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from the six months ended June 30, 2024 to the six months ended June 30, 2025 primarily due to a decrease in maturities and sales of marketable securities and an increase in purchases of property and equipment primarily driven by investments in technical infrastructure. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "48",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_48_chunk_1",
        "text": "the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt. Net cash used in financing activities decreased from the six months ended June 30, 2024 to the six months ended June 30, 2025 due to an increase in proceeds from issuance of debt, net of repayments. 48",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "48",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_49_chunk_0",
        "text": "Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Assets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment. During the six months ended June 30, 2024 and 2025, we spent $25.2 billion and $39.6 billion on capital expenditures, respectively. We expect to increase, relative to 2024, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when such assets are ready for our intended use. For the six months ended June 30, 2024 and 2025, depreciation on property and equipment was $7.1 billion and $9.5 billion, respectively. Leases As of June 30, 2025, the amount of total future lease payments under operating and finance leases was $17.4 billion and $2.6 billion, respectively. As of June 30, 2025, we have entered into leases primarily related to data centers that have not yet commenced with future lease payments of $23.9 billion. These leases will commence between 2025 and 2031 with non-cancelable lease terms between one and 25 years. For additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Financing We have a short-term debt financing program of up to $25.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of June 30, 2025, we had $3.0 billion of short-term commercial paper outstanding. In May 2025, we issued $5.0 billion of U.S. dollar-denominated fixed-rate senior unsecured notes in four tranches: $750 million of 4.00% notes due 2030, $1.25 billion of 4.50% notes due 2035,",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "49",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_49_chunk_1",
        "text": "$1.5 billion of 5.25% notes due 2055, and $1.5 billion of 5.30% notes due 2065. Additionally in May 2025, we issued €6.75 billion of euro- denominated fixed-rate senior unsecured notes in five tranches: €1.5 billion of 2.50% notes due 2029, €1.5 billion of 3.00% notes due 2033, €1.25 billion of 3.38% notes due 2037, €1.25 billion of 3.88% notes due 2045, and €1.25 billion of 4.00% notes due 2054. The net proceeds from all notes issued in May 2025 are used for general corporate purposes. As of June 30, 2025, we had senior unsecured notes outstanding with a total carrying value of $24.6 billion. As of June 30, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2026 and $6.0 billion expiring in April 2030. The interest rates for all credit facilities are determined based on a formula using certain market rates. No amounts have been borrowed under the credit facilities. For additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. 49",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "49",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Nine Months Ended September 30, 2021 2022 Operating activities Net income $ 55,391 $ 46,348 Adjustments: Depreciation and impairment of property and equipment 8,340 11,222 Amortization and impairment of intangible assets 662 505 Stock-based compensation expense 11,422 14,262 Deferred income taxes 192 (6,157) (Gain) loss on debt and equity securities, net (9,792) 3,856 Other (199) 369 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable (3,276) 2,298 Income taxes, net 2,744 (862) Other assets (1,447) (4,268) Accounts payable (874) 735 Accrued expenses and other liabilities 2,763 491 Accrued revenue share 386 (1,022) Deferred revenue 406 104 Net cash provided by operating activities 66,718 67,881 Investing activities Purchases of property and equipment (18,257) (23,890) Purchases of marketable securities (95,106) (67,253) Maturities and sales of marketable securities 92,126 84,087 Purchases of non-marketable securities (2,068) (1,628) Maturities and sales of non-marketable securities 590 131 Acquisitions, net of cash acquired, and purchases of intangible assets (2,233) (6,885) Other investing activities 441 1,367 Net cash used in investing activities (24,507) (14,071) Financing activities Net payments related to stock-based award activities (7,239) (7,221) Repurchases of stock (36,801) (43,889) Proceeds from issuance of debt, net of costs 13,949 44,322 Repayments of debt (15,070) (45,350) Proceeds from sale of interest in consolidated entities, net 310 10 Net cash used in financing activities (44,851) (52,128) Effect of exchange rate changes on cash and cash equivalents (106) (643) Net increase (decrease) in cash and cash equivalents (2,746) 1,039 Cash and cash equivalents at beginning of period 26,465 20,945 Cash and cash equivalents at end of period $ 23,719 $ 21,984 See accompanying notes. 10",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "10",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_45_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of September 30, 2022, we had $116.3 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are our cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace and form of capital return to stockholders. The following table presents our cash flows (in millions): Nine Months Ended September 30, 2021 2022 Net cash provided by operating activities $ 66,718 $ 67,881 Net cash used in investing activities $ (24,507) $ (14,071) Net cash used in financing activities $ (44,851) $ (52,128) Cash Provided by Operating Activities Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties and YouTube ads. Additionally, we generate cash through sales of apps and in-app purchases, digital content products, and hardware; and licensing and service fees including fees received for Google Cloud offerings and subscription-based products. Our primary uses of cash from our operating activities include payments to distribution and Google Network partners, for compensation and related costs, and for content acquisition costs. In addition, uses of cash from operating activities include hardware costs, income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily due to increases in cash received from revenues, partially offset by increases in cash paid for cost of revenues and operating expenses, and an increase in tax payments driven by the effects of capitalization and amortization of R&D expenses beginning in 2022 as required by the 2017 Tax Cuts and Jobs Act, and other working capital. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities decreased from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily due to a net decrease in cash used for purchases, sales and maturities of marketable securities, partially offset by an increase of purchases of property and equipment. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interest in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "45",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_45_chunk_1",
        "text": "repayments of debt. Net cash used in financing activities increased from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily due to an increase in repurchases of stock. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. 45",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "45",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Nine Months Ended September 30, 2022 2023 Operating activities Net income $ 46,348 $ 53,108 Adjustments: Depreciation and impairment of property and equipment 11,222 10,010 Amortization and impairment of intangible assets 505 373 Stock-based compensation expense 14,262 16,801 Deferred income taxes (6,157) (6,093) Loss (gain) on debt and equity securities, net 3,856 1,294 Other 369 912 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 2,298 (1,315) Income taxes, net (862) 10,392 Other assets (4,268) (2,883) Accounts payable 735 237 Accrued expenses and other liabilities 491 (380) Accrued revenue share (1,022) (315) Deferred revenue 104 690 Net cash provided by operating activities 67,881 82,831 Investing activities Purchases of property and equipment (23,890) (21,232) Purchases of marketable securities (67,253) (49,422) Maturities and sales of marketable securities 84,087 52,642 Purchases of non-marketable securities (1,628) (2,176) Maturities and sales of non-marketable securities 131 743 Acquisitions, net of cash acquired, and purchases of intangible assets (6,885) (466) Other investing activities 1,367 (985) Net cash used in investing activities (14,071) (20,896) Financing activities Net payments related to stock-based award activities (7,221) (7,157) Repurchases of stock (43,889) (45,313) Proceeds from issuance of debt, net of costs 44,322 9,298 Repayments of debt (45,350) (9,621) Proceeds from sale of interest in consolidated entities, net 10 8 Net cash used in financing activities (52,128) (52,785) Effect of exchange rate changes on cash and cash equivalents (643) (327) Net increase in cash and cash equivalents 1,039 8,823 Cash and cash equivalents at beginning of period 20,945 21,879 Cash and cash equivalents at end of period $ 21,984 $ 30,702 See accompanying notes. 10",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "10",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_47_chunk_0",
        "text": "Table of Contents Alphabet Inc. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for hardware, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 due to the increase in cash received from customers and the 2023 IRS payment deferral relief made available to taxpayers headquartered in designated counties in California, partially offset by increased cash payments for costs and expenses. On October 16, 2023, we made an estimated income tax payment to the IRS of $10.5 billion that will be reflected in our fourth quarter operating cash flow. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions. Net cash used in investing activities increased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 as a result of an increase in net purchases of and maturities and sales of marketable securities, partially offset by a decrease in payments for acquisitions and intangible assets. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interest in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt. Net cash used in financing activities increased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 primarily due to an increase in repurchases of stock partially offset by a decrease in net payments related to debt. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "47",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_47_chunk_1",
        "text": "technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire qualified land and buildings, construct buildings, and secure and install information technology assets. During the nine months ended September 30, 2022 and 2023, we spent $23.9 billion and $21.2 billion on capital expenditures, respectively. We expect to continue to invest in our technical infrastructure, including servers, network equipment, and data centers, over the remainder of 2023 and into 2024 to support the growth of our business and our long-term initiatives, in particular in support of AI. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the nine months ended September 30, 2022 and 2023, our depreciation and impairment expenses on property and equipment were $11.2 billion and $10.0 billion, respectively. Leases 47",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "47",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Nine Months Ended September 30, 2023 2024 Operating activities Net income $ 53,108 $ 73,582 Adjustments: Depreciation of property and equipment 8,630 11,106 Stock-based compensation expense 16,801 16,975 Deferred income taxes (6,093) (3,809) Loss (gain) on debt and equity securities, net 1,294 (2,738) Other 2,665 2,592 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net (1,315) (1,321) Income taxes, net 10,392 (2,797) Other assets (2,883) (2,334) Accounts payable 237 (42) Accrued expenses and other liabilities (380) (6,366) Accrued revenue share (315) 478 Deferred revenue 690 860 Net cash provided by operating activities 82,831 86,186 Investing activities Purchases of property and equipment (21,232) (38,259) Purchases of marketable securities (49,422) (65,034) Maturities and sales of marketable securities 52,642 81,779 Purchases of non-marketable securities (2,176) (3,234) Maturities and sales of non-marketable securities 743 732 Acquisitions, net of cash acquired, and purchases of intangible assets (466) (2,840) Other investing activities (985) (2,500) Net cash used in investing activities (20,896) (29,356) Financing activities Net payments related to stock-based award activities (7,157) (9,141) Repurchases of stock (45,313) (46,671) Dividend payments 0 (4,921) Proceeds from issuance of debt, net of costs 9,298 8,694 Repayments of debt (9,621) (8,951) Proceeds from sale of interest in consolidated entities, net 8 293 Net cash used in financing activities (52,785) (60,697) Effect of exchange rate changes on cash and cash equivalents (327) (222) Net increase (decrease) in cash and cash equivalents 8,823 (4,089) Cash and cash equivalents at beginning of period 21,879 24,048 Cash and cash equivalents at end of period $ 30,702 $ 19,959 See accompanying notes. 10",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "10",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_44_chunk_0",
        "text": "Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Income before provision for income taxes $ 21,197 $ 31,706 $ 61,305 $ 87,572 Provision for income taxes $ 1,508 $ 5,405 $ 8,197 $ 13,990 Effective tax rate 7.1 % 17.0 % 13.4 % 16.0 % The effective tax rate increased from the three months ended September 30, 2023 to the three months ended September 30, 2024. This increase was primarily due to a cumulative one-time adjustment recorded for tax rule changes issued by the Internal Revenue Service (IRS) in the third quarter of 2023. Additionally, a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction in 2024 contributed to the higher effective tax rate. The effective tax rate increased from the nine months ended September 30, 2023 to the nine months ended September 30, 2024. This increase was primarily due to a one-time adjustment for tax rule changes issued by the IRS in the third quarter of 2023. Additionally, a decrease in the 2024 U.S. federal Foreign Derived Intangible Income tax deduction contributed to an increase in the effective tax rate. These factors were partially offset by an increase in stock-based compensation-related tax benefits in 2024. The OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however we do not expect a material change to our income tax provision for the 2024 fiscal year. As additional jurisdictions enact such legislation, transitional rules lapse, and other provisions of the minimum tax legislation become effective, we expect our effective tax rate and cash tax payments could increase in future years. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of September 30, 2024, we had $93.2 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Nine Months Ended September 30, 2023 2024 Net cash provided by operating activities $ 82,831 $ 86,186 Net cash used in investing activities $ (20,896) $ (29,356) Net cash used in financing activities $ (52,785) $ (60,697) Cash Provided by Operating Activities Our largest source of",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "44",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_44_chunk_1",
        "text": "cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, collaboration tools, and other cloud services. Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities 44",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "44",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_45_chunk_0",
        "text": "include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures. Net cash provided by operating activities increased from the nine months ended September 30, 2023 to the nine months ended September 30, 2024 due to an increase in cash received from customers, partially offset by an increase in tax payments and a cash payment for the 2017 EC shopping fine. The increase in tax payments in comparison to the prior year comparable period was primarily due to the 2023 IRS payment deferral relief made available to taxpayers headquartered in designated counties in California. Cash Used in Investing Activities Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions and purchases of intangible assets. Net cash used in investing activities increased from the nine months ended September 30, 2023 to the nine months ended September 30, 2024 primarily due to an increase in purchases of property and equipment and purchases of marketable securities, partially offset by increases in maturities and sales of marketable securities. Cash Used in Financing Activities Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt. Net cash used in financing activities increased from the nine months ended September 30, 2023 to the nine months ended September 30, 2024 due to dividend payments and net payments related to stock-based award activities. Liquidity and Material Cash Requirements We expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future. Capital Expenditures and Leases We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products. Capital Expenditures Our capital investments in property and equipment consist primarily of the following major categories: • technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and • office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\"). Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "45",
            "page_section": "cash_flow"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_45_chunk_1",
        "text": "generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install information technology assets. During the nine months ended September 30, 2023 and 2024, we spent $21.2 billion and $38.3 billion on capital expenditures, respectively. We expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the nine months ended September 30, 2023 and 2024, our depreciation on property and equipment was $8.6 billion and $11.1 billion, respectively. Leases 45",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "45",
            "page_section": "cash_flow"
        }
    }
]