[
    {
        "id": "goog-10-k-2022.pdf_page_25_chunk_0",
        "text": "Table of Contents Alphabet Inc. Stock Performance Graphs The graph below matches Alphabet Inc. Class A's cumulative 5-year total stockholder return on common stock with the cumulative total returns of the S&P 500 index, the NASDAQ Composite index, and the RDG Internet Composite index. The graph tracks the performance of a $100 investment in our common stock and in each index (with the reinvestment of all dividends) from December 31, 2017 to December 31, 2022. The returns shown are based on historical results and are not intended to suggest future performance. COMPARISON OF CUMULATIVE 5-YEAR TOTAL RETURN* ALPHABET INC. CLASS A COMMON STOCK Among Alphabet Inc., the S&P 500 Index, the NASDAQ Composite Index, and the RDG Internet Composite Index $400 $350 $300 $250 $200 $150 $100 $50 $0 7 8 8 8 8 9 9 9 9 0 0 0 0 1 1 1 1 2 2 2 2 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 2 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 1 1 1 1 1 1 Alphabet Inc. Class A S&P 500 NASDAQ Composite RDG Internet Composite *$100 invested on December 31, 2017 in stock or index, including reinvestment of dividends. © Copyright 2023 S&P, a division of The McGraw-Hill Companies Inc. All rights reserved. 24",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "25",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_31_chunk_0",
        "text": "Table of Contents Alphabet Inc. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net Other income (expense), net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional details, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K as well as Item 7A, “Quantitative and Qualitative Disclosures About Market Risk”. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional details, including a reconciliation of the U.S. federal statutory rate to our effective tax rate, see Note 14 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Executive Overview The following table summarizes our consolidated financial results (in millions, except for per share information and percentages): Year Ended December 31, 2021 2022 $ Change % Change Consolidated revenues $ 257,637 $ 282,836 $ 25,199 10 % Change in consolidated constant currency revenues(1) 14 % Cost of revenues $ 110,939 $ 126,203 $ 15,264 14 % Operating expenses $ 67,984 $ 81,791 $ 13,807 20 % Operating income $ 78,714 $ 74,842 $ (3,872) (5) % Operating margin 31 % 26 % (5) % Other income (expense), net $ 12,020 $ (3,514) $ (15,534) (129) % Net income $ 76,033 $ 59,972 $ (16,061) (21) % Diluted EPS $ 5.61 $ 4.56 $ (1.05) (19) % (1) See \"Use of Non-GAAP Constant Currency Measures\" below for details relating to our use of constant currency information. • Revenues were $282.8 billion, an increase of 10% year over year, primarily driven by an increase in Google Services revenues of $16.0 billion, or 7%, and an increase in Google Cloud revenues of $7.1 billion, or 37%. • Total constant currency revenues, which exclude the effect of hedging, increased 14% year over year. 30",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "31",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_63_chunk_0",
        "text": "Table of Contents Alphabet Inc. Debt Securities The following table summarizes the estimated fair value of investments in available-for-sale marketable debt securities by effective contractual maturity dates (in millions): As of December 31, 2022 Due in 1 year or less $ 8,170 Due in 1 year through 5 years 51,698 Due in 5 years through 10 years 16,083 Due after 10 years 11,580 Total $ 87,531 The following tables present fair values and gross unrealized losses recorded to AOCI, aggregated by investment category and the length of time that individual securities have been in a continuous loss position (in millions): As of December 31, 2021 Less than 12 Months 12 Months or Greater Total Unrealized Unrealized Unrealized Fair Value Loss Fair Value Loss Fair Value Loss Government bonds $ 32,843 $ (236) $ 71 $ (2) $ 32,914 $ (238) Corporate debt securities 22,737 (152) 303 (5) 23,040 (157) Mortgage-backed and asset-backed securities 11,502 (106) 248 (6) 11,750 (112) Total $ 67,082 $ (494) $ 622 $ (13) $ 67,704 $ (507) As of December 31, 2022 Less than 12 Months 12 Months or Greater Total Unrealized Unrealized Unrealized Fair Value Loss Fair Value Loss Fair Value Loss Government bonds $ 21,039 $ (1,004) $ 13,438 $ (1,041) $ 34,477 $ (2,045) Corporate debt securities 11,228 (440) 15,125 (1,052) 26,353 (1,492) Mortgage-backed and asset-backed securities 7,725 (585) 6,964 (657) 14,689 (1,242) Total $ 39,992 $ (2,029) $ 35,527 $ (2,750) $ 75,519 $ (4,779) We determine realized gains or losses on the sale or extinguishment of debt securities on a specific identification method.The following table summarizes gains and losses for debt securities, reflected as a component of other income (expense), net (in millions): Year Ended December 31, 2020 2021 2022 Unrealized gain (loss) on fair value option debt securities(1) $ 86 $ (122) $ (557) Gross realized gain on debt securities 899 432 103 Gross realized loss on debt securities (184) (329) (1,588) (Increase)/decrease in allowance for credit losses (76) (91) (22) Total gain (loss) on debt securities recognized in other income (expense), net $ 725 $ (110) $ (2,064) (1) Accumulated unrealized net gains (losses) related to debt securities still held where we have elected the fair value option were $87 million, $(35) million, and $(592) million as of December 31, 2020, 2021, and 2022, respectively. 62",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "63",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_28_chunk_0",
        "text": "Table of Contents Alphabet Inc. Stock Performance Graphs The graph below matches Alphabet Inc. Class A's cumulative five-year total stockholder return on common stock with the cumulative total returns of the S&P 500 index, the NASDAQ Composite index, and the RDG Internet Composite index. The graph tracks the performance of a $100 investment in our common stock and in each index (with the reinvestment of all dividends) from December 31, 2018, to December 31, 2023. The returns shown are based on historical results and are not intended to suggest future performance. COMPARISON OF CUMULATIVE 5-YEAR TOTAL RETURN* ALPHABET INC. CLASS A COMMON STOCK Among Alphabet Inc., the S&P 500 Index, the NASDAQ Composite Index, and the RDG Internet Composite Index $400 $350 $300 $250 $200 $150 $100 $50 $0 8 9 9 9 9 0 0 0 0 1 1 1 1 2 2 2 2 3 3 3 3 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 1 1 1 1 1 1 Alphabet Inc. Class A S&P 500 NASDAQ Composite RDG Internet Composite *$100 invested on December 31, 2018, in stock or index, including reinvestment of dividends. © Copyright 2024 S&P, a division of The McGraw-Hill Companies Inc. All rights reserved. 27.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "28",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. Executive Overview The following table summarizes our consolidated financial results (in millions, except for per share information and percentages): Year Ended December 31, 2022 2023 $ Change % Change Consolidated revenues $ 282,836 $ 307,394 $ 24,558 9 % Change in consolidated constant currency revenues(1) 10 % Cost of revenues $ 126,203 $ 133,332 $ 7,129 6 % Operating expenses $ 81,791 $ 89,769 $ 7,978 10 % Operating income $ 74,842 $ 84,293 $ 9,451 13 % Operating margin 26 % 27 % 1 % Other income (expense), net $ (3,514) $ 1,424 $ 4,938 NM Net income $ 59,972 $ 73,795 $ 13,823 23 % Diluted EPS $ 4.56 $ 5.80 $ 1.24 27 % NM = Not Meaningful (1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information. • Revenues were $307.4 billion, an increase of 9% year over year, primarily driven by an increase in Google Services revenues of $19.0 billion, or 8%, and an increase in Google Cloud revenues of $6.8 billion, or 26%. • Total constant currency revenues, which exclude the effect of hedging, increased 10% year over year. • Cost of revenues was $133.3 billion, an increase of 6% year over year, primarily driven by increases in content acquisition costs, compensation expenses, and TAC. The increase in compensation expenses included charges related to employee severance associated with the reduction in our workforce. Additionally, cost of revenues benefited from a reduction in depreciation due to the change in estimated useful lives of our servers and network equipment. • Operating expenses were $89.8 billion, an increase of 10% year over year, primarily driven by an increase in compensation expenses and charges related to our office space optimization efforts. The increase in compensation expenses was largely the result of charges related to employee severance associated with the reduction in our workforce and an increase in SBC expense. Operating expenses benefited from the change in the estimated useful lives of our servers and certain network equipment. Other Information: • In January 2023, we announced a reduction of our workforce, and as a result we recorded employee severance and related charges of $2.1 billion for the year ended December 31, 2023. In addition, we are taking actions to optimize our global office space. As a result, exit charges recorded during the year ended December 31, 2023, were $1.8 billion. In addition to these exit charges, for the year ended December 31, 2023, we incurred $269 million in accelerated rent and accelerated depreciation. For additional information, see Note 8 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. • In January 2023, we completed an assessment of the useful lives of our servers and network equipment, resulting in a change in the estimated useful life of our servers and certain network equipment to six years. The effect of this change was a reduction in depreciation expense",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "35",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_35_chunk_1",
        "text": "of $3.9 billion for the year ended December 31, 2023, recognized primarily in cost of revenues and R&D expenses. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. 34.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "35",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_36_chunk_0",
        "text": "Table of Contents Alphabet Inc. • On July 21, 2023, the IRS announced a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits. This announcement applies to foreign taxes paid or accrued in the fiscal years 2022 and 2023. A cumulative one-time adjustment applicable to the prior period for this tax rule change was recorded in 2023 and is reflected in our effective tax rate of 13.9% for the year ended December 31, 2023. • Repurchases of Class A and Class C shares were $62.2 billion for the year ended December 31, 2023. For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. • Operating cash flow was $101.7 billion for the year ended December 31, 2023. • Capital expenditures, which primarily reflected investments in technical infrastructure, were $32.3 billion for the year ended December 31, 2023. • As of December 31, 2023, we had 182,502 employees. Financial Results Revenues The following table presents revenues by type (in millions): Year Ended December 31, 2022 2023 Google Search & other $ 162,450 $ 175,033 YouTube ads 29,243 31,510 Google Network 32,780 31,312 Google advertising 224,473 237,855 Google subscriptions, platforms, and devices 29,055 34,688 Google Services total 253,528 272,543 Google Cloud 26,280 33,088 Other Bets 1,068 1,527 Hedging gains (losses) 1,960 236 Total revenues $ 282,836 $ 307,394 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $12.6 billion from 2022 to 2023. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. YouTube ads YouTube ads revenues increased $2.3 billion from 2022 to 2023. The growth was driven by our brand and direct response advertising products, both of which benefited from increased spending by our advertisers. Google Network Google Network revenues decreased $1.5 billion from 2022 to 2023, primarily driven by a decrease in Google Ad Manager and AdSense revenues. 35.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_38_chunk_0",
        "text": "Table of Contents Alphabet Inc. Use of Non-GAAP Constant Currency Information International revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates. The effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to U.S. Generally Accepted Accounting Principles (GAAP) results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Year Ended December 31, 2023 % Change from Prior Period Year Ended December 31, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 134,814 $ 146,286 $ 0 $ 146,286 9 % 0 % 9 % EMEA 82,062 91,038 460 90,578 11 % 1 % 10 % APAC 47,024 51,514 (1,759) 53,273 10 % (3) % 13 % Other Americas 16,976 18,320 (654) 18,974 8 % (4) % 12 % Revenues, excluding hedging effect 280,876 307,158 (1,953) 309,111 9 % (1) % 10 % Hedging gains (losses) 1,960 236 Total revenues(1) $ 282,836 $ 307,394 $ 309,111 9 % 0 % (1) % 10 % (1) Total constant currency revenues of $309.1 billion for 2023 increased $28.2 billion compared to $280.9 billion in revenues, excluding hedging effect, for 2022. EMEA revenue growth was favorably affected by changes in",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "38",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_38_chunk_1",
        "text": "foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Euro, partially offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. 37.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "38",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_65_chunk_0",
        "text": "Table of Contents Alphabet Inc. and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets. Debt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts. The following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions): As of December 31, 2022 Gross Gross Cash and Fair Value Adjusted Unrealized Unrealized Cash Marketable Hierarchy Cost Gains Losses Fair Value Equivalents Securities Fair value changes recorded in other comprehensive income Time deposits Level 2 $ 5,297 $ 0 $ 0 $ 5,297 $ 5,293 $ 4 Government bonds Level 2 41,036 64 (2,045) 39,055 283 38,772 Corporate debt securities Level 2 28,578 8 (1,569) 27,017 1 27,016 Mortgage-backed and asset-backed securities Level 2 16,176 5 (1,242) 14,939 0 14,939 Total investments with fair value change reflected in other comprehensive income(1) $ 91,087 $ 77 $ (4,856) $ 86,308 $ 5,577 $ 80,731 Fair value adjustments recorded in net income Money market funds Level 1 $ 7,234 $ 7,234 $ 0 Current marketable Level 1 equity securities(2) 4,013 0 4,013 Mutual funds Level 2 339 0 339 Government bonds Level 2 1,877 440 1,437 Corporate debt securities Level 2 3,744 65 3,679 Mortgage-backed and Level 2 asset-backed securities 1,686 2 1,684 Total investments with fair value change recorded in net income $ 18,893 $ 7,741 $ 11,152 Cash 0 8,561 0 Total $ 91,087 $ 77 $ (4,856) $ 105,201 $ 21,879 $ 91,883 (1) Represents gross unrealized gains and losses for debt securities recorded to AOCI. (2) The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $803 million as of December 31, 2022 is included within other non-current assets. 64.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "65",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_29_chunk_0",
        "text": "Table of Contents Alphabet Inc. Stock Performance Graphs The graph below matches Alphabet Inc. Class A's cumulative five-year total stockholder return on common stock with the cumulative total returns of the S&P 500 index, the NASDAQ Composite index, and the RDG Internet Composite index. The graph tracks the performance of a $100 investment in our common stock and in each index (with the reinvestment of all dividends) from December 31, 2019, to December 31, 2024. The returns shown are based on historical results and are not intended to suggest future performance. COMPARISON OF CUMULATIVE 5-YEAR TOTAL RETURN* ALPHABET INC. CLASS A COMMON STOCK Among Alphabet Inc., the S&P 500 Index, the NASDAQ Composite Index, and the RDG Internet Composite Index $400 $350 $300 $250 $200 $150 $100 $50 $0 9 0 0 0 0 1 1 1 1 2 2 2 2 3 3 3 3 4 4 4 4 1 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 3/ 6/ 9/ 2/ 1 1 1 1 1 1 Alphabet Inc. Class A S&P 500 NASDAQ Composite RDG Internet Composite *$100 invested on December 31, 2019, in stock or index, including reinvestment of dividends. © Copyright 2025 S&P, a division of The McGraw-Hill Companies Inc. All rights reserved. 28.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "29",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_36_chunk_0",
        "text": "Table of Contents Alphabet Inc. Executive Overview The following table summarizes our consolidated financial results (in millions, except for per share information and percentages): Year Ended December 31, 2023 2024 $ Change % Change Consolidated revenues $ 307,394 $ 350,018 $ 42,624 14 % Change in consolidated constant currency revenues(1) 15 % Cost of revenues $ 133,332 $ 146,306 $ 12,974 10 % Operating expenses $ 89,769 $ 91,322 $ 1,553 2 % Operating income $ 84,293 $ 112,390 $ 28,097 33 % Operating margin 27 % 32 % 5 % Other income (expense), net $ 1,424 $ 7,425 $ 6,001 421 % Net income $ 73,795 $ 100,118 $ 26,323 36 % Diluted EPS(2) $ 5.80 $ 8.04 $ 2.24 39 % (1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information. (2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. • Revenues were $350.0 billion, an increase of 14% year over year, primarily driven by an increase in Google Services revenues of $32.4 billion, or 12%, and an increase in Google Cloud revenues of $10.1 billion, or 31%. • Total constant currency revenues, which exclude the effect of hedging, increased 15% year over year. • Cost of revenues was $146.3 billion, an increase of 10% year over year, primarily driven by increases in content acquisition costs, TAC, and depreciation expense. • Operating expenses were $91.3 billion, an increase of 2% year over year, primarily driven by increases in depreciation expense, employee compensation expenses, and third-party services fees. These increases were partially offset by reductions in charges related to legal and other matters and charges related to our office space optimization efforts. The overall increase in employee compensation expenses was partially offset by a reduction in employee severance and related charges. Other Information: • Dividend payments to stockholders of Class A, Class B, and Class C shares, which were first paid in June 2024, were $3.5 billion, $519 million, and $3.3 billion, respectively, totaling $7.4 billion for the year ended December 31, 2024. For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. • Repurchases of Class A and Class C shares were $11.9 billion and $50.2 billion, respectively, totaling $62.0 billion for the year ended December 31, 2024. For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. • Employee severance and related charges for the year ended December 31, 2024 were $1.0 billion, a decrease of $1.1 billion as compared to the year ended December 31, 2023. Office space charges, including accelerated rent and accelerated depreciation, for the year ended December 31, 2024 were $796 million, a decrease of $1.3 billion as compared to the year ended December",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_36_chunk_1",
        "text": "31, 2023. Substantially all of these charges were included in Alphabet-level activities. • Operating cash flow was $125.3 billion for the year ended December 31, 2024. • Capital expenditures, which primarily reflected investments in technical infrastructure, were $52.5 billion for the year ended December 31, 2024. • As of December 31, 2024, we had 183,323 employees. 35.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_37_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Results Revenues The following table presents revenues by type (in millions): Year Ended December 31, 2023 2024 Google Search & other $ 175,033 $ 198,084 YouTube ads 31,510 36,147 Google Network 31,312 30,359 Google advertising 237,855 264,590 Google subscriptions, platforms, and devices 34,688 40,340 Google Services total 272,543 304,930 Google Cloud 33,088 43,229 Other Bets 1,527 1,648 Hedging gains (losses) 236 211 Total revenues $ 307,394 $ 350,018 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $23.1 billion from 2023 to 2024. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. YouTube ads YouTube ads revenues increased $4.6 billion from 2023 to 2024. The growth was driven by our brand advertising products followed by our direct response advertising products, both of which benefited from increased spending by our advertisers. Google Network Google Network revenues decreased $953 million from 2023 to 2024, primarily driven by a decrease in Google Ad Manager and AdMob revenues. Additionally, Google Network revenues were adversely affected by changes in foreign currency exchange rates. Monetization Metrics The following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from 2023 to 2024: Google Search & other Paid clicks change 5 % Cost-per-click change 7 % Google Network Impressions change (11) % Cost-per-impression change 10 % Changes in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices. Changes in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates. 36.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "37",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. Executive Overview The following table summarizes consolidated financial results (in millions, except per share information, percentages, and number of employees): Three Months Ended March 31, 2021 2022 $ Change % Change Consolidated revenues $ 55,314 $ 68,011 12,697 23 % Change in consolidated constant currency revenues 26 % Cost of revenues $ 24,103 $ 29,599 $ 5,496 23 % Operating expenses $ 14,774 $ 18,318 $ 3,544 24 % Operating income $ 16,437 $ 20,094 $ 3,657 22 % Operating margin 30 % 30 % 0 % Other income (expense), net $ 4,846 $ (1,160) $ (6,006) (124) % Net Income $ 17,930 $ 16,436 $ (1,494) (8) % Diluted EPS $ 26.29 $ 24.62 $ (1.67) (6) % Number of Employees 139,995 163,906 23,911 17 % • Revenues were $68.0 billion, an increase of 23% year over year, primarily driven by an increase in Google Services segment revenues of $10.3 billion or 20% and an increase in Google Cloud segment revenues of $1.8 billion or 44%. • Cost of revenues was $29.6 billion, an increase of 23% year over year, driven by increases in other costs of revenues and TAC. • Operating expenses were $18.3 billion, an increase of 24% year over year, primarily driven by headcount growth and increases in advertising and promotional expenses. Other information • During the first quarter of 2022, we suspended the vast majority of our commercial activities in Russia and effectively ceased business activities of our Russian entity. These direct actions did not have a material effect on our financial results. The ongoing broader economic effects resulting from the war in Ukraine on our future financial results may be unpredictable. • We entered into an agreement to acquire Mandiant, a leader in dynamic cyber defense and response, in March 2022 for $23.00 per share, in an all-cash transaction valued at approximately $5.4 billion, net of cash and debt. See Note 7 of the Notes to the Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • Repurchases of Class A and Class C shares were $13.3 billion. In April 2022, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. See Note 10 of the Notes to the Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • The company announced in February 2022 that the Board of Directors had approved and declared a 20-for- one stock split in the form of a one-time special stock dividend on each share of the company’s Class A, Class B, and Class C stock. See Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • Operating cash flow was $25.1 billion, primarily driven by revenues generated from our advertising products. • Capital expenditures of $9.8 billion",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "33",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_33_chunk_1",
        "text": "reflects the increase in purchases of office facilities. 33",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "33",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. the fiscal year ended December 31, 2022 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional details, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2022 as well as Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes our consolidated financial results (in millions, except per share information and percentages): Three Months Ended March 31, 2022 2023 $ Change % Change Consolidated revenues $ 68,011 $ 69,787 $ 1,776 3 % Change in consolidated constant currency revenues(1) 6 % Cost of revenues $ 29,599 $ 30,612 $ 1,013 3 % Operating expenses $ 18,318 $ 21,760 $ 3,442 19 % Operating income $ 20,094 $ 17,415 $ (2,679) (13) % Operating margin 30 % 25 % (5) % Other income (expense), net $ (1,160) $ 790 $ 1,950 NM Net Income $ 16,436 $ 15,051 $ (1,385) (8) % Diluted EPS $ 1.23 $ 1.17 $ (0.06) (5) % NM = Not Meaningful (1) See \"Use of Non-GAAP Constant Currency Measures\" below for details relating to our use of constant currency information. • Revenues were $69.8 billion, an increase of 3% year over year, primarily driven by an increase in Google Cloud revenues of $1.6 billion, or 28%. • Total constant currency revenues, which exclude the effect of hedging, increased 6% year over year. • Cost of revenues was $30.6 billion, an increase of 3% year over year, affected by compensation costs related to employee severance charges associated with the reduction in our workforce, charges related to our office space optimization efforts, and a reduction in depreciation expense due to the change in estimated useful life of our servers and certain network equipment. • Operating expenses were $21.8 billion, an increase of 19% year over year, affected by compensation costs related to employee severance charges associated with the reduction in our workforce as well as the effect of a shift in timing of our annual employee stock-based compensation awards. Other Information • In January 2023, we announced a reduction of our workforce, and as a result in the first quarter of 2023 we recorded employee severance and related charges of $2.0 billion, representing the majority of expected costs associated with this action. In addition, we are taking actions to optimize our global office space, and as a result we recorded charges related to office",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "33",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_33_chunk_1",
        "text": "space reductions of $564 million in the first quarter of 2023. We may incur additional charges in the future as we further evaluate our real estate needs. For 33",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "33",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_32_chunk_0",
        "text": "Other Income (Expense), Net OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10- K for the fiscal year ended December 31, 2023 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 as well as Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes our consolidated financial results (in millions, except per share information and percentages): Three Months Ended March 31, 2023 2024 $ Change % Change Consolidated revenues $ 69,787 $ 80,539 $ 10,752 15 % Change in consolidated constant currency revenues(1) 16 % Cost of revenues $ 30,612 $ 33,712 $ 3,100 10 % Operating expenses $ 21,760 $ 21,355 $ (405) (2) % Operating income $ 17,415 $ 25,472 $ 8,057 46 % Operating margin 25 % 32 % 7 % Other income (expense), net $ 790 $ 2,843 $ 2,053 260 % Net Income $ 15,051 $ 23,662 $ 8,611 57 % Diluted EPS $ 1.17 $ 1.89 $ 0.72 62 % (1) See \"Use of Non-GAAP Constant Currency Measures\" below for details relating to our use of constant currency information. • Revenues were $80.5 billion, an increase of 15% year over year, primarily driven by an increase in Google Services revenues of $8.4 billion, or 14%, and an increase in Google Cloud revenues of $2.1 billion, or 28%. • Total constant currency revenues, which exclude the effect of hedging, increased 16% year over year. • Cost of revenues was $33.7 billion, an increase of 10% year over year, primarily driven by increases in TAC, content acquisition costs, and depreciation expense. These increases were partially offset by decreases in compensation expenses, largely the result of a reduction in employee severance and related charges, and charges related to our office space optimization efforts. • Operating expenses were $21.4 billion, a decrease of",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "32",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_32_chunk_1",
        "text": "2% year over year, primarily driven by decreases in charges related to our office space optimization efforts, compensation expenses, largely the result of a reduction in employee severance and related charges, and charges related to legal matters. These decreases were partially offset by an increase in depreciation expense. 32",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "32",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_35_chunk_0",
        "text": "• third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10- K for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes consolidated financial results (in millions, except per share information and percentages): Three Months Ended March 31, 2024 2025 $ Change % Change Consolidated revenues $ 80,539 $ 90,234 $ 9,695 12 % Change in consolidated constant currency revenues(1) 14 % Cost of revenues $ 33,712 $ 36,361 $ 2,649 8 % Operating expenses $ 21,355 $ 23,267 $ 1,912 9 % Operating income $ 25,472 $ 30,606 $ 5,134 20 % Operating margin 32 % 34 % 2 % Other income (expense), net $ 2,843 $ 11,183 $ 8,340 293 % Net income $ 23,662 $ 34,540 $ 10,878 46 % Diluted EPS (2) $ 1.89 $ 2.81 $ 0.92 49 % (1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information. (2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. • Revenues were $90.2 billion, an increase of 12% year over year, primarily driven by an increase in Google Services revenues of $6.9 billion, or 10%, and an increase in Google Cloud revenues of $2.7 billion, or 28%. • Total constant currency revenues, which exclude the effect of hedging, increased 14% year over year. • Cost of revenues was $36.4 billion, an increase of 8% year over year, primarily driven by increases in content acquisition",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "35",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_35_chunk_1",
        "text": "costs, TAC, and depreciation expense. 35",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "35",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_36_chunk_0",
        "text": "Table of Contents Alphabet Inc. Executive Overview The following table summarizes consolidated financial results (in millions, except per share information, percentages, and number of employees): Three Months Ended June 30, 2021 2022 $ Change % Change Consolidated revenues(1) $ 61,880 $ 69,685 $ 7,805 13 % Change in consolidated constant currency revenues(1) 16 % Cost of revenues $ 26,227 $ 30,104 $ 3,877 15 % Operating expenses $ 16,292 $ 20,128 $ 3,836 24 % Operating income $ 19,361 $ 19,453 $ 92 0 % Operating margin 31 % 28 % (3) % Other income (expense), net $ 2,624 $ (439) $ (3,063) (117) % Net Income $ 18,525 $ 16,002 $ (2,523) (14) % Diluted EPS $ 1.36 $ 1.21 $ (0.15) (11) % Number of Employees 144,056 174,014 29,958 21 % (1) Foreign currency movements affected year-over-year revenue growth rates by 3.7%. This reflects, when rounding to the one decimal place, the percentage change in consolidated revenues and consolidated constant currency revenues year over year of 12.6% and 16.3%, respectively. • Revenues were $69.7 billion, an increase of 13% year over year, primarily driven by an increase in Google Services segment revenues of $5.8 billion or 10% and an increase in Google Cloud segment revenues of $1.6 billion or 36%. • Cost of revenues was $30.1 billion, an increase of 15% year over year, driven by increases in other costs of revenues and TAC. • Operating expenses were $20.1 billion, an increase of 24% year over year, primarily driven by increases in compensation due to headcount growth, professional services fees and advertising and promotional expenses. The increase was partially offset by a decrease in charges related to legal matters. Other information • On July 15, 2022, the company executed a 20-for-one stock split with a record date of July 1, 2022, effected in the form of a one-time special stock dividend on each share of the company's Class A, Class B, and Class C stock. All references made to share or per share amounts throughout this Management's Discussion and Analysis of Financial Condition and Results of Operations have been retroactively adjusted to reflect the effects of the Stock Split. See Note 1 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • Beginning in the first quarter of 2022, we suspended the vast majority of our commercial activities in Russia and effectively ceased business activities of our Russian entity. The ongoing effect of these direct actions on our financial results was not material. The broader economic effects resulting from the war in Ukraine on our future financial results may be unpredictable. • Repurchases of Class A and Class C shares were $15.2 billion for the three months ended June 30, 2022. In April 2022, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. See Note 10 of the Notes to",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_36_chunk_1",
        "text": "Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • Operating cash flow was $19.4 billion for the three months ended June 30, 2022. • Capital expenditures of $6.8 billion for the three months ended June 30, 2022 primarily relate to investments in technical infrastructure. 36",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_36_chunk_0",
        "text": "Other Income (Expense), Net OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10- K for the fiscal year ended December 31, 2023 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 as well as Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes our consolidated financial results (in millions, except per share information and percentages): Three Months Ended June 30, 2023 2024 $ Change % Change Consolidated revenues $ 74,604 $ 84,742 $ 10,138 14 % Change in consolidated constant currency revenues(1) 15 % Cost of revenues $ 31,916 $ 35,507 $ 3,591 11 % Operating expenses $ 20,850 $ 21,810 $ 960 5 % Operating income $ 21,838 $ 27,425 $ 5,587 26 % Operating margin 29 % 32 % 3 % Other income (expense), net $ 65 $ 126 $ 61 94 % Net Income $ 18,368 $ 23,619 $ 5,251 29 % Diluted EPS (2) $ 1.44 $ 1.89 $ 0.45 31 % (1) See \"Use of Non-GAAP Constant Currency Measures\" below for details relating to our use of constant currency information. (2) For additional information on the calculation of diluted EPS, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. • Revenues were $84.7 billion, an increase of 14% year over year, primarily driven by an increase in Google Services revenues of $7.6 billion, or 12%, and an increase in Google Cloud revenues of $2.3 billion, or 29%. • Total constant currency revenues, which exclude the effect of hedging, increased 15% year over year. • Cost of revenues was $35.5 billion, an increase of 11% year over year, primarily driven by increases in content acquisition costs, TAC, depreciation expense, digital services tax related to the recently enacted law",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_36_chunk_1",
        "text": "in Canada, which is applied retroactively, and other technical infrastructure operations costs. • Operating expenses were $21.8 billion, an increase of 5% year over year, primarily driven by increases in compensation expenses, depreciation expense, and third-party services fees. The increase in compensation expenses was largely due to an increase in SBC expenses, which primarily reflects the 36",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_40_chunk_0",
        "text": "• third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10- K for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes consolidated financial results (in millions, except per share information and percentages): Three Months Ended June 30, 2024 2025 $ Change % Change Consolidated revenues $ 84,742 $ 96,428 $ 11,686 14 % Change in consolidated constant currency revenues(1) 13 % Cost of revenues $ 35,507 $ 39,039 $ 3,532 10 % Operating expenses $ 21,810 $ 26,118 $ 4,308 20 % Operating income $ 27,425 $ 31,271 $ 3,846 14 % Operating margin 32 % 32 % 0 % Other income (expense), net $ 126 $ 2,662 $ 2,536 2,013 % Net income $ 23,619 $ 28,196 $ 4,577 19 % Diluted EPS (2) $ 1.89 $ 2.31 $ 0.42 22 % (1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information. (2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. • Revenues were $96.4 billion, an increase of 14% year over year, primarily driven by an increase in Google Services revenues of $8.6 billion, or 12%, and an increase in Google Cloud revenues of $3.3 billion, or 32%. • Total constant currency revenues, which exclude the effect of hedging, increased 13% year over year. • Cost of revenues was $39.0 billion, an increase of 10% year over year, primarily driven by increases in TAC, content",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "40",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_40_chunk_1",
        "text": "acquisition costs, and depreciation expense. 40",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "40",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_44_chunk_0",
        "text": "The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended June 30, 2025 % Change from Prior Period Three Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 41,196 $ 46,063 $ 0 $ 46,063 12 % 0 % 12 % EMEA 24,683 28,262 780 27,482 14 % 3 % 11 % APAC 13,823 16,480 115 16,365 19 % 1 % 18 % Other Americas 4,938 5,735 (352) 6,087 16 % (7) % 23 % Revenues, excluding hedging effect 84,640 96,540 543 95,997 14 % 1 % 13 % Hedging gains (losses) 102 (112) Total revenues(1) $ 84,742 $ 96,428 $ 95,997 14 % 0 % 1 % 13 % (1) Total constant currency revenues of $96.0 billion for the three months ended June 30, 2025 increased $11.4 billion compared to $84.6 billion in revenues, excluding hedging effect, for the three months ended June 30, 2024. EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound. APAC revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Japanese yen, partially offset by the U.S. dollar strengthening relative to the South Korean won and Australian dollar. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso. Six Months Ended June 30, 2025 % Change from Prior Period Six months ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 79,933 $ 90,027 $ 0 $ 90,027 13 % 0 % 13 % EMEA 48,471 54,185 56 54,129 12 % 0 % 12 % APAC 27,112 31,334 (266) 31,600 16 % (1) % 17 % Other Americas 9,591 10,968 (852) 11,820 14 % (9) % 23 % Revenues, excluding hedging effect 165,107 186,514 (1,062) 187,576 13 % (1) % 14 % Hedging gains (losses) 174 148 Total revenues(1) $ 165,281 $ 186,662 $ 187,576 13 % 0 % (1) % 14 % (1) Total constant currency revenues of $187.6 billion for the six months ended June 30, 2025 increased $22.5 billion compared to $165.1 billion in revenues, excluding hedging effect, for the six months ended June 30, 2024. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar weakening relative to the British pound was largely offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Australian dollar, South Korean won, and Indian rupee. Other",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "44",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_44_chunk_1",
        "text": "Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso. Costs and Expenses 44",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "44",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_37_chunk_0",
        "text": "Table of Contents Alphabet Inc. Executive Overview The following table summarizes consolidated financial results (in millions, except per share information, percentages, and number of employees): Three Months Ended September 30, 2021 2022 $ Change % Change Consolidated revenues $ 65,118 $ 69,092 $ 3,974 6 % Change in consolidated constant currency revenues 11 % Cost of revenues $ 27,621 $ 31,158 $ 3,537 13 % Operating expenses $ 16,466 $ 20,799 $ 4,333 26 % Operating income $ 21,031 $ 17,135 $ (3,896) (19) % Operating margin 32 % 25 % (7) % Other income (expense), net $ 2,033 $ (902) $ (2,935) (144) % Net Income $ 18,936 $ 13,910 $ (5,026) (27) % Diluted EPS $ 1.40 $ 1.06 $ (0.34) (24) % Number of Employees 150,028 186,779 36,751 24 % • Revenues were $69.1 billion, an increase of 6% year over year, primarily driven by an increase in Google Cloud segment revenues of $1.9 billion, or 38%, and an increase in Google Services segment revenues of $1.5 billion, or 2%. Hedging gains contributed approximately one percentage point to consolidated revenue growth. • Total constant currency revenues, which exclude the effect of hedging, increased 11% year over year reflecting the strengthening of the U.S. dollar. • Cost of revenues was $31.2 billion, an increase of 13% year over year, primarily driven by an increase in other costs of revenues. • Operating expenses were $20.8 billion, an increase of 26% year over year, primarily driven by increases in compensation expenses due to headcount growth and advertising and promotional expenses. Other information • On September 12, 2022 we closed the acquisition of Mandiant for a total purchase price of $6.1 billion and added over 2,600 employees. Mandiant's financial results are reported within Google Cloud as of the acquisition date. See Note 7 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • Beginning in the first quarter of 2022, we suspended the vast majority of our commercial activities in Russia and effectively ceased business activities of our Russian entity. The ongoing effect of these direct actions on our financial results was not material. The broader economic effects resulting from the war in Ukraine on our future financial results may be unpredictable. • Repurchases of Class A and Class C shares were $15.4 billion for the three months ended September 30, 2022. See Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for additional information. • Operating cash flow was $23.4 billion for the three months ended September 30, 2022. • Capital expenditures of $7.3 billion for the three months ended September 30, 2022 primarily relate to investments in technical infrastructure. 37",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "37",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_37_chunk_0",
        "text": "Table of Contents Alphabet Inc. the fiscal year ended December 31, 2022 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional details, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2022 as well as Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes our consolidated financial results (in millions, except per share information and percentages): Three Months Ended September 30, 2022 2023 $ Change % Change Consolidated revenues $ 69,092 $ 76,693 $ 7,601 11 % Change in consolidated constant currency revenues(1) 11 % Cost of revenues $ 31,158 $ 33,229 $ 2,071 7 % Operating expenses $ 20,799 $ 22,121 $ 1,322 6 % Operating income $ 17,135 $ 21,343 $ 4,208 25 % Operating margin 25 % 28 % 3 % Other income (expense), net $ (902) $ (146) $ 756 (84) % Net Income $ 13,910 $ 19,689 $ 5,779 42 % Diluted EPS $ 1.06 $ 1.55 $ 0.49 46 % (1) See \"Use of Non-GAAP Constant Currency Measures\" below for details relating to our use of constant currency information. • Revenues were $76.7 billion, an increase of 11% year over year, primarily driven by an increase in Google Services revenues of $6.6 billion, or 11%, and an increase in Google Cloud revenues of $1.5 billion, or 22%. • Total constant currency revenues, which exclude the effect of hedging, increased 11% year over year. • Cost of revenues was $33.2 billion, an increase of 7% year over year, primarily driven by an increase in content acquisition costs and TAC. An overall increase in data center and other operations costs was partially offset by a reduction in depreciation expense due to the change in the estimated useful lives of our servers and certain network equipment. • Operating expenses were $22.1 billion, an increase of 6% year over year, primarily driven by increases in compensation expenses largely due to an increase in stock-based compensation, and charges related to legal matters, partially offset by a decrease in advertising and promotional activities. Additionally, operating expenses benefited from a reduction in depreciation expense due to the change in the estimated useful lives of our servers and certain network equipment. Other Information • In January 2023, we announced a reduction of our workforce, and as a result we recorded employee severance and related charges of $86 million and $2.1 billion for",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "37",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_37_chunk_1",
        "text": "the three and nine months ended September 30, 2023, respectively. In addition, we are taking actions to optimize our global office space. As a result, exit charges recorded during the three and nine months ended September 30, 2023 were $16 million and $649 million, respectively. In addition to these exit charges, for the three and nine months ended September 30, 2023, we incurred $207 million in accelerated rent and accelerated depreciation. We may 37",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "37",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. See Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Income before provision for income taxes $ 16,233 $ 21,197 $ 54,181 $ 61,305 Provision for income taxes $ 2,323 $ 1,508 $ 7,833 $ 8,197 Effective tax rate 14.3 % 7.1 % 14.5 % 13.4 % On July 21, 2023 the IRS issued a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits. This announcement only applies to foreign taxes paid or accrued in our fiscal years 2022 and 2023. Additionally, on September 8, 2023, the IRS issued a separate rule change with interim guidance on the capitalization and amortization of R&D expenses. A cumulative one-time adjustment applicable to prior periods for these tax rule changes was recorded in the third quarter of 2023. The effective tax rate decreased from the three months ended September 30, 2022 to the three months ended September 30, 2023, reflecting the effect of the two tax rule changes, particularly the change related to foreign tax credits. The effect of these tax rule changes was partially offset by a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction. The effective tax rate decreased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023, reflecting the effect of the two tax rule changes, particularly the change related to foreign tax credits. The effect of these tax rule changes was partially offset by changes in uncertain tax benefits, a decrease in the stock-based compensation-related tax benefit, and a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of September 30, 2023, we had $119.9 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Nine Months Ended September 30, 2022 2023 Net cash provided by operating activities $ 67,881 $ 82,831 Net cash used in investing activities $ (14,071) $ (20,896) Net cash used in financing activities $ (52,128) $ (52,785) Cash Provided by Operating Activities Our largest source of cash provided",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "46",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_46_chunk_1",
        "text": "by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. Additionally, we generate cash through sales of apps and in-app purchases, and hardware; and licensing and service fees, including fees received for Google Cloud offerings and subscription-based products. 46",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "46",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_36_chunk_0",
        "text": "Other Income (Expense), Net OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10- K for the fiscal year ended December 31, 2023 as well as Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 as well as Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Executive Overview The following table summarizes our consolidated financial results (in millions, except per share information and percentages): Three Months Ended September 30, 2023 2024 $ Change % Change Consolidated revenues $ 76,693 $ 88,268 $ 11,575 15 % Change in consolidated constant currency revenues(1) 16 % Cost of revenues $ 33,229 $ 36,474 $ 3,245 10 % Operating expenses $ 22,121 $ 23,273 $ 1,152 5 % Operating income $ 21,343 $ 28,521 $ 7,178 34 % Operating margin 28 % 32 % 4 % Other income (expense), net $ (146) $ 3,185 $ 3,331 NM Net Income $ 19,689 $ 26,301 $ 6,612 34 % Diluted EPS (2) $ 1.55 $ 2.12 $ 0.57 37 % NM = Not Meaningful (1) See \"Use of Non-GAAP Constant Currency Measures\" below for details relating to our use of constant currency information. (2) For additional information on the calculation of diluted EPS, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. • Revenues were $88.3 billion, an increase of 15% year over year, primarily driven by an increase in Google Services revenues of $8.5 billion, or 13%, and an increase in Google Cloud revenues of $2.9 billion, or 35%. • Total constant currency revenues, which exclude the effect of hedging, increased 16% year over year. • Cost of revenues was $36.5 billion, an increase of 10% year over year, primarily driven by increases in TAC, content acquisition costs, depreciation expense, and devices costs due to Pixel",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_36_chunk_1",
        "text": "family product launch timing in the third quarter this year as compared to the fourth quarter last year. • Operating expenses were $23.3 billion, an increase of 5% year over year, primarily driven by charges related to our office space optimization efforts and increases in depreciation expense, compensation 36",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "36",
            "page_section": "summary_financial_data"
        }
    }
]