[
    {
        "id": "goog-10-k-2022.pdf_page_5_chunk_0",
        "text": "Table of Contents Alphabet Inc. • the expected timing, amount, and effect of Alphabet Inc.'s share repurchases; • our long-term sustainability and diversity goals; • the unpredictability of the ongoing broader economic effects resulting from the war in Ukraine on our future financial results; • the expected financial effect of our announced workforce reduction and office space optimization; • our expectation that the change in estimated useful life of servers and certain network equipment will have a favorable effect on our 2023 operating results; as well as other statements regarding our future operations, financial condition and prospects, and business strategies. Forward-looking statements may appear throughout this report and other documents we file with the Securities and Exchange Commission (SEC), including without limitation, the following sections: Part I, Item 1 \"Business;\" Part I, Item 1A \"Risk Factors;\" and Part II, Item 7 \"Management’s Discussion and Analysis of Financial Condition and Results of Operations.\" Forward-looking statements generally can be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"predicts,\" \"projects,\" \"will be,\" \"will continue,\" \"may,\" \"could,\" \"will likely result,\" and similar expressions. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause our actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in this Annual Report on Form 10-K, and in particular, the risks discussed in Part I, Item 1A, \"Risk Factors\" of this report and those discussed in other documents we file with the SEC. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. As used herein, \"Alphabet,\" \"the company,\" \"we,\" \"us,\" \"our,\" and similar terms include Alphabet Inc. and its subsidiaries, unless the context indicates otherwise. \"Alphabet,\" \"Google,\" and other trademarks of ours appearing in this report are our property. We do not intend our use or display of other companies' trade names or trademarks to imply an endorsement or sponsorship of us by such companies, or any relationship with any of these companies. PART I ITEM 1. BUSINESS Overview As our founders Larry and Sergey wrote in the original founders' letter, \"Google is not a conventional company. We do not intend to become one.\" That unconventional spirit has been a driving force throughout our history, inspiring us to tackle big problems and invest in moonshots, such as our long-term opportunities in artificial intelligence (AI). We continue this work under the leadership of Alphabet and Google CEO Sundar Pichai. Alphabet is a collection of businesses — the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. Alphabet's structure is about helping each of our businesses prosper through strong leaders and",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "5",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_5_chunk_1",
        "text": "independence. Access and technology for everyone The Internet is one of the world’s most powerful equalizers; it propels ideas, people and businesses large and small. Our mission to organize the world’s information and make it universally accessible and useful is as relevant today as it was when we were founded in 1998. Since then, we have evolved from a company that helps people find answers to a company that also helps people get things done. We are focused on building an even more helpful Google for everyone, and we aspire to give everyone the tools they need to increase their knowledge, health, happiness, and success. Google Search helps people find information and make sense of the world in more natural and intuitive ways, with trillions of searches on Google every year. YouTube provides people with entertainment, information, and opportunities to learn something new. Google Assistant offers the best way to get things done seamlessly across different devices, providing intelligent help throughout a person's day, no matter where they are. Google Cloud helps customers solve today’s business challenges, improve productivity, reduce costs, and unlock new growth engines. We are continually innovating and building new products and features that will help our users, partners, customers, and communities and have invested more than $100 billion in research and development in the last five years in support of these efforts. 4",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "5",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_27_chunk_0",
        "text": "Table of Contents Alphabet Inc. ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS Please read the following discussion and analysis of our financial condition and results of operations together with “Note about Forward-Looking Statements,” Part I, Item 1 \"Business,\" Part I, Item 1A \"Risk Factors,\" and our consolidated financial statements and related notes included under Item 8 of this Annual Report on Form 10-K. We have omitted discussion of 2020 results where it would be redundant to the discussion previously included in Item 7 of our 2021 Annual Report on Form 10-K. Understanding Alphabet’s Financial Results Alphabet is a collection of businesses — the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further details on our segments, see Part I, Item 1 “Business” and Note 15 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Trends in Our Business and Financial Effect The following long-term trends have contributed to the results of our consolidated operations, and we anticipate that they will continue to affect our future results: • Users' behaviors and advertising continue to shift online as the digital economy evolves. The continuing shift from an offline to online world has contributed to the growth of our business and our revenues since inception. We expect that this shift to an online world will continue to benefit our business and our revenues, although at a slower pace than we have experienced historically, in particular after the outsized growth in our advertising revenues during the COVID-19 pandemic. In addition, we face increasing competition for user engagement and advertisers, which may affect our revenues. • Users continue to access our products and services using diverse devices and modalities, which allows for new advertising formats that may benefit our revenues but adversely affect our margins. Our users are accessing the Internet via diverse devices and modalities, such as smartphones, wearables, and smart home devices, and want to be able to be connected no matter where they are or what they are doing. We are focused on expanding our products and services to stay in front of these trends in order to maintain and grow our business. We benefit from advertising revenues generated from different channels, including mobile, and newer advertising formats. The margins from these channels and newer products have generally been lower than those from traditional desktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues may be affected. For example, growth in the global smartphone market has slowed due to various factors, including increased market saturation in developed countries, which can affect our mobile advertising revenues. We expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow and TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "27",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_27_chunk_1",
        "text": "mix; geographic mix; partner mix; partner agreement terms; the percentage of queries channeled through paid access points; product mix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms. We expect these trends to continue to affect our revenues and put pressure on our margins. • As online advertising evolves, we continue to expand our product offerings, which may affect our monetization. As interactions between users and advertisers change, and as online user behavior evolves, we continue to expand our product offerings to serve these changing needs, which may affect our monetization. For example, revenues from ads on YouTube and Google Play monetize at a lower rate than our traditional search ads. We also may develop new products incorporating AI innovations that could affect our monetization trends. Additionally, when developing new products and services we generally focus first on user experience before prioritizing monetization. • As users in developing economies increasingly come online, our revenues from international markets continue to increase, and may require continued investments. In addition, movements in foreign exchange rates affect such revenues. The shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S., including in emerging markets, such as India. We continue to invest heavily and develop localized versions of our products and advertising programs relevant to our users in these markets. This has led to a trend of increased 26",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "27",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_29_chunk_0",
        "text": "Table of Contents Alphabet Inc. • seasonality. Additionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from other sources (\"Google other revenues\"), Google Cloud, and Other Bets revenues have been and may continue to be affected by other factors unique to each set of revenues, as described below. Google Services Google Services revenues consist of Google advertising as well as Google other revenues. Google Advertising Google advertising revenues are comprised of the following: • Google Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play; • YouTube ads, which includes revenues generated on YouTube properties; and • Google Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager. We use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties. Paid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost- per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users. Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users. As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity. Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been and may continue to be affected by additional factors, such as: • advertiser competition for keywords; • changes in advertising quality, formats, delivery or policy; • changes in device mix; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and • traffic growth in emerging markets compared to more mature markets and across various verticals and channels. Google Other Google other revenues are comprised of the following: • Google Play, which includes sales of apps and in-app purchases; • hardware, which includes sales of Fitbit wearable devices, Google Nest home products, and Pixel devices; • YouTube non-advertising, which includes subscription revenues from services such as YouTube Premium",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "29",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_29_chunk_1",
        "text": "and YouTube TV; and • other products and services. 28",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "29",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_30_chunk_0",
        "text": "Table of Contents Alphabet Inc. Fluctuations in our Google other revenues have been and may continue to be affected by additional factors, such as changes in customer usage and demand, number of subscribers, and fluctuations in the timing of product launches. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which includes fees for infrastructure, platform, and other services; • Google Workspace, which includes fees for cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and • other enterprise services. Fluctuations in our Google Cloud revenues have been and may continue to be affected by additional factors, such as customer usage. Other Bets Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ Amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers. ◦ Amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues includes: ◦ Content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee). ◦ Expenses associated with our data centers (including bandwidth, compensation expenses, depreciation, energy, and other equipment costs) as well as other operations costs (such as content review as well as customer and product support costs). ◦ Inventory and other costs related to the hardware we sell. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. 29",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "30",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Results Revenues The following table presents revenues by type (in millions): Year Ended December 31, 2021 2022 Google Search & other $ 148,951 $ 162,450 YouTube ads 28,845 29,243 Google Network 31,701 32,780 Google advertising 209,497 224,473 Google other 28,032 29,055 Google Services total 237,529 253,528 Google Cloud 19,206 26,280 Other Bets 753 1,068 Hedging gains (losses) 149 1,960 Total revenues $ 257,637 $ 282,836 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $13.5 billion from 2021 to 2022. The growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage, primarily on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. Growth was adversely affected by the unfavorable effect of foreign currency exchange rates. YouTube ads YouTube ads revenues increased $398 million from 2021 to 2022. The growth was driven by our brand advertising products followed by direct response products, both of which benefited from increased spending by our advertisers as well as improvements to ad formats and delivery. Growth was adversely affected by the unfavorable effect of foreign currency exchange rates. Google Network Google Network revenues increased $1.1 billion from 2021 to 2022. The growth was primarily driven by strength in AdSense and AdMob. Growth was adversely affected by the unfavorable effect of foreign currency exchange rates. Monetization Metrics Paid clicks and cost-per-click The following table presents changes in paid clicks and cost-per-click (expressed as a percentage) from 2021 to 2022: Paid clicks change 10 % Cost-per-click change (1) % Paid clicks increased from 2021 to 2022 driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage, primarily on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. Cost-per-click decreased from 2021 to 2022 driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product changes, and property mix, as well as the unfavorable effect of foreign currency exchange rates. 32",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "33",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. The following table presents the foreign exchange effect on international revenues and total revenues (in millions, except percentages): Year Ended December 31, 2022 % Change from Prior Period Year Ended December 31, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2021 2022 Effect Revenues Reported Effect Effect Revenues United States $ 117,854 $ 134,814 $ 0 $ 134,814 14 % 0 % 14 % EMEA 79,107 82,062 (8,979) 91,041 4 % (11) % 15 % APAC 46,123 47,024 (3,915) 50,939 2 % (8) % 10 % Other Americas 14,404 16,976 (430) 17,406 18 % (3) % 21 % Revenues, excluding hedging effect 257,488 280,876 (13,324) 294,200 9 % (5) % 14 % Hedging gains (losses) 149 1,960 Total revenues(1) $ 257,637 $ 282,836 $ 294,200 10 % 1 % (5) % 14 % (1) Total constant currency revenues of $294.2 billion for 2022 increased $36.7 billion compared to $257.5 billion in revenues, excluding hedging effect for 2021. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Euro and the British pound. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen and the Australian dollar. Other Americas growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Year Ended December 31, 2021 2022 TAC $ 45,566 $ 48,955 Other cost of revenues 65,373 77,248 Total cost of revenues $ 110,939 $ 126,203 Total cost of revenues as a percentage of revenues 43 % 45 % Cost of revenues increased $15.3 billion from 2021 to 2022. The increase was due to an increase in other cost of revenues and TAC of $11.9 billion and $3.4 billion, respectively. The increase in TAC from 2021 to 2022 was due to an increase in TAC paid to distribution partners and to Google Network partners, primarily driven by growth in revenues subject to TAC. The TAC rate was 22% in both 2021 and 2022. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from 2021",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_35_chunk_1",
        "text": "to 2022. The increase in other cost of revenues from 2021 to 2022 was primarily due to increases in data center costs and other operations costs as well as hardware costs. 34",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "35",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_36_chunk_0",
        "text": "Table of Contents Alphabet Inc. Research and Development The following table presents R&D expenses (in millions, except percentages): Year Ended December 31, 2021 2022 Research and development expenses $ 31,562 $ 39,500 Research and development expenses as a percentage of revenues 12 % 14 % R&D expenses increased $7.9 billion from 2021 to 2022 primarily driven by an increase in compensation expenses of $5.4 billion, largely resulting from a 21% increase in average headcount, and an increase in third-party service fees of $704 million. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Year Ended December 31, 2021 2022 Sales and marketing expenses $ 22,912 $ 26,567 Sales and marketing expenses as a percentage of revenues 9 % 9 % Sales and marketing expenses increased $3.7 billion from 2021 to 2022, primarily driven by an increase in compensation expenses of $1.8 billion, largely resulting from a 19% increase in average headcount, and an increase in advertising and promotional activities of $1.3 billion. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Year Ended December 31, 2021 2022 General and administrative expenses $ 13,510 $ 15,724 General and administrative expenses as a percentage of revenues 5 % 6 % General and administrative expenses increased $2.2 billion from 2021 to 2022. The increase was primarily driven by an increase in compensation expenses of $1.1 billion, largely resulting from a 21% increase in average headcount, and an increase in third-party services fees of $815 million. In addition, there was a $551 million increase to the allowance for credit losses for accounts receivable, as the prior year comparable period reflected a decline in the allowance. Segment Profitability The following table presents segment operating income (loss) (in millions). Year Ended December 31, 2021 2022 Operating income (loss): Google Services $ 91,855 $ 86,572 Google Cloud (3,099) (2,968) Other Bets (5,281) (6,083) Corporate costs, unallocated(1) (4,761) (2,679) Total income from operations $ 78,714 $ 74,842 (1) Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs and totaled $149 million and $2.0 billion in 2021 and 2022, respectively. Google Services Google Services operating income decreased $5.3 billion from 2021 to 2022. The decrease in operating income was primarily driven by increases in compensation expenses and TAC, partially offset by growth in revenues. 35",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "36",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. • changes in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives; • general economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending; • new product and service launches; and • seasonality. Additionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from other sources (\"Google subscriptions, platforms, and devices revenues\"), Google Cloud, and Other Bets revenues have been, and may continue to be, affected by other factors unique to each set of revenues, as described below. Google Services Google Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues. Google Advertising Google advertising revenues are comprised of the following: • Google Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play; • YouTube ads, which includes revenues generated on YouTube properties; and • Google Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager. We use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties. Paid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost- per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users. Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users. As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity. Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as: • advertiser competition for keywords; • changes in advertising quality, formats, delivery or policy; • changes in device mix; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and • traffic growth in emerging markets",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_32_chunk_1",
        "text": "compared to more mature markets and across various verticals and channels. 31.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "32",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Year Ended December 31, 2021 2022 2023 TAC $ 45,566 $ 48,955 $ 50,886 Other cost of revenues 65,373 77,248 82,446 Total cost of revenues $ 110,939 $ 126,203 $ 133,332 Total cost of revenues as a percentage of revenues 43 % 45 % 43 % Cost of revenues increased $7.1 billion from 2022 to 2023 due to an increase in other cost of revenues and TAC of $5.2 billion and $1.9 billion, respectively. The increase in TAC from 2022 to 2023 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.8% to 21.4% from 2022 to 2023 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from 2022 to 2023. The increase in other cost of revenues from 2022 to 2023 was primarily due to increases in content acquisition costs, largely for YouTube, and compensation expenses, which included $479 million of charges related to employee severance associated with the reduction in our workforce. Additionally, other cost of revenues benefited from a reduction in depreciation expense due to the change in estimated useful lives of our servers and network equipment. The increase in other cost of revenues of $11.9 billion from 2021 to 2022 was primarily due to increases in device costs, compensation expenses, depreciation, and equipment-related expenses. Research and Development The following table presents R&D expenses (in millions, except percentages): Year Ended December 31, 2022 2023 Research and development expenses $ 39,500 $ 45,427 Research and development expenses as a percentage of revenues 14 % 15 % R&D expenses increased $5.9 billion from 2022 to 2023 primarily driven by an increase in compensation expenses of $2.9 billion, $870 million in charges related to our office space optimization efforts, and an increase in depreciation expense of $722 million. The $2.9 billion increase in compensation expenses was largely the result of a 4% increase in average headcount, after adjusting for roles affected by the reduction in our workforce, and an increase in SBC expense. Additionally, the increase in compensation expenses included $848 million in employee severance charges associated with the reduction in our workforce. The $722 million increase in depreciation expense reflected an offsetting benefit of the change in the estimated useful lives of our servers and network equipment. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Year Ended December 31, 2022 2023 Sales and marketing expenses $ 26,567 $ 27,917 Sales and marketing expenses as a percentage of revenues 9 % 9 % Sales and marketing expenses increased $1.4 billion from 2022 to 2023, primarily driven by an increase in compensation expenses of",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_39_chunk_1",
        "text": "$1.6 billion, partially offset by a decrease in advertising and promotional activities of $441 million. The $1.6 billion increase in compensation expenses was largely the result of $497 million in employee severance charges associated with the reduction in our workforce in addition to a combination of other factors, none of which were individually significant. 38.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "39",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_5_chunk_0",
        "text": "Table of Contents Alphabet Inc. • our expectation that we will continue to face heightened regulatory scrutiny, and changes in regulatory conditions, laws, and public policies, which could affect our business practices and financial results; • the expected timing, amount, and effect of Alphabet Inc.'s share repurchases and dividends; • our long-term sustainability goals; as well as other statements regarding our future operations, financial condition and prospects, and business strategies. Forward-looking statements may appear throughout this report and other documents we file with the Securities and Exchange Commission (SEC), including without limitation, the following sections: Part I, Item 1 \"Business;\" Part I, Item 1A \"Risk Factors;\" and Part II, Item 7 \"Management’s Discussion and Analysis of Financial Condition and Results of Operations.\" Forward-looking statements generally can be identified by words such as \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"predicts,\" \"projects,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause our actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in this Annual Report on Form 10-K, including the risks discussed in Part I, Item 1A \"Risk Factors\" and the trends discussed in Part II, Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" and those discussed in other documents we file with the SEC. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. As used herein, \"Alphabet,\" \"the company,\" \"we,\" \"us,\" \"our,\" and similar terms include Alphabet Inc. and its subsidiaries, unless the context indicates otherwise. \"Alphabet,\" \"Google,\" and other trademarks of ours appearing in this report are our property. We do not intend our use or display of other companies' trade names or trademarks to imply an endorsement or sponsorship of us by such companies, or any relationship with any of these companies. PART I ITEM 1. BUSINESS Overview As our founders Larry and Sergey wrote in the original founders' letter, \"Google is not a conventional company. We do not intend to become one.\" That unconventional spirit has been a driving force throughout our history, inspiring us to tackle big problems and invest in moonshots. It led us to be a pioneer in the development of AI and, since 2016, an AI-first company. We continue this work under the leadership of Alphabet and Google CEO, Sundar Pichai. Alphabet is a collection of businesses — the largest of which is Google. We report Google in two segments, Google Services and Google Cloud, and all non-Google businesses collectively as Other Bets. Supporting these businesses, we have centralized certain AI-related research and development which is reported in Alphabet-level activities. Alphabet's structure is about helping",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "5",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_5_chunk_1",
        "text": "each of our businesses prosper through strong leaders and independence. Access and Technology for Everyone The Internet is one of the world’s most powerful equalizers; it propels ideas, people, and businesses large and small. Our mission to organize the world’s information and make it universally accessible and useful is as relevant today as it was when we were founded in 1998. Since then, we have evolved from a company that helps people find answers to a company that also helps people get things done. We are focused on building an even more helpful Google for everyone, and we aspire to give everyone the tools they need to increase their knowledge, health, happiness, and success. Google Search helps people find information and make sense of the world in more natural and intuitive ways, with trillions of searches on Google every year. YouTube provides people with entertainment, information, and opportunities to learn something new and helps support the creator economy through the YouTube Partner Program. Google Cloud helps customers solve today’s business challenges, improve productivity, reduce costs, and unlock new growth engines. We are continually innovating and building new products and features to help our users, partners, customers, and communities and have invested more than $150 billion in research and development in the last five years in support of these efforts. 4.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "5",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_34_chunk_0",
        "text": "Table of Contents Alphabet Inc. Fluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and the timing of product launches. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini for Google Cloud; cybersecurity; and data and analytics; • Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and • other enterprise services. Fluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand. Other Bets Revenues from Other Bets are generated primarily from the sale of healthcare-related services, and internet services. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount, due to factors such as annual stock-based compensation (SBC) awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee); ◦ depreciation expense related to our technical infrastructure; ◦ employee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support; ◦ inventory and other costs related to the devices we sell; and ◦ other technical infrastructure operations costs, including network capacity, energy, and equipment costs. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "34",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_34_chunk_1",
        "text": "as TAC to our Google Network partners. Operating Expenses 33.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "34",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_37_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Results Revenues The following table presents revenues by type (in millions): Year Ended December 31, 2023 2024 Google Search & other $ 175,033 $ 198,084 YouTube ads 31,510 36,147 Google Network 31,312 30,359 Google advertising 237,855 264,590 Google subscriptions, platforms, and devices 34,688 40,340 Google Services total 272,543 304,930 Google Cloud 33,088 43,229 Other Bets 1,527 1,648 Hedging gains (losses) 236 211 Total revenues $ 307,394 $ 350,018 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $23.1 billion from 2023 to 2024. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. YouTube ads YouTube ads revenues increased $4.6 billion from 2023 to 2024. The growth was driven by our brand advertising products followed by our direct response advertising products, both of which benefited from increased spending by our advertisers. Google Network Google Network revenues decreased $953 million from 2023 to 2024, primarily driven by a decrease in Google Ad Manager and AdMob revenues. Additionally, Google Network revenues were adversely affected by changes in foreign currency exchange rates. Monetization Metrics The following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from 2023 to 2024: Google Search & other Paid clicks change 5 % Cost-per-click change 7 % Google Network Impressions change (11) % Cost-per-impression change 10 % Changes in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices. Changes in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates. 36.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "37",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Year Ended December 31, 2024 % Change from Prior Period Year Ended December 31, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 146,286 $ 170,447 $ 0 $ 170,447 17 % 0 % 17 % EMEA 91,038 102,127 41 102,086 12 % 0 % 12 % APAC 51,514 56,815 (1,369) 58,184 10 % (3) % 13 % Other Americas 18,320 20,418 (1,608) 22,026 11 % (9) % 20 % Revenues, excluding hedging effect 307,158 349,807 (2,936) 352,743 14 % (1) % 15 % Hedging gains (losses) 236 211 Total revenues(1) $ 307,394 $ 350,018 $ 352,743 14 % 0 % (1) % 15 % (1) Total constant currency revenues of $352.7 billion for 2024 increased $45.6 billion compared to $307.2 billion in revenues, excluding hedging effect, for 2023. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar strengthening relative to the Turkish lira was offset by the U.S. dollar weakening relative to the British pound and the euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso and the Brazilian real. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Year Ended December 31, 2023 2024 TAC $ 50,886 $ 54,900 Other cost of revenues 82,446 91,406 Total cost of revenues $ 133,332 $ 146,306 Total cost of revenues as a percentage of revenues 43 % 42 % Cost of revenues increased $13.0 billion from 2023 to 2024 due to an increase in other cost of revenues and TAC of $9.0 billion and $4.0 billion, respectively. The increase in TAC from 2023 to 2024 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.4% to 20.7% from 2023 to 2024 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues increased from 2023 to 2024 primarily due to increases related to mobile searches, which carries higher TAC because more mobile searches are channeled through paid access points. The TAC rate on Google Network revenues was substantially consistent from 2023 to 2024. The increase in other cost of revenues from 2023 to 2024 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and other technical infrastructure operations costs. Research and Development The following table presents R&D expenses (in millions, except percentages):",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_39_chunk_1",
        "text": "38.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "39",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_34_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Results Revenues The following table presents revenues by type (in millions): Three Months Ended March 31, 2021 2022 Google Search & other $ 31,879 $ 39,618 YouTube ads 6,005 6,869 Google Network 6,800 8,174 Google advertising 44,684 54,661 Google other 6,494 6,811 Google Services total 51,178 61,472 Google Cloud 4,047 5,821 Other Bets 198 440 Hedging gains (losses) (109) 278 Total revenues $ 55,314 $ 68,011 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $7.7 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage, primarily on mobile devices, growth in advertiser spending, and improvements we have made in ad formats and delivery. YouTube ads YouTube ads revenues increased $864 million from the three months ended March 31, 2021 to the three months ended March 31, 2022. The growth was driven by our brand and direct response advertising products. Growth for our brand advertising products was primarily driven by increased spending by our advertisers. Growth for our direct response advertising products was primarily driven by increased advertiser spending as well as improvements to ad formats and delivery. Google Network Google Network revenues increased $1.4 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022. The growth was primarily driven by strength in AdSense and AdMob. Monetization Metrics Paid clicks and cost-per-click The following table presents year-over-year changes in paid clicks and cost-per-click (expressed as a percentage): Three Months Ended March 31, 2022 Paid clicks change 16% Cost-per-click change 8% Paid clicks increased from the three months ended March 31, 2021 to the three months ended March 31, 2022, driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage, primarily on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. 34",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "34",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_36_chunk_0",
        "text": "Table of Contents Alphabet Inc. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. The following table presents the foreign exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended March 31, % Change from 2021 2022 Prior Year EMEA revenues $ 17,031 $ 20,317 19 % EMEA constant currency revenues 21,628 27 % APAC revenues 10,455 11,841 13 % APAC constant currency revenues 12,440 19 % Other Americas revenues 2,905 3,842 32 % Other Americas constant currency revenues 3,923 35 % United States revenues 25,032 31,733 27 % Hedging gains (losses) (109) 278 Total revenues $ 55,314 $ 68,011 23 % Revenues, excluding hedging effect $ 55,423 $ 67,733 Exchange rate effect 1,991 Total constant currency revenues $ 69,724 26 % EMEA revenue growth from the three months ended March 31, 2021 to the three months ended March 31, 2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Euro. APAC revenue growth from the three months ended March 31, 2021 to the three months ended March 31, 2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth from the three months ended March 31, 2021 to the three months ended March 31, 2022 was not materially affected by changes in foreign currency exchange rates. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended March 31, 2021 2022 TAC $ 9,712 $ 11,990 Other cost of revenues 14,391 17,609 Total cost of revenues $ 24,103 $ 29,599 Total cost of revenues as a percentage of revenues 43.6 % 43.5 % 36",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "36",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_37_chunk_0",
        "text": "Table of Contents Alphabet Inc. Cost of revenues increased $5.5 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022. The increase was due to increases in other cost of revenues and TAC of $3.2 billion and $2.3 billion, respectively. The increase in TAC from the three months ended March 31, 2021 to the three months ended March 31, 2022 was due to increases in TAC paid to distribution partners and to Google Network partners, primarily driven by growth in revenues subject to TAC. The TAC rate increased from 21.7% to 21.9% from the three months ended March 31, 2021 to the three months ended March 31, 2022 due to a combination of factors none of which were individually significant. The TAC rate on Google Search & other properties revenues and the TAC rate on Google Network revenues were both substantially consistent from three months ended March 31, 2021 to the three months ended March 31, 2022. The increase in other cost of revenues from the three months ended March 31, 2021 to the three months ended March 31, 2022 was primarily due to increases in data center and other operations costs, including depreciation expense, as well as content acquisition costs primarily for YouTube. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended March 31, 2021 2022 Research and development expenses $ 7,485 $ 9,119 Research and development expenses as a percentage of revenues 13.5 % 13.4 % R&D expenses increased $1.6 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022. The increase was primarily due to an increase in compensation expenses of $944 million, largely resulting from a 14% increase in headcount. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended March 31, 2021 2022 Sales and marketing expenses $ 4,516 $ 5,825 Sales and marketing expenses as a percentage of revenues 8.2 % 8.6 % Sales and marketing expenses increased $1.3 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022 primarily driven by an increase in compensation expenses of $599 million and an increase in advertising and promotional activities of $494 million. The increase in compensation expenses was largely due to a 21% increase in headcount. The increase in advertising and promotional activities was driven by both increased spending in the current period and a reduction in spending in the prior year comparable period due to COVID-19. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended March 31, 2021 2022 General and administrative expenses $ 2,773 $ 3,374 General and administrative expenses as a percentage of revenues 5.0 % 5.0 % General and administrative expenses increased $601 million from the three months ended March 31, 2021 to the three months ended March 31, 2022. The increase was primarily driven by",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "37",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_37_chunk_1",
        "text": "an increase in compensation expenses of $292 million, largely resulting from a 19% increase in headcount. 37",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "37",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_31_chunk_0",
        "text": "Table of Contents Alphabet Inc. Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users. Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users. As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity. Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been and may continue to be affected by additional factors, such as: • advertiser competition for keywords; • changes in advertising quality, formats, delivery or policy; • changes in device mix; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and • traffic growth in emerging markets compared to more mature markets and across various verticals and channels. Google Other Google other revenues are comprised of the following: • Google Play, which includes sales of apps and in-app purchases; • hardware, which includes sales of Fitbit wearable devices, Google Nest home products, and Pixel devices; • YouTube non-advertising, which includes subscription revenues from services such as YouTube Premium and YouTube TV; and • other products and services. Fluctuations in our Google other revenues have been and may continue to be affected by additional factors, such as changes in customer usage and demand, number of subscribers, and fluctuations in the timing of product launches. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which includes fees for infrastructure, platform, and other services; • Google Workspace, which includes fees for cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and • other enterprise services. Fluctuations in our Google Cloud revenues have been and may continue to be affected by additional factors, such as customer usage. Other Bets Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. 31",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "31",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ Amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers. ◦ Amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues includes: ◦ Content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee). ◦ Expenses associated with our data centers (including bandwidth, compensation expenses, depreciation, energy, and other equipment costs) as well as other operations costs (such as content review as well as customer and product support costs). ◦ Inventory and other costs related to the hardware we sell. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net Other income (expense), net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional details, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-K for 32",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Results Revenues The following table presents revenues by type (in millions): Three Months Ended March 31, 2022 2023 Google Search & other $ 39,618 $ 40,359 YouTube ads 6,869 6,693 Google Network 8,174 7,496 Google advertising 54,661 54,548 Google other 6,811 7,413 Google Services total 61,472 61,961 Google Cloud 5,821 7,454 Other Bets 440 288 Hedging gains (losses) 278 84 Total revenues $ 68,011 $ 69,787 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $741 million from the three months ended March 31, 2022 to the three months ended March 31, 2023. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. Growth was adversely affected by changes in foreign currency exchange rates. YouTube ads YouTube ads revenues decreased $176 million from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily driven by the adverse effect of changes in foreign currency exchange rates. Google Network Google Network revenues decreased $678 million from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily driven by a decrease in AdMob and Google Ad Manager revenues as well as the adverse effect of changes in foreign currency exchange rates. Monetization Metrics Paid clicks and cost-per-click The following table presents changes in paid clicks and cost-per-click (expressed as a percentage) from the three months ended March 31, 2022 to the three months ended March 31, 2023: Paid clicks change 8% Cost-per-click change (7)% Paid clicks increased from the three months ended March 31, 2022 to the three months ended March 31, 2023 driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and ongoing product and policy changes. Cost-per-click decreased from the three months ended March 31, 2022 to the three months ended March 31, 2023 driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, and property mix, as well as the adverse effect of changes in foreign currency exchange rates. 35",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_37_chunk_0",
        "text": "Table of Contents Alphabet Inc. translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. The following table presents the foreign exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended March 31, 2023 % Change from Prior Period Three Months Ended March 31, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 31,733 $ 32,864 $ 0 $ 32,864 4 % 0 % 4 % EMEA 20,317 21,078 (1,173) 22,251 4 % (6) % 10 % APAC 11,841 11,681 (834) 12,515 (1) % (7) % 6 % Other Americas 3,842 4,080 (167) 4,247 6 % (5) % 11 % Revenues, excluding hedging effect 67,733 69,703 (2,174) 71,877 3 % (3) % 6 % Hedging gains (losses) 278 84 Total revenues(1) $ 68,011 $ 69,787 $ 71,877 3 % 0 % (3) % 6 % (1) Total constant currency revenues of $71.9 billion for the three months ended March 31, 2023 increased $4.1 billion compared to $67.7 billion in revenues, excluding hedging effect, for the three months ended March 31, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Euro and the British pound. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended March 31, 2022 2023 TAC $ 11,990 $ 11,721 Other cost of revenues 17,609 18,891 Total cost of revenues $ 29,599 $ 30,612 Total cost of revenues as a percentage of revenues 44 % 44 % Cost of revenues increased $1.0 billion from the three months ended March 31, 2022 to the three months ended March 31, 2023 due to an increase in other cost of revenues of $1.3 billion, partially offset by a decrease in TAC of $269 million. The decrease in TAC from the three months ended March 31, 2022 to the three months ended March 31, 2023 was largely due to a decrease in TAC paid to Google Network partners, primarily driven by a decrease in revenues subject to TAC. The TAC rate decreased from 21.9% to 21.5% from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily due",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "37",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_37_chunk_1",
        "text": "to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from three months ended March 31, 2022 to the three months ended March 31, 2023. 37",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "37",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_38_chunk_0",
        "text": "Table of Contents Alphabet Inc. The increase in other cost of revenues from the three months ended March 31, 2022 to the three months ended March 31, 2023 was primarily due to increases in data center and other operations costs which includes $681 million of charges related to employee severance associated with the reduction of our workforce and our office space optimization efforts, partially offset by a reduction in depreciation expense due to the change in the estimated useful life of our servers and certain network equipment. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended March 31, 2022 2023 Research and development expenses $ 9,119 $ 11,468 Research and development expenses as a percentage of revenues 13 % 16 % R&D expenses increased $2.3 billion from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily driven by an increase in compensation expenses of $1.7 billion and an increase in facilities costs due to the $247 million in charges related to our office space optimization efforts. The $1.7 billion increase in compensation expenses was largely the result of a 14% increase in average headcount, after adjusting for roles affected by the reduction in workforce for the quarter ended March 31, 2023, and $835 million in employee severance charges associated with the reduction of our workforce, partially offset by the effect of the shift in timing of our annual employee stock-based compensation awards. Additionally, an increase in depreciation of $126 million includes the effect of the change in the estimated useful lives of our servers and network equipment. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended March 31, 2022 2023 Sales and marketing expenses $ 5,825 $ 6,533 Sales and marketing expenses as a percentage of revenues 9 % 9 % Sales and marketing expenses increased $708 million from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily driven by an increase in compensation expenses of $734 million, largely resulting from $445 million in employee severance charges associated with the reduction in our workforce and a 7% increase in average headcount, after adjusting for roles affected by the reduction in workforce for the quarter ended March 31, 2023, partially offset by the effect of the shift in timing of our annual employee stock-based compensation awards. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended March 31, 2022 2023 General and administrative expenses $ 3,374 $ 3,759 General and administrative expenses as a percentage of revenues 5 % 5 % General and administrative expenses increased $385 million from the three months ended March 31, 2022 to the three months ended March 31, 2023, primarily driven by an increase in compensation expenses of $293 million, largely resulting from $253 million in employee severance charges associated with the reduction in our workforce and an",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "38",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_38_chunk_1",
        "text": "6% increase in average headcount, after adjusting for roles affected by the reduction in workforce for the quarter ended March 31, 2023, partially offset by the effect of the shift in timing of our annual employee stock-based compensation awards. 38",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "38",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_31_chunk_0",
        "text": "Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in compensation expenses may not directly correlate with changes in headcount, in particular due to annual SBC awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ compensation expense related to our data centers and other operations such as content review and customer and product support; ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee); ◦ depreciation expense related to our technical infrastructure; and ◦ inventory and other costs related to the devices we sell. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including certain fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. 31",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "31",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_35_chunk_0",
        "text": "financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended March 31, 2024 % Change from Prior Period Three Months Ended March 31, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 32,864 $ 38,737 $ 0 $ 38,737 18 % 0 % 18 % EMEA 21,078 23,788 204 23,584 13 % 1 % 12 % APAC 11,681 13,289 (439) 13,728 14 % (4) % 18 % Other Americas 4,080 4,653 (152) 4,805 14 % (4) % 18 % Revenues, excluding hedging effect 69,703 80,467 (387) 80,854 15 % (1) % 16 % Hedging gains (losses) 84 72 Total revenues(1) $ 69,787 $ 80,539 $ 80,854 15 % 0 % (1) % 16 % (1) Total constant currency revenues of $80.9 billion for the three months ended March 31, 2024 increased $11.2 billion compared to $69.7 billion in revenues, excluding hedging effect, for the three months ended March 31, 2023. EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Euro, partially offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_35_chunk_1",
        "text": "U.S. dollar strengthening relative to the Argentine peso. 35",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "35",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_36_chunk_0",
        "text": "Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended March 31, 2023 2024 TAC $ 11,721 $ 12,946 Other cost of revenues 18,891 20,766 Total cost of revenues $ 30,612 $ 33,712 Total cost of revenues as a percentage of revenues 44 % 42 % Cost of revenues increased $3.1 billion from the three months ended March 31, 2023 to the three months ended March 31, 2024 due to an increase in other cost of revenues and TAC of $1.9 billion and $1.2 billion, respectively. The increase in TAC from the three months ended March 31, 2023 to the three months ended March 31, 2024 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.5% to 21.0% from the three months ended March 31, 2023 to the three months ended March 31, 2024 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues was substantially consistent from the three months ended March 31, 2023 to the three months ended March 31, 2024. The TAC rate on Google Network revenues reflected a slight increase from the three months ended March 31, 2023 to the three months ended March 31, 2024 due to a combination of factors, none of which were individually significant. The increase in other cost of revenues from the three months ended March 31, 2023 to the three months ended March 31, 2024 was primarily due to increases in content acquisition costs, largely for YouTube, and depreciation expense. These increases were partially offset by decreases in compensation expenses, largely the result of a reduction in employee severance and related charges of $308 million, and charges related to our office space optimization efforts of $220 million. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended March 31, 2023 2024 Research and development expenses $ 11,468 $ 11,903 Research and development expenses as a percentage of revenues 16 % 15 % R&D expenses increased $435 million from the three months ended March 31, 2023 to the three months ended March 31, 2024, primarily driven by increases in depreciation expense of $308 million and third-party services fees of $253 million, partially offset by a decrease in charges associated with our office space optimization efforts of $247 million. Additionally, a decrease in compensation expenses of $64 million was primarily the result of a reduction in employee severance and related charges of $588 million. This decrease was partially offset by an increase in SBC expense of $320 million, excluding employee severance and related charges. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended March 31, 2023 2024 Sales and marketing expenses $ 6,533 $ 6,426 Sales and marketing expenses as a percentage",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "36",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_36_chunk_1",
        "text": "of revenues 9 % 8 % Sales and marketing expenses decreased $107 million from the three months ended March 31, 2023 to the three months ended March 31, 2024, primarily driven by a decrease in compensation expenses of $85 million, 36",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "36",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_34_chunk_0",
        "text": "Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount due to factors such as annual SBC awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee); ◦ depreciation expense related to our technical infrastructure; ◦ employee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support; ◦ inventory and other costs related to the devices we sell; and ◦ other technical infrastructure operations costs, including network capacity, energy, and equipment costs. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • depreciation; • employee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • employee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spend relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • employee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal and other matters, including certain fines and settlements; and 34",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "34",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_37_chunk_0",
        "text": "Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $4.5 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. YouTube ads YouTube ads revenues increased $837 million from the three months ended March 31, 2024 to the three months ended March 31, 2025. The growth was driven by our direct response advertising products followed by our brand advertising products, both of which benefited from increased spending by our advertisers. Google Network Google Network revenues decreased $157 million from the three months ended March 31, 2024 to the three months ended March 31, 2025, primarily due to the unfavorable effect of foreign currency exchange rates and a decrease in Google Ad Manager and AdMob revenues. These decreases were partially offset by an increase in AdSense revenues. Monetization Metrics The following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from three months ended March 31, 2024 to three months ended March 31, 2025: Google Search & other Paid clicks change 2 % Cost-per-click change 7 % Google Network Impressions change (5) % Cost-per-impression change 4 % Changes in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices. Changes in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates. Google subscriptions, platforms, and devices Google subscriptions, platforms, and devices revenues increased $1.6 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025. The growth was primarily driven by an increase in subscription revenues. The increase in subscription revenues was primarily due to growth in the number of paid subscribers across both YouTube services and Google One. Google Cloud Google Cloud revenues increased $2.7 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure services. 37",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "37",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_39_chunk_0",
        "text": "The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended March 31, 2025 % Change from Prior Period Three Months Ended March 31, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 38,737 $ 43,964 $ 0 $ 43,964 13 % 0 % 13 % EMEA 23,788 25,923 (724) 26,647 9 % (3) % 12 % APAC 13,289 14,854 (381) 15,235 12 % (3) % 15 % Other Americas 4,653 5,233 (500) 5,733 12 % (11) % 23 % Revenues, excluding hedging effect 80,467 89,974 (1,605) 91,579 12 % (2) % 14 % Hedging gains (losses) 72 260 Total revenues(1) $ 80,539 $ 90,234 $ 91,579 12 % 0 % (2) % 14 % (1) Total constant currency revenues of $91.6 billion for the three months ended March 31, 2025 increased $11.1 billion compared to $80.5 billion in revenues, excluding hedging effect, for the three months ended March 31, 2024. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen, Australian dollar, and South Korean won. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended March 31, 2024 2025 TAC $ 12,946 $ 13,748 Other cost of revenues 20,766 22,613 Total cost of revenues $ 33,712 $ 36,361 Total cost of revenues as a percentage of revenues 42 % 40 % Cost of revenues increased $2.6 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025 due to an increase in other cost of revenues and TAC of $1.8 billion and $802 million, respectively. The increase in TAC from the three months ended March 31, 2024 to the three months ended March 31, 2025 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.0% to 20.6% from the three months ended March 31, 2024 to the three months ended March 31, 2025 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues increased from the three months ended March 31, 2024 to the three months ended March 31, 2025 primarily due to increases related to mobile searches, which carries higher TAC because more mobile searches are channeled through paid access points. The TAC rate on Google Network revenues decreased from the three months ended March 31, 2024",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_39_chunk_1",
        "text": "to the three months ended March 31, 2025 due to a combination of factors, none of which were individually significant. The increase in other cost of revenues from the three months ended March 31, 2024 to the three months ended March 31, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and other technical infrastructure operations costs. 39",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "39",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_34_chunk_0",
        "text": "Table of Contents Alphabet Inc. • changes in advertising quality, formats, delivery or policy; • changes in device mix; • changes in foreign currency exchange rates; • fees advertisers are willing to pay based on how they manage their advertising costs; • general economic conditions and various external dynamics, including the effect of COVID-19, geopolitical events, regulations and other measures; • seasonality; and • traffic growth in emerging markets compared to more mature markets and across various advertising verticals and channels. Google Other Google other revenues are comprised of the following: • Google Play, which includes sales of apps and in-app purchases and digital content sold in the Google Play store; • Devices and Services, which includes sales of hardware, including Fitbit wearable devices, Google Nest home products, and Pixel phones; • YouTube non-advertising, which includes YouTube Premium and YouTube TV subscriptions; and • other products and services. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which includes fees for infrastructure, platform, and other services; • Google Workspace, which includes fees for cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and • other enterprise services. Other Bets Revenues from Other Bets are generated primarily from the sale of health technology and internet services. For further details on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2021. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of these expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to the changes in revenue. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ Amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers. ◦ Amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues includes: ◦ Content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee). 34",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "34",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. Use of Constant Currency Revenues and Constant Currency Revenue Percentage Change The effect of currency exchange rates on our business is an important factor in understanding period to period comparisons. We use non-GAAP constant currency revenues and non-GAAP percentage change in constant currency revenues for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as total revenues excluding the effect of foreign exchange rate movements and hedging activities, and use it to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. The following table presents the foreign exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, % Change % Change from Prior from Prior 2021 2022 Year 2021 2022 Year EMEA revenues $ 19,084 $ 20,533 8 % $ 36,115 $ 40,850 13 % EMEA constant currency revenues 22,489 18 % $ 44,117 22 % APAC revenues 11,231 11,710 4 % $ 21,686 $ 23,551 9 % APAC constant currency revenues 12,466 11 % $ 24,906 15 % Other Americas revenues 3,364 4,340 29 % $ 6,269 $ 8,182 31 % Other Americas constant currency revenues 4,310 28 % $ 8,233 31 % United States revenues 28,208 32,727 16 % $ 53,240 $ 64,460 21 % Hedging gains (losses) (7) 375 $ (116) $ 653 Total revenues $ 61,880 $ 69,685 13 % $ 117,194 $ 137,696 17 % Revenues, excluding hedging effect $ 61,887 $ 69,310 $ 117,310 $ 137,043 Exchange rate effect 2,682 4,673 Total constant currency revenues $ 71,992 16 % $ 141,716 21 % EMEA revenue growth from the three and six months ended June 30, 2021 to the three and six months ended June 30, 2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_39_chunk_1",
        "text": "U.S. dollar strengthening relative to the Euro and British pound. APAC revenue growth from the three and six months ended June 30, 2021 to the three and six months ended June 30, 2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. 39",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "39",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. Other Americas revenue growth from the three and six months ended June 30, 2021 to the three and six months ended June 30, 2022 was not materially affected by changes in foreign currency exchange rates. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 TAC $ 10,929 $ 12,214 $ 20,641 $ 24,204 Other cost of revenues 15,298 17,890 29,689 35,499 Total cost of revenues $ 26,227 $ 30,104 $ 50,330 $ 59,703 Total cost of revenues as a percentage of revenues 42.4 % 43.2 % 42.9 % 43.4 % Cost of revenues increased $3.9 billion from the three months ended June 30, 2021 to the three months ended June 30, 2022. The increase was due to increases in other cost of revenues and TAC of $2.6 billion and $1.3 billion, respectively. Cost of revenues increased $9.4 billion from the six months ended June 30, 2021 to the six months ended June 30, 2022. The increase was due to increases in other cost of revenues and TAC of $5.8 billion and $3.6 billion, respectively. The increase in TAC from the three and six months ended June 30, 2021 to the three and six months ended June 30, 2022 was due to increases in TAC paid to distribution partners and to Google Network partners, primarily driven by growth in revenues subject to TAC. The TAC rate was 21.7% in both the three months ended June 30, 2021 and the three months ended June 30, 2022. The TAC rate increased from 21.7% to 21.8% from the six months ended June 30, 2021 to the six months ended June 30, 2022 due to a combination of factors, none of which were individually significant. The TAC rate on Google Search & other properties revenues and the TAC rate on Google Network revenues were both substantially consistent from three and six months ended June 30, 2021 to the three and six months ended June 30, 2022. The increase in other cost of revenues from the three and six months ended June 30, 2021 to the three and six months ended June 30, 2022 was primarily due to increases in data center and other operations costs, including depreciation expense, as well as content acquisition costs primarily for YouTube. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Research and development expenses $ 7,675 $ 9,841 $ 15,160 $ 18,960 Research and development expenses as a percentage of revenues 12.4 % 14.1 % 12.9 % 13.8 % R&D expenses increased $2.2 billion from the three months ended June 30, 2021 to the three months ended June 30, 2022. The increase was primarily driven by an increase in compensation expenses of $1.4 billion, largely resulting from a 18% increase in headcount,",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_40_chunk_1",
        "text": "and an increase in professional services fees of $312 million. R&D expenses increased $3.8 billion from the six months ended June 30, 2021 to the six months ended June 30, 2022. The increase was primarily driven by an increase in compensation expenses of $2.3 billion, largely resulting from a 17% increase in headcount, and an increase in professional services fees of $456 million. 40",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_34_chunk_0",
        "text": "Table of Contents Alphabet Inc. Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users. Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users. As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity. Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been and may continue to be affected by additional factors, such as: • advertiser competition for keywords; • changes in advertising quality, formats, delivery or policy; • changes in device mix; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and • traffic growth in emerging markets compared to more mature markets and across various verticals and channels. Google Other Google other revenues are comprised of the following: • Google Play, which includes sales of apps and in-app purchases; • hardware, which includes sales of Fitbit wearable devices, Google Nest home products, and Pixel devices; • YouTube non-advertising, which includes subscription revenues from services such as YouTube Premium and YouTube TV; and • other products and services. Fluctuations in our Google other revenues have been and may continue to be affected by additional factors, such as changes in customer usage and demand, number of subscribers, and fluctuations in the timing of product launches. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which includes fees for infrastructure, platform, and other services; • Google Workspace, which includes fees for cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and • other enterprise services. Fluctuations in our Google Cloud revenues have been and may continue to be affected by additional factors, such as customer usage. Other Bets Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. 34",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "34",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ Amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers. ◦ Amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues includes: ◦ Content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee). ◦ Expenses associated with our data centers (including bandwidth, compensation expenses, depreciation, energy, and other equipment costs) as well as other operations costs (such as content review as well as customer and product support costs). ◦ Inventory and other costs related to the hardware we sell. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net Other income (expense), net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional details, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-K for 35",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. Paid clicks increased from the three and six months ended June 30, 2022 to the three and six months ended June 30, 2023 driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and ongoing product and policy changes. Cost-per-click decreased from the three and six months ended June 30, 2022 to the three and six months ended June 30, 2023 driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, and property mix. Additionally, cost-per-click was adversely affected by changes in foreign currency exchange rates for the six months ended June 30, 2023 and, to a lesser extent, for the three months ended June 30, 2023. Impressions and cost-per-impression The following table presents year-over-year changes in impressions and cost-per-impression (expressed as a percentage): Three Months Six Months Ended June 30, Ended June 30, 2023 2023 Impressions change 0% (2)% Cost-per-impression change (5)% (5)% Impressions were relatively unchanged from the three months ended June 30, 2022 to the three months ended June 30, 2023, as an increase in AdMob was largely offset by decreases in AdSense and Google Ad Manager. The decrease in cost-per-impression from the three months ended June 30, 2022 to the three months ended June 30, 2023 was driven by a number of interrelated factors including ongoing product and policy changes, changes in device mix, geographic mix, product mix, and property mix, as well as the adverse effect of changes in foreign currency exchange rates. Impressions decreased from the six months ended June 30, 2022 to the six months ended June 30, 2023 driven by decreases in Google Ad Manager and AdSense, partially offset by an increase in AdMob. The decrease in cost-per-impression from the six months ended June 30, 2022 to the six months ended June 30, 2023 was driven by a number of interrelated factors including ongoing product and policy changes, changes in device mix, geographic mix, product mix, and property mix, as well as the adverse effect of changes in foreign currency exchange rates. Google other revenues Google other revenues increased $1.6 billion and $2.2 billion from the three and six months ended June 30, 2022 to the three and six months ended June 30, 2023 primarily driven by growth in YouTube non-advertising, largely due to an increase in paid subscribers, and growth in hardware, due to increased sales of Pixel devices, in large part due to product launch timing. Additionally, growth was adversely affected by changes in foreign currency exchange rates for the six months ended June 30, 2023 and, to a lesser extent, for the three months ended June 30, 2023. Google Cloud Google Cloud revenues increased $1.8 billion and $3.4 billion from the three and six months ended June 30, 2022 to the three and six months ended June 30, 2023, respectively. Growth was primarily driven by",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_39_chunk_1",
        "text": "Google Cloud Platform followed by Google Workspace offerings. Google Cloud's infrastructure and platform services were the largest drivers of growth in Google Cloud Platform. 39",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "39",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_41_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended June 30, 2023 % Change from Prior Period Three Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 32,727 $ 35,073 $ 0 $ 35,073 7 % 0 % 7 % EMEA 20,533 22,289 (275) 22,564 9 % (1) % 10 % APAC 11,710 12,728 (565) 13,293 9 % (5) % 14 % Other Americas 4,340 4,511 (306) 4,817 4 % (7) % 11 % Revenues, excluding hedging effect 69,310 74,601 (1,146) 75,747 8 % (1) % 9 % Hedging gains (losses) 375 3 Total revenues(1) $ 69,685 $ 74,604 $ 75,747 7 % (1) % (1) % 9 % (1) Total constant currency revenues of $75.7 billion for the three months ended June 30, 2023 increased $6.4 billion compared to $69.3 billion in revenues, excluding hedging effect, for the three months ended June 30, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the British pound. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Six Months Ended June 30, 2023 % Change from Prior Period Six Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 64,460 $ 67,937 $ 0 $ 67,937 5 % 0 % 5 % EMEA 40,850 43,367 (1,448) 44,815 6 % (4) % 10 % APAC 23,551 24,409 (1,399) 25,808 4 % (6) % 10 % Other Americas 8,182 8,591 (473) 9,064 5 % (6) % 11 % Revenues, excluding hedging effect 137,043 144,304 (3,320) 147,624 5 % (3) % 8 % Hedging gains (losses) 653 87 Total revenues(1) $ 137,696 $ 144,391 $ 147,624 5 % 0 % (3) % 8 % (1) Total constant currency revenues of $147.6 billion for the six months ended June 30, 2023 increased $10.6 billion compared to $137.0 billion in revenues, excluding hedging effect, for the six months ended June 30, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the British pound and the Euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. 41",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "41",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 TAC $ 12,214 $ 12,537 $ 24,204 $ 24,258 Other cost of revenues 17,890 19,379 35,499 38,270 Total cost of revenues $ 30,104 $ 31,916 $ 59,703 $ 62,528 Total cost of revenues as a percentage of revenues 43 % 43 % 43 % 43 % Cost of revenues increased $1.8 billion from the three months ended June 30, 2022 to the three months ended June 30, 2023 due to an increase in other cost of revenues and TAC of $1.5 billion and $323 million, respectively. Cost of revenues increased $2.8 billion from the six months ended June 30, 2022 to the six months ended June 30, 2023, primarily due to an increase in other cost of revenues of $2.8 billion. The increase in TAC from the three months ended June 30, 2022 to the three months ended June 30, 2023 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. TAC was relatively unchanged from the six months ended June 30, 2022 to the six months ended June 30, 2023. The TAC rate decreased from 21.7% to 21.6% from the three months ended June 30, 2022 to the three months ended June 30, 2023 and decreased from 21.8% to 21.5% from the six months ended June 30, 2022 to the six months ended June 30, 2023 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from the three and six months ended June 30, 2022 to the three and six months ended June 30, 2023. The increase in other cost of revenues from the three months ended June 30, 2022 to the three months ended June 30, 2023 was primarily due to increases in content acquisition costs, primarily for YouTube, and hardware costs. An overall increase in data center and other operations costs was partially offset by a reduction in depreciation expense due to the change in the estimated useful lives of our servers and certain network equipment. The increase in other cost of revenues from the six months ended June 30, 2022 to the six months ended June 30, 2023 was primarily due to increases in content acquisition costs, primarily for YouTube, and data center and other operations costs. The overall increase in data center and other operations costs includes $700 million of charges related to employee severance associated with the reduction of our workforce and our office space optimization efforts, partially offset by a reduction in depreciation expense due to the change in the estimated useful lives of our servers and certain network equipment. Research and Development The following",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_42_chunk_1",
        "text": "table presents R&D expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Research and development expenses $ 9,841 $ 10,588 $ 18,960 $ 22,056 Research and development expenses as a percentage of revenues 14 % 14 % 14 % 15 % R&D expenses increased $747 million from the three months ended June 30, 2022 to the three months ended June 30, 2023 primarily driven by an increase in compensation expenses of $356 million and an increase in depreciation of $168 million. The $356 million increase in compensation expenses was largely the result of a 6% increase in average headcount, after adjusting for roles affected by the reduction in workforce, partially offset by a reduction in valuation-based compensation liabilities related to certain Other Bets. The $168 million increase in depreciation includes the benefit of the change in the estimated useful lives of our servers and network equipment. R&D expenses increased $3.1 billion from the six months ended June 30, 2022 to the six months ended June 30, 2023 primarily driven by an increase in compensation expenses of $2.0 billion and an increase in depreciation of $294 million. The $2.0 billion increase in compensation expenses was largely the result of a 10% increase in average headcount, after adjusting for roles affected by the reduction in workforce, and $832 million in employee 42",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "42",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_35_chunk_0",
        "text": "Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in compensation expenses may not directly correlate with changes in headcount, in particular due to annual SBC awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ compensation expense related to our technical infrastructure and other operations such as content review and customer and product support; ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee); ◦ depreciation expense related to our technical infrastructure; ◦ inventory and other costs related to the devices we sell; and ◦ other technical infrastructure operations costs, including bandwidth, energy, and equipment costs. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including certain fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. 35",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_40_chunk_0",
        "text": "Six Months Ended June 30, 2024 % Change from Prior Period Six Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 67,937 $ 79,933 $ 0 $ 79,933 18 % 0 % 18 % EMEA 43,367 48,471 (163) 48,634 12 % 0 % 12 % APAC 24,409 27,112 (1,034) 28,146 11 % (4) % 15 % Other Americas 8,591 9,591 (457) 10,048 12 % (5) % 17 % Revenues, excluding hedging effect 144,304 165,107 (1,654) 166,761 14 % (2) % 16 % Hedging gains (losses) 87 174 Total revenues(1) $ 144,391 $ 165,281 $ 166,761 14 % 0 % (2) % 16 % (1) Total constant currency revenues of $166.8 billion for the six months ended June 30, 2024 increased $22.5 billion compared to $144.4 billion in revenues, excluding hedging effect, for the six months ended June 30, 2023. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar strengthening relative to the Turkish lira was largely offset by the U.S. dollar weakening relative to the British pound and the Euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 TAC $ 12,537 $ 13,387 $ 24,258 $ 26,333 Other cost of revenues 19,379 22,120 38,270 42,886 Total cost of revenues $ 31,916 $ 35,507 $ 62,528 $ 69,219 Total cost of revenues as a percentage of revenues 43 % 42 % 43 % 42 % Cost of revenues increased $3.6 billion from the three months ended June 30, 2023 to the three months ended June 30, 2024 due to an increase in other cost of revenues and TAC of $2.7 billion and $850 million, respectively. Cost of revenues increased $6.7 billion from the six months ended June 30, 2023 to the six months ended June 30, 2024 due to an increase in other cost of revenues and TAC of $4.6 billion and $2.1 billion, respectively. The increase in TAC from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.6% to 20.7% from the three months ended June 30, 2023 to the three months ended June 30, 2024 and decreased from 21.5% to 20.9% from the six months ended June 30, 2023 to the six months ended June 30, 2024,",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_40_chunk_1",
        "text": "primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues was substantially consistent from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024. The TAC rate on Google Network revenues was substantially consistent from the three months ended June 30, 2023 to the three months ended June 30, 2024 and reflected a slight increase from the six months ended June 30, 2023 to the six months ended June 30, 2024 due to a combination of factors, none of which were individually significant. The increase in other cost of revenues from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, digital services tax related to the recently enacted law in Canada, which is applied retroactively, and other technical infrastructure operations costs. Additionally, an increase in third-party service fees 40",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_41_chunk_0",
        "text": "contributed to the increase in other cost of revenues from the six months ended June 30, 2023 to the six months ended June 30, 2024. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Research and development expenses $ 10,588 $ 11,860 $ 22,056 $ 23,763 Research and development expenses as a percentage of revenues 14 % 14 % 15 % 14 % R&D expenses increased $1.3 billion from the three months ended June 30, 2023 to the three months ended June 30, 2024, primarily driven by increases in compensation expenses of $585 million, depreciation expense of $331 million, and third-party services fees of $219 million. The increase in compensation expenses was largely due to an increase in SBC expenses of $471 million, which primarily reflects the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period. R&D expenses increased $1.7 billion from the six months ended June 30, 2023 to the six months ended June 30, 2024, primarily driven by increases in depreciation expense of $640 million, compensation expenses of $522 million, and third-party services fees of $472 million. The increase in compensation expenses was primarily related to an increase in SBC expenses of $790 million, excluding employee severance and related charges, and reflects the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period. The increase in compensation expenses is partially offset by a reduction in employee severance and related charges of $569 million. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Sales and marketing expenses $ 6,781 $ 6,792 $ 13,314 $ 13,218 Sales and marketing expenses as a percentage of revenues 9 % 8 % 9 % 8 % Sales and marketing expenses increased $11 million from the three months ended June 30, 2023 to the three months ended June 30, 2024, and decreased $96 million from the six months ended June 30, 2023 to the six months ended June 30, 2024, due to a combination of factors, none of which were individually significant. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 General and administrative expenses $ 3,481 $ 3,158 $ 7,240 $ 6,184 General and administrative expenses as a percentage of revenues 5 % 4 % 5 % 4 % General and administrative expenses decreased $323 million and $1.1 billion from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024, primarily driven by a reduction in charges related to legal matters of $471 million and $718 million, respectively, as well as a combination of factors, none of which were individually significant.",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "41",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_41_chunk_1",
        "text": "41",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "41",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_39_chunk_0",
        "text": "Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount due to factors such as annual SBC awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee); ◦ depreciation expense related to our technical infrastructure; ◦ employee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support; ◦ inventory and other costs related to the devices we sell; and ◦ other technical infrastructure operations costs, including network capacity, energy, and equipment costs. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • depreciation; • employee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • employee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spend relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • employee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal and other matters, including certain fines and settlements; and 39",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_44_chunk_0",
        "text": "The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended June 30, 2025 % Change from Prior Period Three Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 41,196 $ 46,063 $ 0 $ 46,063 12 % 0 % 12 % EMEA 24,683 28,262 780 27,482 14 % 3 % 11 % APAC 13,823 16,480 115 16,365 19 % 1 % 18 % Other Americas 4,938 5,735 (352) 6,087 16 % (7) % 23 % Revenues, excluding hedging effect 84,640 96,540 543 95,997 14 % 1 % 13 % Hedging gains (losses) 102 (112) Total revenues(1) $ 84,742 $ 96,428 $ 95,997 14 % 0 % 1 % 13 % (1) Total constant currency revenues of $96.0 billion for the three months ended June 30, 2025 increased $11.4 billion compared to $84.6 billion in revenues, excluding hedging effect, for the three months ended June 30, 2024. EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound. APAC revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Japanese yen, partially offset by the U.S. dollar strengthening relative to the South Korean won and Australian dollar. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso. Six Months Ended June 30, 2025 % Change from Prior Period Six months ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 79,933 $ 90,027 $ 0 $ 90,027 13 % 0 % 13 % EMEA 48,471 54,185 56 54,129 12 % 0 % 12 % APAC 27,112 31,334 (266) 31,600 16 % (1) % 17 % Other Americas 9,591 10,968 (852) 11,820 14 % (9) % 23 % Revenues, excluding hedging effect 165,107 186,514 (1,062) 187,576 13 % (1) % 14 % Hedging gains (losses) 174 148 Total revenues(1) $ 165,281 $ 186,662 $ 187,576 13 % 0 % (1) % 14 % (1) Total constant currency revenues of $187.6 billion for the six months ended June 30, 2025 increased $22.5 billion compared to $165.1 billion in revenues, excluding hedging effect, for the six months ended June 30, 2024. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar weakening relative to the British pound was largely offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Australian dollar, South Korean won, and Indian rupee. Other",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "44",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_44_chunk_1",
        "text": "Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso. Costs and Expenses 44",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "44",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_45_chunk_0",
        "text": "Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 TAC $ 13,387 $ 14,705 $ 26,333 $ 28,453 Other cost of revenues 22,120 24,334 42,886 46,947 Total cost of revenues $ 35,507 $ 39,039 $ 69,219 $ 75,400 Total cost of revenues as a percentage of revenues 42 % 41 % 42 % 40 % Cost of revenues increased $3.5 billion from the three months ended June 30, 2024 to the three months ended June 30, 2025 due to an increase in other cost of revenues and TAC of $2.2 billion and $1.3 billion, respectively. Cost of revenues increased $6.2 billion from the six months ended June 30, 2024 to the six months ended June 30, 2025 due to an increase in other cost of revenues and TAC of $4.1 billion and $2.1 billion, respectively. The increase in TAC from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 20.7% to 20.6% from the three months ended June 30, 2024 to the three months ended June 30, 2025 and decreased from 20.9% to 20.6% from the six months ended June 30, 2024 to the six months ended June 30, 2025, primarily due to a revenue mix shift from Google Network properties to Google Search & other properties partially offset by an increase in the Google Search & other TAC rate. The TAC rate on Google Search & other revenues increased from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025 primarily due to increases related to mobile searches. The TAC rate on Google Network revenues was substantially consistent from the three months ended June 30, 2024 to the three months ended June 30, 2025 and decreased from the six months ended June 30, 2024 to the six months ended June 30, 2025 due to a combination of factors, none of which were individually significant. The increase in other cost of revenues from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and certain app and platform distribution costs. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Research and development expenses $ 11,860 $ 13,808 $ 23,763 $ 27,364 Research and development expenses as a percentage of revenues 14 % 14 % 14 % 15 % R&D expenses increased $1.9 billion and $3.6 billion from the three and six months ended June 30, 2024 to the three and six months ended",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "45",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_45_chunk_1",
        "text": "June 30, 2025, primarily driven by increases in employee compensation expenses of $851 million and $1.5 billion as well as depreciation expense of $575 million and $1.1 billion, respectively. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Sales and marketing expenses $ 6,792 $ 7,101 $ 13,218 $ 13,273 Sales and marketing expenses as a percentage of revenues 8 % 7 % 8 % 7 % Sales and marketing expenses increased $309 million from the three months ended June 30, 2024 to the three months ended June 30, 2025, primarily driven by an increase in advertising and promotional activities of $305 million. 45",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "45",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. • changes in advertising quality, formats, delivery or policy; • changes in device mix; • changes in foreign currency exchange rates; • fees advertisers are willing to pay based on how they manage their advertising costs; • general economic conditions and various external dynamics, including the effect of COVID-19, geopolitical events, regulations and other measures; • seasonality; and • traffic growth in emerging markets compared to more mature markets and across various advertising verticals and channels. Google Other Google other revenues are comprised of the following: • Google Play, which includes sales of apps and in-app purchases and digital content sold in the Google Play store; • Devices and Services, which includes sales of hardware, including Fitbit wearable devices, Google Nest home products, and Pixel phones; • YouTube non-advertising, which includes YouTube Premium and YouTube TV subscriptions; and • other products and services. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which includes fees for infrastructure, platform, and other services; • Google Workspace, which includes fees for cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and • other enterprise services. Other Bets Revenues from Other Bets are generated primarily from the sale of health technology and internet services. For further details on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2021. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of these expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to the changes in revenue. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ Amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers. ◦ Amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues includes: ◦ Content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee). 35",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. Monetization Metrics Paid clicks and cost-per-click The following table presents year-over-year changes in paid clicks and cost-per-click (expressed as a percentage): Three Months Ended Nine Months Ended September 30, September 30, 2022 2022 Paid clicks change 8% 12% Cost-per-click change (5)% 1% Paid clicks increased from the three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022 driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage, primarily on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery. The increase in clicks for the three months ended September 30, 2022 was partially offset by a decrease in clicks relating to ads on Google Play. Cost-per-click decreased from the three months ended September 30, 2021 to the three months ended September 30, 2022 and increased from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 due to a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product changes, and property mix, as well as the unfavorable effect of foreign currency exchange rates. Impressions and cost-per-impression The following table presents year-over-year changes in impressions and cost-per-impression (expressed as a percentage): Three Months Ended Nine Months Ended September 30, September 30, 2022 2022 Impressions change 3% 5% Cost-per-impression change (5)% 4% Impressions increased from the three months ended September 30, 2021 to the three months ended September 30, 2022 primarily driven by growth in Google Ad Manager and AdSense, partially offset by a decline in impressions related to AdMob. The decrease in cost-per-impression from the three months ended September 30, 2021 to the three months ended September 30, 2022 was primarily driven by the unfavorable effect of foreign currency exchange rates. Impressions increased from the nine months ended September 30, 2021 to the nine months ended September 30, 2022, driven by growth across Google Ad Manager, AdMob, and AdSense. The increase in cost-per-impression from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 was driven by a number of interrelated factors including ongoing product and policy changes, improvements we have made in ad formats and delivery, changes in device mix, geographic mix, product mix, and property mix, partially offset by the unfavorable effect of foreign currency exchange rates. Google other revenues Google other revenues increased $141 million from the three months ended September 30, 2021 to the three months ended September 30, 2022 primarily driven by growth in YouTube non-advertising followed by growth in hardware revenues, partially offset by a decrease in Google Play revenues. The growth in YouTube non-advertising was largely due to an increase in paid subscribers. The growth in hardware was primarily driven by an increase in phone sales. The decrease in Google Play revenues was primarily driven by a decrease in buyer spending. Additionally, the overall increase was partially offset",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_39_chunk_1",
        "text": "by the unfavorable effect of foreign currency exchange rates. Google other revenues increased $388 million from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily driven by growth in YouTube non-advertising, partially offset by a decrease in Google Play revenues. The growth in YouTube non-advertising was largely due to an increase in paid subscribers. The decrease in Google Play revenues was primarily driven by the fee structure changes we 39",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "39",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_41_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents the foreign exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, % Change % Change from Prior from Prior 2021 2022 Year 2021 2022 Year EMEA revenues $ 19,839 $ 19,450 (2)% $ 55,954 $ 60,300 8 % EMEA constant currency revenues 22,093 11 % $ 66,210 18 % APAC revenues 11,705 11,494 (2)% $ 33,391 $ 35,045 5 % APAC constant currency revenues 12,604 8 % $ 37,510 12 % Other Americas revenues 3,688 4,138 12 % $ 9,957 $ 12,320 24 % Other Americas constant currency revenues 4,303 17 % $ 12,536 26 % United States revenues 29,824 33,372 12 % $ 83,064 $ 97,832 18 % Hedging gains (losses) 62 638 $ (54) $ 1,291 Total revenues $ 65,118 $ 69,092 6 % $ 182,312 $ 206,788 13 % Revenues, excluding hedging effect $ 65,056 $ 68,454 $ 182,366 $ 205,497 Exchange rate effect 3,918 8,591 Total constant currency revenues $ 72,372 11 % $ 214,088 17 % EMEA revenue growth from the three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Euro and British pound. APAC revenue growth from the three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth from the three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022 was unfavorably affected by the general strengthening of the U.S. dollar. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 TAC $ 11,498 $ 11,826 $ 32,139 $ 36,030 Other cost of revenues 16,123 19,332 45,812 54,831 Total cost of revenues $ 27,621 $ 31,158 $ 77,951 $ 90,861 Total cost of revenues as a percentage of revenues 42.4 % 45.1 % 42.8 % 43.9 % Cost of revenues increased $3.5 billion from the three months ended September 30, 2021 to the three months ended September 30, 2022 due to an increase in other cost of revenues and TAC of $3.2 billion and $328 million, respectively. Cost of revenues increased $12.9 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 due to increases in other cost of revenues and TAC of $9.0 billion and $3.9 billion, respectively. The increase in TAC from the three months ended September 30, 2021 to the three months ended September 30, 2022 was primarily due to increases in TAC paid to distribution partners primarily",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "41",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_41_chunk_1",
        "text": "driven by growth in revenues 41",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "41",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. subject to TAC. The increase in TAC from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 was due to increases in TAC paid to distribution partners and to Google Network partners, primarily driven by growth in revenues subject to TAC. The TAC rate increased from 21.6% to 21.7% from the three months ended September 30, 2021 to the three months ended September 30, 2022 and increased from 21.7% to 21.8% from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 due to a combination of factors, none of which were individually significant. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022. The increase in other cost of revenues from the three months ended September 30, 2021 to the three months ended September 30, 2022 was primarily due to increases in data center and other operations costs as well as hardware costs. The increase in other cost of revenues from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 was primarily due to the increases in data center and other operations costs followed by hardware costs and content acquisition costs. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Research and development expenses $ 7,694 $ 10,273 $ 22,854 $ 29,233 Research and development expenses as a percentage of revenues 11.8 % 14.9 % 12.5 % 14.1 % R&D expenses increased $2.6 billion from the three months ended September 30, 2021 to the three months ended September 30, 2022. The increase was primarily driven by an increase in compensation expenses of $1.8 billion, largely resulting from a 24% increase in headcount. R&D expenses increased $6.4 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The increase was primarily driven by an increase in compensation expenses of $4.2 billion, largely resulting from an 19% increase in headcount, and an increase in professional services fees of $619 million. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Sales and marketing expenses $ 5,516 $ 6,929 $ 15,308 $ 19,384 Sales and marketing expenses as a percentage of revenues 8.5 % 10.0 % 8.4 % 9.4 % Sales and marketing expenses increased $1.4 billion from the three months ended September 30, 2021 to the three months ended September 30, 2022. The increase was primarily driven by an increase in advertising and promotional activities of $708 million and an increase in compensation expenses of $515 million, largely resulting from a 19% increase in headcount.",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_42_chunk_1",
        "text": "Sales and marketing expenses increased $4.1 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily driven by an increase in advertising and promotional activities of $1.8 billion and an increase in compensation expenses of $1.7 billion, largely resulting from a 20% increase in headcount. 42",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "42",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_44_chunk_0",
        "text": "Table of Contents Alphabet Inc. Other Bets Other Bets operating loss increased $323 million from the three months ended September 30, 2021 to the three months ended September 30, 2022. The increase in operating loss was primarily driven by an increase in compensation expenses. Other Bets operating loss increased $621 million from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The increase in operating loss was primarily driven by increases in compensation expenses, partially offset by growth in revenues. Other Income (Expense), Net The following table presents other income (expense), net (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Other income (expense), net $ 2,033 $ (902) $ 9,503 $ (2,501) Other income (expense), net, decreased $2.9 billion from the three months ended September 30, 2021 to the three months ended September 30, 2022 primarily due to changes in gains and losses on equity and debt securities. In the three months ended September 30, 2022, $731 million of net losses were recognized on debt securities, and $492 million of net unrealized losses were recognized on non-marketable equity securities. These losses were partially offset by interest income recognized of $615 million. In the three months ended September 30, 2021, $2.2 billion of net unrealized gains were recognized on marketable and non-marketable equity securities, partially offset by $492 million of accrued performance fees related to certain investments. Other income (expense), net, decreased $12.0 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily due changes in gains and losses on equity securities and performance fees. In the nine months ended September 30, 2022, $2.5 billion of net unrealized losses were recognized on marketable equity securities and $1.9 billion of net losses were recognized on debt securities. These losses were partially offset by interest income recognized of $1.5 billion and $879 million of net unrealized gains on non-marketable equity securities. In the nine months ended September 30, 2021, $9.2 billion of net unrealized gains were recognized on marketable and non-marketable equity securities, partially offset by $1.7 billion of accrued performance fees related to certain investments. See Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Income before provision for income taxes $ 23,064 $ 16,233 $ 66,332 $ 54,181 Provision for income taxes $ 4,128 $ 2,323 $ 10,941 $ 7,833 Effective tax rate 17.9 % 14.3 % 16.5 % 14.5 % The effective tax rate decreased by 3.6 percentage points from the three months ended September 30, 2021 to the three months ended September 30, 2022.The decrease was primarily driven by a change in unrecognized tax benefits and the effects of capitalization and",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "44",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_44_chunk_1",
        "text": "amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign-Derived Intangible Income tax deduction. These decreases were partially offset by a decrease in pre-tax earnings, including in countries that have lower statutory rates and a decrease in the stock-based compensation-related tax benefit. The effective tax rate decreased by 2.0 percentage points from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The decrease was primarily driven by the effects of capitalization and amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign-Derived Intangible Income tax deduction and a change in unrecognized tax benefits. These decreases were partially offset by a decrease in pre-tax earnings, including in countries that have lower statutory rates and a decrease in the stock-based compensation-related tax benefit. 44",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "44",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users. Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users. As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity. Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been and may continue to be affected by additional factors, such as: • advertiser competition for keywords; • changes in advertising quality, formats, delivery or policy; • changes in device mix; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and • traffic growth in emerging markets compared to more mature markets and across various verticals and channels. Google Other Google other revenues are comprised of the following: • Google Play, which includes sales of apps and in-app purchases; • hardware, which includes sales of Fitbit wearable devices, Google Nest home products, and Pixel devices; • YouTube non-advertising, which includes subscription revenues from services such as YouTube Premium and YouTube TV; and • other products and services. Fluctuations in our Google other revenues have been and may continue to be affected by additional factors, such as changes in customer usage and demand, number of subscribers, and fluctuations in the timing of product launches. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which includes fees for infrastructure, platform, and other services; • Google Workspace, which includes fees for cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and • other enterprise services. Fluctuations in our Google Cloud revenues have been and may continue to be affected by additional factors, such as customer usage. Other Bets Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. 35",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_36_chunk_0",
        "text": "Table of Contents Alphabet Inc. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ Amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers. ◦ Amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues includes: ◦ Content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee). ◦ Expenses associated with our data centers (including bandwidth, compensation expenses, depreciation, energy, and other equipment costs) as well as other operations costs (such as content review as well as customer and product support costs). ◦ Inventory and other costs related to the hardware we sell. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net Other income (expense), net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional details, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II, Item 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-K for 36",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "36",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. Paid clicks increased from the three months ended September 30, 2022 to the three months ended September 30, 2023 driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and ongoing product and policy changes. Cost-per-click increased from the three months ended September 30, 2022 to the three months ended September 30, 2023 driven by a number of interrelated factors, including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, and property mix. Paid clicks increased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 driven by a number of interrelated factors, including an increase in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and ongoing product and policy changes. Cost-per-click decreased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023, driven by a number of interrelated factors, including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, and property mix, as well as by the adverse effect of changes in foreign currency exchange rates for the nine months ended September 30, 2023, particularly during the first six months of the year. Impressions and cost-per-impression The following table presents year-over-year changes in impressions and cost-per-impression (expressed as a percentage): Three Months Ended Nine Months Ended September 30, September 30, 2023 2023 Impressions change (3)% (2)% Cost-per-impression change 1% (3)% Impressions decreased from the three months ended September 30, 2022 to the three months ended September 30, 2023, driven by decreases in Google Ad Manager and AdSense, partially offset by an increase in AdMob. The increase in cost-per-impression from the three months ended September 30, 2022 to the three months ended September 30, 2023 was driven by a number of interrelated factors, including ongoing product and policy changes, changes in device mix, geographic mix, product mix, and property mix. Impressions decreased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023, driven by decreases in Google Ad Manager and AdSense, partially offset by an increase in AdMob. The decrease in cost-per-impression from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 was driven by a number of interrelated factors, including ongoing product and policy changes, changes in device mix, geographic mix, product mix, and property mix, as well as the adverse effect of changes in foreign currency exchange rates for the nine months ended September 30, 2023, particularly during the first six months of the year. Google other revenues Google other revenues increased $1.4 billion and $3.6 billion from the three and nine months ended September 30, 2022 to the three and nine months ended September 30, 2023, primarily driven by growth in YouTube non-advertising, largely due to an increase in paid subscribers. Growth was",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_40_chunk_1",
        "text": "adversely affected by changes in foreign currency exchange rates for the nine months ended September 30, 2023, particularly during the first six months of the year. Google Cloud Google Cloud revenues increased $1.5 billion and $4.9 billion from the three and nine months ended September 30, 2022 to the three and nine months ended September 30, 2023, respectively. Growth was primarily driven by Google Cloud Platform followed by Google Workspace offerings. Google Cloud's infrastructure and platform services were the largest drivers of growth in Google Cloud Platform. 40",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended September 30, 2023 % Change from Prior Period Three Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 33,372 $ 36,354 $ 0 $ 36,354 9 % 0 % 9 % EMEA 19,450 22,661 803 21,858 17 % 5 % 12 % APAC 11,494 13,126 (270) 13,396 14 % (3) % 17 % Other Americas 4,138 4,553 (106) 4,659 10 % (3) % 13 % Revenues, excluding hedging effect 68,454 76,694 427 76,267 12 % 1 % 11 % Hedging gains (losses) 638 (1) Total revenues(1) $ 69,092 $ 76,693 $ 76,267 11 % (1) % 1 % 11 % (1) Total constant currency revenues of $76.3 billion for the three months ended September 30, 2023 increased $7.8 billion compared to $68.5 billion in revenues, excluding hedging effect, for the three months ended September 30, 2022. EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Euro and to a lesser extent the British pound, partially offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Nine Months Ended September 30, 2023 % Change from Prior Period Nine Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 97,832 $ 104,291 $ 0 $ 104,291 7 % 0 % 7 % EMEA 60,300 66,028 (645) 66,673 9 % (2) % 11 % APAC 35,045 37,535 (1,669) 39,204 7 % (5) % 12 % Other Americas 12,320 13,144 (579) 13,723 7 % (4) % 11 % Revenues, excluding hedging effect 205,497 220,998 (2,893) 223,891 8 % (1) % 9 % Hedging gains (losses) 1,291 86 Total revenues(1) $ 206,788 $ 221,084 $ 223,891 7 % (1) % (1) % 9 % (1) Total constant currency revenues of $223.9 billion for the nine months ended September 30, 2023 increased $18.4 billion compared to $205.5 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Turkish lira and the British pound, partially offset by the U.S. dollar weakening relative to the Euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_42_chunk_1",
        "text": "was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. 42",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "42",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_43_chunk_0",
        "text": "Table of Contents Alphabet Inc. Costs and Expenses Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 TAC $ 11,826 $ 12,642 $ 36,030 $ 36,900 Other cost of revenues 19,332 20,587 54,831 58,857 Total cost of revenues $ 31,158 $ 33,229 $ 90,861 $ 95,757 Total cost of revenues as a percentage of revenues 45 % 43 % 44 % 43 % Cost of revenues increased $2.1 billion from the three months ended September 30, 2022 to the three months ended September 30, 2023 due to an increase in other cost of revenues and TAC of $1.3 billion and $816 million, respectively. Cost of revenues increased $4.9 billion from the nine months ended September 30, 2022 to the nine months ended September 30, 2023, due to an increase in other cost of revenues and TAC of $4.0 billion and $870 million, respectively. The increase in TAC from the three and nine months ended September 30, 2022 to the three and nine months ended September 30, 2023 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.7% to 21.2% from the three months ended September 30, 2022 to the three months ended September 30, 2023 and decreased from 21.8% to 21.4% from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from the three and nine months ended September 30, 2022 to the three and nine months ended September 30, 2023. The increase in other cost of revenues from the three months ended September 30, 2022 to the three months ended September 30, 2023 was primarily due to increases in content acquisition costs, largely for YouTube. In addition, an overall increase in data center and other operations costs was partially offset by a reduction in depreciation expense due to the change in the estimated useful lives of our servers and certain network equipment. The increase in other cost of revenues from the nine months ended September 30, 2022 to the nine months ended September 30, 2023 was primarily due to increases in content acquisition costs, largely for YouTube, and data center and other operations costs. The overall increase in data center and other operations costs includes $723 million of charges related to employee severance associated with the reduction of our workforce and our office space optimization efforts, partially offset by a reduction in depreciation expense due to the change in the estimated useful lives of our servers and certain network equipment. Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended Nine",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "43",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_43_chunk_1",
        "text": "Months Ended September 30, September 30, 2022 2023 2022 2023 Research and development expenses $ 10,273 $ 11,258 $ 29,233 $ 33,314 Research and development expenses as a percentage of revenues 15 % 15 % 14 % 15 % R&D expenses increased $985 million from the three months ended September 30, 2022 to the three months ended September 30, 2023, primarily driven by increases in compensation expenses of $375 million and depreciation of $223 million. The $375 million increase in compensation expenses was largely due to an increase in stock-based compensation. The $223 million increase in depreciation includes the benefit of the change in the estimated useful lives of our servers and network equipment. R&D expenses increased $4.1 billion from the nine months ended September 30, 2022 to the nine months ended September 30, 2023, primarily driven by increases in compensation expenses of $2.4 billion and depreciation of $517 million. The $2.4 billion increase in compensation expenses was the result of a 6% increase in average headcount, after adjusting for roles affected by the reduction in workforce, $847 million in employee severance charges associated with the reduction of our workforce, and an increase in stock-based compensation. The $517 43",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "43",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_35_chunk_0",
        "text": "Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in compensation expenses may not directly correlate with changes in headcount, in particular due to annual SBC awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ compensation expense related to our technical infrastructure and other operations such as content review and customer and product support; ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee); ◦ depreciation expense related to our technical infrastructure; ◦ inventory and other costs related to the devices we sell; and ◦ other technical infrastructure operations costs, including bandwidth, energy, and equipment costs. TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners. Operating Expenses Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; • depreciation; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spending relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal matters, including certain fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. 35",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_40_chunk_0",
        "text": "The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended September 30, 2024 % Change from Prior Period Three Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 36,354 $ 43,139 $ 0 $ 43,139 19 % 0 % 19 % EMEA 22,661 25,472 (146) 25,618 12 % (1) % 13 % APAC 13,126 14,547 (285) 14,832 11 % (2) % 13 % Other Americas 4,553 5,093 (586) 5,679 12 % (13) % 25 % Revenues, excluding hedging effect 76,694 88,251 (1,017) 89,268 15 % (1) % 16 % Hedging gains (losses) (1) 17 Total revenues(1) $ 76,693 $ 88,268 $ 89,268 15 % 0 % (1) % 16 % (1) Total constant currency revenues of $89.3 billion for the three months ended September 30, 2024 increased $12.6 billion compared to $76.7 billion in revenues, excluding hedging effect, for the three months ended September 30, 2023. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso and the Brazilian real. Nine Months Ended September 30, 2024 % Change from Prior Period Nine Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 104,291 $ 123,072 $ 0 $ 123,072 18 % 0 % 18 % EMEA 66,028 73,943 (309) 74,252 12 % 0 % 12 % APAC 37,535 41,659 (1,319) 42,978 11 % (4) % 15 % Other Americas 13,144 14,684 (1,043) 15,727 12 % (8) % 20 % Revenues, excluding hedging effect 220,998 253,358 (2,671) 256,029 15 % (1) % 16 % Hedging gains (losses) 86 191 Total revenues(1) $ 221,084 $ 253,549 $ 256,029 15 % 0 % (1) % 16 % (1) Total constant currency revenues of $256.0 billion for the nine months ended September 30, 2024 increased $35.0 billion compared to $221.1 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2023. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar strengthening relative to the Turkish lira was largely offset by the U.S. dollar weakening relative to the British pound. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_40_chunk_1",
        "text": "Argentine peso. Costs and Expenses 40",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_41_chunk_0",
        "text": "Cost of Revenues The following table presents cost of revenues, including TAC (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 TAC $ 12,642 $ 13,719 $ 36,900 $ 40,052 Other cost of revenues 20,587 22,755 58,857 65,641 Total cost of revenues $ 33,229 $ 36,474 $ 95,757 $ 105,693 Total cost of revenues as a percentage of revenues 43 % 41 % 43 % 42 % Cost of revenues increased $3.2 billion from the three months ended September 30, 2023 to the three months ended September 30, 2024 due to an increase in other cost of revenues and TAC of $2.2 billion and $1.1 billion, respectively. Cost of revenues increased $9.9 billion from the nine months ended September 30, 2023 to the nine months ended September 30, 2024 due to an increase in other cost of revenues and TAC of $6.8 billion and $3.2 billion, respectively. The increase in TAC from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.2% to 20.8% from the three months ended September 30, 2023 to the three months ended September 30, 2024 and decreased from 21.4% to 20.8% from the nine months ended September 30, 2023 to the nine months ended September 30, 2024, primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues increased from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024 primarily due to increases related to mobile searches, which carries higher TAC because more mobile searches are channeled through paid access points. The TAC rate on Google Network revenues was substantially consistent from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024. The increase in other cost of revenues from the three months ended September 30, 2023 to the three months ended September 30, 2024 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and devices costs, due to Pixel family product launch timing in the third quarter this year as compared to the fourth quarter last year. The increase in other cost of revenues from the nine months ended September 30, 2023 to the nine months ended September 30, 2024 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, other technical infrastructure operations costs, and third-party service fees. Additionally, devices costs contributed to the increase in other cost of revenues due to the Pixel family product launch timing in the third quarter this year as compared to the fourth quarter last year. Research and Development The following table presents R&D expenses (in millions, except percentages):",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "41",
            "chunk_index": 0,
            "page_section": "mdna"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_41_chunk_1",
        "text": "Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Research and development expenses $ 11,258 $ 12,447 $ 33,314 $ 36,210 Research and development expenses as a percentage of revenues 15 % 14 % 15 % 14 % R&D expenses increased $1.2 billion from the three months ended September 30, 2023 to the three months ended September 30, 2024, primarily driven by increases in compensation expenses of $358 million, depreciation expense of $353 million, and charges related to our office space optimization efforts of $188 million. The increase in compensation expenses was largely due to an increase in SBC expense of $214 million. R&D expenses increased $2.9 billion from the nine months ended September 30, 2023 to the nine months ended September 30, 2024, primarily driven by increases in depreciation expense of $993 million, compensation expenses of $879 million, and third-party services fees of $597 million. The increase in compensation expenses was primarily driven by a $1.0 billion increase in SBC expenses, which reflects the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period, partially offset by a $554 million decrease in severance and related charges. 41",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "41",
            "chunk_index": 1,
            "page_section": "mdna"
        }
    }
]