[
    {
        "id": "goog-10-k-2023-final.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. Google Subscriptions, Platforms, and Devices Google subscriptions, platforms, and devices revenues are comprised of the following: • consumer subscriptions, which primarily include revenues from YouTube services, such YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One; • platforms, which primarily include revenues from Google Play from the sales of apps and in-app purchases; • devices, which primarily include sales of the Pixel family of devices; and • other products and services. Fluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and fluctuations in the timing of product launches. Google Cloud Google Cloud revenues are comprised of the following: • Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as cybersecurity, databases, analytics, and AI offerings including our AI infrastructure, Vertex AI platform, and Duet AI for Google Cloud; • Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Duet AI in Google Workspace; and • other enterprise services. Fluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as customer usage. Other Bets Revenues from Other Bets are generated primarily from the sale of healthcare-related services and internet services. Costs and Expenses Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in compensation expenses may not directly correlate with changes in headcount, in particular due to annual stock-based compensation (SBC) awards that generally vest over four years. Cost of Revenues Cost of revenues is comprised of TAC and other costs of revenues. • TAC includes: ◦ amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and ◦ amounts paid to Google Network partners primarily for ads displayed on their properties. • Other cost of revenues primarily includes: ◦ compensation expense related to our data centers and other operations such as content review and customer and product support; ◦ content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee); ◦ depreciation expense related to our technical infrastructure; and ◦",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "33",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_33_chunk_1",
        "text": "inventory and other costs related to the devices we sell. 32.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "33",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Year Ended December 31, 2022 2023 General and administrative expenses $ 15,724 $ 16,425 General and administrative expenses as a percentage of revenues 6 % 5 % General and administrative expenses increased $701 million from 2022 to 2023, primarily driven by an increase in compensation expenses of $416 million, which was largely the result of $264 million in employee severance charges associated with the reduction in our workforce in addition to a combination of other factors, none of which were individually significant. Segment Profitability The following table presents segment operating income (loss) (in millions). Year Ended December 31, 2022 2023 Operating income (loss): Google Services $ 82,699 $ 95,858 Google Cloud (1,922) 1,716 Other Bets (4,636) (4,095) Alphabet-level activities(1) (1,299) (9,186) Total income from operations $ 74,842 $ 84,293 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $2.0 billion and $236 million in 2022 and 2023, respectively. For the year ended December 31, 2023, Alphabet-level activities include charges related to the reduction in force and our office space optimization efforts totaling $3.9 billion. In addition, for the year ended December 31, 2023, we incurred $269 million in accelerated rent and accelerated depreciation. For additional information relating to our workforce reduction and other initiatives, see Note 8 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. For additional information relating to our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Google Services Google Services operating income increased $13.2 billion from 2022 to 2023. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in content acquisition costs and compensation expenses including an increase in SBC expense. Additionally, operating income benefited from a reduction in costs driven by the change in the estimated useful lives of our servers and certain network equipment. Google Cloud Google Cloud operating income of $1.7 billion for 2023 compared to an operating loss of $1.9 billion for 2022 represents an increase of $3.6 billion. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in compensation expenses largely driven by headcount growth. Additionally, operating income benefited from a reduction in costs driven by the change in the estimated useful lives of our servers and certain network equipment. Other Bets Other Bets operating loss decreased $541 million from 2022 to 2023 primarily due to growth in revenues as well as a reduction in valuation-based compensation liabilities related to Other Bet companies. Other Income (Expense), Net The following table presents OI&E, (in millions): 39.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_87_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 15. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, devices, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket; the sale of apps and in-app purchases and devices. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues primarily from consumption-based fees and subscriptions received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of healthcare-related services and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet-level activities instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. Prior periods have been recast to conform to the current presentation. As announced on April 20, 2023, we brought together part of Google Research (the Brain team) and DeepMind to significantly accelerate our progress in artificial intelligence (AI). The group, called Google DeepMind, is reported within Alphabet-level activities prospectively beginning in the second quarter of 2023. Previously, the Brain team was included within Google Services. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with reductions in our workforce and office space during 2023 were not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Year Ended December 31, 2021 2022 2023 Revenues: Google Services $ 237,529 $ 253,528 $ 272,543 Google Cloud 19,206 26,280 33,088 Other Bets 753 1,068 1,527 Hedging gains (losses) 149 1,960 236 Total revenues $ 257,637 $ 282,836 $ 307,394 Operating income (loss):",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "87",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_87_chunk_1",
        "text": "Google Services $ 88,132 $ 82,699 $ 95,858 Google Cloud (2,282) (1,922) 1,716 Other Bets (4,051) (4,636) (4,095) Alphabet-level activities (3,085) (1,299) (9,186) Total income from operations $ 78,714 $ 74,842 $ 84,293 See Note 2 for information relating to revenues by geography. 86.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "87",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. • seasonality. Additionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources (\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to be, affected by other factors unique to each set of revenues, as described below. Google Services Google Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues. Google Advertising Google advertising revenues are comprised of the following: • Google Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play; • YouTube ads, which includes revenues generated on YouTube properties; and • Google Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager. We use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties. Paid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost- per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users. Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users. As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity. Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as: • advertiser competition for keywords; • changes in advertising quality, formats, delivery or policy; • changes in device mix; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and • traffic growth in emerging markets compared to more mature markets and across various verticals and channels. Google subscriptions, platforms, and devices Google subscriptions, platforms, and devices revenues are comprised of the following: • consumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "33",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_33_chunk_1",
        "text": "Google One; • platforms, which primarily include revenues from Google Play sales of apps and in-app purchases; • devices, which primarily include sales of the Pixel family of devices; and • other products and services. 32.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "33",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. Year Ended December 31, 2023 2024 Research and development expenses $ 45,427 $ 49,326 Research and development expenses as a percentage of revenues 15 % 14 % R&D expenses increased $3.9 billion from 2023 to 2024, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $1.4 billion, and third-party services fees of $698 million, partially offset by a reduction in charges related to our office space optimization efforts of $640 million. The increase in employee compensation expenses was primarily driven by a $1.3 billion increase in SBC expenses, which includes the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period, partially offset by a $537 million decrease in severance and related charges. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Year Ended December 31, 2023 2024 Sales and marketing expenses $ 27,917 $ 27,808 Sales and marketing expenses as a percentage of revenues 9 % 8 % Sales and marketing expenses decreased $109 million from 2023 to 2024, due to a combination of factors, none of which were individually significant. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Year Ended December 31, 2023 2024 General and administrative expenses $ 16,425 $ 14,188 General and administrative expenses as a percentage of revenues 5 % 4 % General and administrative expenses decreased $2.2 billion from 2023 to 2024, primarily driven by a reduction in charges related to legal and other matters of $1.3 billion and a decrease in employee compensation expenses of $285 million, primarily due to a decrease in average headcount, in addition to a combination of factors, none of which were individually significant. Segment Profitability We report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, see Part I, Item 1 Business and Note 15 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. The following table presents segment operating income (loss) (in millions). Year Ended December 31, 2023 2024 Operating income (loss): Google Services $ 95,858 $ 121,263 Google Cloud 1,716 6,112 Other Bets (4,095) (4,444) Alphabet-level activities(1) (9,186) (10,541) Total income from operations $ 84,293 $ 112,390 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $236 million and $211 million in 2023 and 2024, respectively. For the years ended December 31, 2023 and 2024, Alphabet-level activities included substantially all of the charges related to employee severance and our office space charges. 39.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_89_chunk_0",
        "text": "Table of Contents Alphabet Inc. As announced in April 2024, we consolidated teams that focus on building general AI models across Google Research and Google DeepMind to further accelerate our progress in AI. General AI model development teams previously under Google Research in our Google Services segment are reported within Alphabet-level activities prospectively beginning in the second quarter of 2024. As further announced, in October 2024, the Gemini app team that is developing the direct consumer interface to our Gemini models joined Google DeepMind. The costs associated with the Gemini app team continue to be reported within our Google Services segment. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information. The following table presents revenue, profitability, and expense information about our segments (in millions): Year Ended December 31, 2022 2023 2024 Revenues: Google Services $ 253,528 $ 272,543 $ 304,930 Google Cloud 26,280 33,088 43,229 Other Bets 1,068 1,527 1,648 Hedging gains (losses) 1,960 236 211 Total revenues $ 282,836 $ 307,394 $ 350,018 Operating income (loss): Google Services $ 82,699 $ 95,858 $ 121,263 Google Cloud (1,922) 1,716 6,112 Other Bets (4,636) (4,095) (4,444) Alphabet-level activities (1,299) (9,186) (10,541) Total income from operations $ 74,842 $ 84,293 $ 112,390 Supplemental information about our segment expenses: Google Services: Employee compensation expenses $ 43,529 $ 46,224 $ 44,560 Other costs and expenses 127,300 130,461 139,107 Total Google Services costs and expenses $ 170,829 $ 176,685 $ 183,667 Google Cloud: Employee compensation expenses $ 16,132 $ 19,054 $ 20,519 Other costs and expenses 12,070 12,318 16,598 Total Google Cloud costs and expenses $ 28,202 $ 31,372 $ 37,117 Google Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs. See Note 2 for information relating to revenues by geography. 88.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "89",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_28_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 13. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended March 31, 2021 2022 Income before provision for income taxes $ 21,283 $ 18,934 Provision for income taxes $ 3,353 $ 2,498 Effective tax rate 15.8 % 13.2 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. Total gross unrecognized tax benefits were $5.2 billion and $5.4 billion as of December 31, 2021 and March 31, 2022, respectively. Total unrecognized tax benefits that, if recognized, would affect our effective tax rate were $3.7 billion and $3.9 billion as of December 31, 2021 and March 31, 2022, respectively. For information regarding non-income taxes, see Note 9. Note 14. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, digital content products, and hardware; and fees received for subscription- based products such as YouTube Premium and YouTube TV. • Google Cloud includes Google’s infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. The associated costs, including depreciation and impairment, are allocated to operating segments as a service cost generally based on usage or headcount. Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs. Our operating segments are not evaluated using asset information. The following table presents information about segments (in millions): Three Months Ended March 31, 2021 2022 Revenues: Google Services $ 51,178 $ 61,472 Google Cloud 4,047 5,821 Other Bets 198 440 Hedging gains (losses) (109) 278 Total revenues $ 55,314 $ 68,011 28",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "28",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_29_chunk_0",
        "text": "Table of Contents Alphabet Inc. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet's unallocated corporate costs instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. After the segment reporting changes discussed above, unallocated corporate costs primarily include AI- focused shared R&D activities; corporate initiatives such as our philanthropic activities; and corporate shared costs such as finance, certain human resource costs, and legal, including certain fines and settlements. In the first quarter of 2023, unallocated corporate costs also include charges associated with reductions in our workforce and office space. Additionally, hedging gains (losses) related to revenue are included in unallocated corporate costs. Prior periods have been recast to conform to the current presentation. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended March 31, 2022 2023 Revenues: Google Services $ 61,472 $ 61,961 Google Cloud 5,821 7,454 Other Bets 440 288 Hedging gains (losses) 278 84 Total revenues $ 68,011 $ 69,787 Three Months Ended March 31, 2022 2023 Operating income (loss): Google Services $ 21,973 $ 21,737 Google Cloud (706) 191 Other Bets (835) (1,225) Corporate costs, unallocated (338) (3,288) Total income from operations $ 20,094 $ 17,415 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2022 March 31, 2023 Long-lived assets: United States $ 93,565 $ 96,519 International 33,484 35,488 Total long-lived assets $ 127,049 $ 132,007 29",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "29",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_27_chunk_0",
        "text": "Stock-Based Award Activities The following table summarizes the activities for unvested Alphabet restricted stock units (RSUs) for the three months ended March 31, 2024 (in millions, except per share amounts): Weighted- Average Number of Grant-Date Shares Fair Value Unvested as of December 31, 2023 338 $ 104.93 Granted 159 $ 133.43 Vested (49) $ 107.61 Forfeited/canceled (8) $ 106.64 Unvested as of March 31, 2024 440 $ 114.91 As of March 31, 2024, there was $48.7 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.9 years. Note 12. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended March 31, 2023 2024 Income before provision for income taxes $ 18,205 $ 28,315 Provision for income taxes $ 3,154 $ 4,653 Effective tax rate 17.3 % 16.4 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $9.4 billion and $10.2 billion, of which $7.4 billion and $8.1 billion, if recognized, would affect our effective tax rate, as of December 31, 2023 and March 31, 2024, respectively. Note 13. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, devices, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One; the sale of apps and in-app purchases and devices. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues primarily from consumption-based fees and subscriptions received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of healthcare-related services and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "27",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_27_chunk_1",
        "text": "and settlements. Charges associated with employee severance and office space reductions during 2023 and employee severance in the first quarter of 2024, were not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. 27",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "27",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_28_chunk_0",
        "text": "The following table presents information about our segments (in millions): Three Months Ended March 31, 2023 2024 Revenues: Google Services $ 61,961 $ 70,398 Google Cloud 7,454 9,574 Other Bets 288 495 Hedging gains (losses) 84 72 Total revenues $ 69,787 $ 80,539 Three Months Ended March 31, 2023 2024 Operating income (loss): Google Services $ 21,737 $ 27,897 Google Cloud 191 900 Other Bets (1,225) (1,020) Alphabet-level activities (3,288) (2,305) Total income from operations $ 17,415 $ 25,472 See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2023 March 31, 2024 Long-lived assets: United States $ 110,053 $ 117,085 International 38,383 39,865 Total long-lived assets $ 148,436 $ 156,950 28",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "28",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_37_chunk_0",
        "text": "largely the result of a reduction in employee severance and related charges of $228 million, partially offset by a combination of factors, none of which were individually significant. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended March 31, 2023 2024 General and administrative expenses $ 3,759 $ 3,026 General and administrative expenses as a percentage of revenues 5 % 4 % General and administrative expenses decreased $733 million from the three months ended March 31, 2023 to the three months ended March 31, 2024, primarily driven by a reduction in charges related to legal matters of $248 million and a combination of factors, none of which were individually significant. Segment Profitability The following table presents segment operating income (loss) (in millions): Three Months Ended March 31, 2023 2024 Operating income (loss): Google Services $ 21,737 $ 27,897 Google Cloud 191 900 Other Bets (1,225) (1,020) Alphabet-level activities(1) (3,288) (2,305) Total income from operations $ 17,415 $ 25,472 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $84 million and $72 million for the three months ended March 31, 2023 and 2024, respectively. For the three months ended March 31, 2023 and 2024, Alphabet-level activities included substantially all of the charges related to employee severance and our office space optimization efforts. For additional information relating to our segments, see Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Google Services Google Services operating income increased $6.2 billion from the three months ended March 31, 2023 to the three months ended March 31, 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in TAC and content acquisition costs. Additionally, a reduction in compensation expenses contributed to the increase in operating income. Google Cloud Google Cloud operating income increased $709 million from the three months ended March 31, 2023 to the three months ended March 31, 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in compensation expenses, largely driven by headcount growth, and usage costs for technical infrastructure assets. Other Bets Other Bets operating loss decreased $205 million from the three months ended March 31, 2023 to the three months ended March 31, 2024 primarily due to growth in revenues. 37",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "37",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_31_chunk_0",
        "text": "Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions are also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information. The following table presents revenue, profitability, and expense information about our segments (in millions): Three Months Ended March 31, 2024 2025 Revenues: Google Services $ 70,398 $ 77,264 Google Cloud 9,574 12,260 Other Bets 495 450 Hedging gains (losses) 72 260 Total revenues $ 80,539 $ 90,234 Operating income (loss): Google Services $ 27,897 $ 32,682 Google Cloud 900 2,177 Other Bets (1,020) (1,226) Alphabet-level activities (2,305) (3,027) Total income from operations $ 25,472 $ 30,606 Supplemental information about segment expenses: Google Services: Employee compensation expenses $ 11,511 $ 11,337 Other costs and expenses 30,990 33,245 Total Google Services costs and expenses $ 42,501 $ 44,582 Google Cloud: Employee compensation expenses $ 5,157 $ 5,412 Other costs and expenses 3,517 4,671 Total Google Cloud costs and expenses $ 8,674 $ 10,083 Google Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs. See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2024 March 31, 2025 Long-lived assets: United States $ 138,993 $ 149,304 International 45,631 49,480 Total long-lived assets $ 184,624 $ 198,784 31",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "31",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_40_chunk_0",
        "text": "Research and Development The following table presents R&D expenses (in millions, except percentages): Three Months Ended March 31, 2024 2025 Research and development expenses $ 11,903 $ 13,556 Research and development expenses as a percentage of revenues 15 % 15 % R&D expenses increased $1.7 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025, primarily driven by increases in employee compensation expenses of $697 million and depreciation expense of $491 million. Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended March 31, 2024 2025 Sales and marketing expenses $ 6,426 $ 6,172 Sales and marketing expenses as a percentage of revenues 8 % 7 % Sales and marketing expenses decreased $254 million from the three months ended March 31, 2024 to the three months ended March 31, 2025 primarily driven by a decrease in employee compensation expenses of $307 million. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended March 31, 2024 2025 General and administrative expenses $ 3,026 $ 3,539 General and administrative expenses as a percentage of revenues 4 % 4 % General and administrative expenses increased $513 million from the three months ended March 31, 2024 to the three months ended March 31, 2025, primarily driven by an increase in charges related to legal and other matters of $292 million and a combination of other factors, none of which were individually significant. Segment Profitability We report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. 40",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_31_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 13. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Income before provision for income taxes $ 21,985 $ 19,014 $ 43,268 $ 37,948 Provision for income taxes $ 3,460 $ 3,012 $ 6,813 $ 5,510 Effective tax rate 15.7 % 15.8 % 15.7 % 14.5 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. Total gross unrecognized tax benefits were $5.2 billion and $5.8 billion as of December 31, 2021 and June 30, 2022, respectively. Total unrecognized tax benefits that, if recognized, would affect our effective tax rate were $3.7 billion and $4.2 billion as of December 31, 2021 and June 30, 2022, respectively. For information regarding non-income taxes, see Note 9. Note 14. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, digital content products, and hardware; and fees received for subscription- based products such as YouTube Premium and YouTube TV. • Google Cloud includes Google’s infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. The associated costs, including depreciation and impairment, are allocated to operating segments as a service cost generally based on usage or headcount. Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Revenues: Google Services $ 57,067 $ 62,841 $ 108,245 $ 124,313 Google Cloud 4,628 6,276 8,675 12,097 Other Bets 192 193 390 633 Hedging gains (losses) (7) 375 (116) 653 Total revenues $ 61,880 $ 69,685 $ 117,194 $ 137,696 31",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "31",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_31_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of June 30, 2023, there was $43.6 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.8 years. Note 13. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Income before provision for income taxes $ 19,014 $ 21,903 $ 37,948 $ 40,108 Provision for income taxes $ 3,012 $ 3,535 $ 5,510 $ 6,689 Effective tax rate 15.8 % 16.1 % 14.5 % 16.7 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $7.1 billion and $8.8 billion as of December 31, 2022 and June 30, 2023, respectively, of which $5.3 billion and $6.7 billion, if recognized, would affect our effective tax rate, respectively. Note 14. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, and hardware; and fees received for subscription-based products such as YouTube Premium and YouTube TV. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet's unallocated corporate costs instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. Prior periods have been recast to conform to the current presentation. As announced on April 20, 2023, we brought together part of Google Research (the Brain team) and DeepMind to significantly accelerate our progress in artificial intelligence (AI). The group, called Google DeepMind, is reported within Alphabet's unallocated corporate",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "31",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_31_chunk_1",
        "text": "costs prospectively beginning in the second quarter of 2023. Previously, the Brain team was included within Google Services. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with reductions in our workforce and office space announced in January 2023 are not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. 31",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "31",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Revenues: Google Services $ 62,841 $ 66,285 $ 124,313 $ 128,246 Google Cloud 6,276 8,031 12,097 15,485 Other Bets 193 285 633 573 Hedging gains (losses) 375 3 653 87 Total revenues $ 69,685 $ 74,604 $ 137,696 $ 144,391 Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Operating income (loss): Google Services $ 21,621 $ 23,454 $ 43,594 $ 45,191 Google Cloud (590) 395 (1,296) 586 Other Bets (1,339) (813) (2,174) (2,038) Corporate costs, unallocated (239) (1,198) (577) (4,486) Total income from operations $ 19,453 $ 21,838 $ 39,547 $ 39,253 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2022 June 30, 2023 Long-lived assets: United States $ 93,565 $ 99,714 International 33,484 35,963 Total long-lived assets $ 127,049 $ 135,677 32",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_32_chunk_0",
        "text": "managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. As announced on April 18, 2024, we further consolidated teams that focus on building AI models across Google Research and Google DeepMind to further accelerate our progress in AI. AI model development teams previously under Google Research in our Google Services segment are included as part of Google DeepMind, reported within Alphabet-level activities, prospectively beginning in the second quarter of 2024. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and employee severance in 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Revenues: Google Services $ 66,285 $ 73,928 $ 128,246 $ 144,326 Google Cloud 8,031 10,347 15,485 19,921 Other Bets 285 365 573 860 Hedging gains (losses) 3 102 87 174 Total revenues $ 74,604 $ 84,742 $ 144,391 $ 165,281 Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,454 $ 29,674 $ 45,191 $ 57,571 Google Cloud 395 1,172 586 2,072 Other Bets (813) (1,134) (2,038) (2,154) Alphabet-level activities (1,198) (2,287) (4,486) (4,592) Total income from operations $ 21,838 $ 27,425 $ 39,253 $ 52,897 See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2023 June 30, 2024 Long-lived assets: United States $ 110,053 $ 122,463 International 38,383 42,298 Total long-lived assets $ 148,436 $ 164,761 32",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_42_chunk_0",
        "text": "Segment Profitability The following table presents segment operating income (loss) (in millions): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,454 $ 29,674 $ 45,191 $ 57,571 Google Cloud 395 1,172 586 2,072 Other Bets (813) (1,134) (2,038) (2,154) Alphabet-level activities(1) (1,198) (2,287) (4,486) (4,592) Total income from operations $ 21,838 $ 27,425 $ 39,253 $ 52,897 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $3 million and $102 million for the three months ended June 30, 2023 and 2024, respectively, and $87 million and $174 million for the six months ended June 30, 2023 and 2024, respectively. For the three and six months ended June 30, 2023 and 2024, Alphabet-level activities included substantially all of the charges related to employee severance and our office space optimization efforts. For additional information relating to our segments, see Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Google Services Google Services operating income increased $6.2 billion from the three months ended June 30, 2023 to the three months ended June 30, 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in content acquisition costs and TAC. Additionally, a reduction in compensation expenses contributed to the increase in operating income. Google Services operating income increased $12.4 billion from the six months ended June 30, 2023 to the six months ended June 30, 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in TAC and content acquisition costs. Additionally, a reduction in compensation expenses contributed to the increase in operating income. Google Cloud Google Cloud operating income increased $777 million and $1.5 billion from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure assets as well as compensation expenses, largely driven by headcount growth. Other Bets Other Bets operating loss increased $321 million and $116 million from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024, respectively. The increase in operating loss was primarily due to an increase in compensation expenses as a result of the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period. Additionally, growth in revenues partially offset the increase in operating loss from the six months ended June 30, 2023 to the six months ended June 30, 2024. 42",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_35_chunk_0",
        "text": "• Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare- related services and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions are also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information. The following table presents revenue, profitability, and expense information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Revenues: Google Services $ 73,928 $ 82,543 $ 144,326 $ 159,807 Google Cloud 10,347 13,624 19,921 25,884 Other Bets 365 373 860 823 Hedging gains (losses) 102 (112) 174 148 Total revenues $ 84,742 $ 96,428 $ 165,281 $ 186,662 Operating income (loss): Google Services $ 29,674 $ 33,063 $ 57,571 $ 65,745 Google Cloud 1,172 2,826 2,072 5,003 Other Bets (1,134) (1,246) (2,154) (2,472) Alphabet-level activities (2,287) (3,372) (4,592) (6,399) Total income from operations $ 27,425 $ 31,271 $ 52,897 $ 61,877 Supplemental information about segment expenses: Google Services: Employee compensation expenses $ 11,240 $ 11,306 $ 22,751 $ 22,643 Other costs and expenses 33,014 38,174 64,004 71,419 Total Google Services costs and expenses $ 44,254 $ 49,480 $ 86,755 $ 94,062 Google Cloud: Employee compensation expenses $ 5,175 $ 5,517 $ 10,332 $ 10,929 Other costs and expenses 4,000 5,281 7,517 9,952 Total Google Cloud costs and expenses $ 9,175 $ 10,798 $ 17,849 $ 20,881 35",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_46_chunk_0",
        "text": "Sales and marketing expenses increased $55 million from the six months ended June 30, 2024 to the six months ended June 30, 2025, primarily driven by an increase in advertising and promotional activities of $361 million, partially offset by a decrease in employee compensation expenses of $314 million. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 General and administrative expenses $ 3,158 $ 5,209 $ 6,184 $ 8,748 General and administrative expenses as a percentage of revenues 4 % 5 % 4 % 5 % General and administrative expenses increased $2.1 billion and $2.6 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $2.3 billion and $2.6 billion, respectively, largely due to a settlement in principle of certain legal matters. Segment Profitability We report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. The following table presents segment operating income (loss) (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Operating income (loss): Google Services $ 29,674 $ 33,063 $ 57,571 $ 65,745 Google Cloud 1,172 2,826 2,072 5,003 Other Bets (1,134) (1,246) (2,154) (2,472) Alphabet-level activities(1) (2,287) (3,372) (4,592) (6,399) Total income from operations $ 27,425 $ 31,271 $ 52,897 $ 61,877 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $102 million and $(112) million for the three months ended June 30, 2024 and 2025, respectively, and $174 million and $148 million for the six months ended June 30, 2024 and 2025, respectively. Alphabet-level activities include charges related to employee severance and office space charges. Google Services Google Services operating income increased $3.4 billion from the three months ended June 30, 2024 to the three months ended June 30, 2025. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in expenses related to legal and other matters, TAC, and content acquisition costs. Google Services operating income increased $8.2 billion from the six months ended June 30, 2024 to the six months ended June 30, 2025. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in TAC and content acquisition costs. Google Cloud Google Cloud operating income increased $1.7 billion and $2.9 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "46",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_46_chunk_1",
        "text": "by increases in usage costs for technical infrastructure and employee compensation expenses. Other Bets 46",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "46",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 13. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Income before provision for income taxes $ 23,064 $ 16,233 $ 66,332 $ 54,181 Provision for income taxes $ 4,128 $ 2,323 $ 10,941 $ 7,833 Effective tax rate 17.9 % 14.3 % 16.5 % 14.5 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. Total gross unrecognized tax benefits were $5.2 billion and $6.3 billion as of December 31, 2021 and September 30, 2022, respectively. Total unrecognized tax benefits that, if recognized, would affect our effective tax rate were $3.7 billion and $4.6 billion as of December 31, 2021 and September 30, 2022, respectively. For information regarding non-income taxes, see Note 9. Note 14. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, digital content products, and hardware; and fees received for subscription- based products such as YouTube Premium and YouTube TV. • Google Cloud includes Google’s infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. The associated costs, including depreciation and impairment, are allocated to operating segments as a service cost generally based on usage or headcount. Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Revenues: Google Services $ 59,884 $ 61,377 $ 168,129 $ 185,690 Google Cloud 4,990 6,868 13,665 18,965 Other Bets 182 209 572 842 Hedging gains (losses) 62 638 (54) 1,291 Total revenues $ 65,118 $ 69,092 $ 182,312 $ 206,788 32",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of September 30, 2023, there was $38.5 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.6 years. Note 13. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Income before provision for income taxes $ 16,233 $ 21,197 $ 54,181 $ 61,305 Provision for income taxes $ 2,323 $ 1,508 $ 7,833 $ 8,197 Effective tax rate 14.3 % 7.1 % 14.5 % 13.4 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $7.1 billion and $8.8 billion as of December 31, 2022 and September 30, 2023, respectively, of which $5.3 billion and $6.8 billion, if recognized, would affect our effective tax rate, respectively. Note 14. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, and hardware; and fees received for subscription-based products such as YouTube Premium and YouTube TV. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet's unallocated corporate costs instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. Prior periods have been recast to conform to the current presentation. As announced on April 20, 2023, we brought together part of Google Research (the Brain team) and DeepMind to significantly accelerate our progress in artificial intelligence (AI). The group, called Google DeepMind, is reported within Alphabet's unallocated corporate",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_32_chunk_1",
        "text": "costs prospectively beginning in the second quarter of 2023. Previously, the Brain team was included within Google Services. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with reductions in our workforce and office space announced in January 2023 are not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. 32",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "32",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents information about our segments (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Revenues: Google Services $ 61,377 $ 67,986 $ 185,690 $ 196,232 Google Cloud 6,868 8,411 18,965 23,896 Other Bets 209 297 842 870 Hedging gains (losses) 638 (1) 1,291 86 Total revenues $ 69,092 $ 76,693 $ 206,788 $ 221,084 Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Operating income (loss): Google Services $ 18,883 $ 23,937 $ 62,477 $ 69,128 Google Cloud (440) 266 (1,736) 852 Other Bets (1,225) (1,194) (3,399) (3,232) Corporate costs, unallocated (83) (1,666) (660) (6,152) Total income from operations $ 17,135 $ 21,343 $ 56,682 $ 60,596 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2022 September 30, 2023 Long-lived assets: United States $ 93,565 $ 104,113 International 33,484 35,791 Total long-lived assets $ 127,049 $ 139,904 33",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "33",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_32_chunk_0",
        "text": "managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. As announced on April 18, 2024, we further consolidated teams that focus on building AI models across Google Research and Google DeepMind to further accelerate our progress in AI. AI model development teams previously under Google Research in our Google Services segment are included as part of Google DeepMind, reported within Alphabet-level activities, prospectively beginning in the second quarter of 2024. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Revenues: Google Services $ 67,986 $ 76,510 $ 196,232 $ 220,836 Google Cloud 8,411 11,353 23,896 31,274 Other Bets 297 388 870 1,248 Hedging gains (losses) (1) 17 86 191 Total revenues $ 76,693 $ 88,268 $ 221,084 $ 253,549 Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,937 $ 30,856 $ 69,128 $ 88,427 Google Cloud 266 1,947 852 4,019 Other Bets (1,194) (1,116) (3,232) (3,270) Alphabet-level activities (1,666) (3,166) (6,152) (7,758) Total income from operations $ 21,343 $ 28,521 $ 60,596 $ 81,418 See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2023 September 30, 2024 Long-lived assets: United States $ 110,053 $ 129,318 International 38,383 45,513 Total long-lived assets $ 148,436 $ 174,831 32",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_42_chunk_0",
        "text": "Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Sales and marketing expenses $ 6,884 $ 7,227 $ 20,198 $ 20,445 Sales and marketing expenses as a percentage of revenues 9 % 8 % 9 % 8 % Sales and marketing expenses increased $343 million from the three months ended September 30, 2023 to the three months ended September 30, 2024, primarily driven by an increase in advertising and promotional activities of $206 million. Sales and marketing expenses increased $247 million from the nine months ended September 30, 2023 to the nine months ended September 30, 2024, due to a combination of factors, none of which were individually significant. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 General and administrative expenses $ 3,979 $ 3,599 $ 11,219 $ 9,783 General and administrative expenses as a percentage of revenues 5 % 4 % 5 % 4 % General and administrative expenses decreased $380 million and $1.4 billion from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024, primarily driven by a reduction in charges related to legal and other matters of $693 million and $1.4 billion, respectively, partially offset by a combination of factors, none of which were individually significant. Segment Profitability The following table presents segment operating income (loss) (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,937 $ 30,856 $ 69,128 $ 88,427 Google Cloud 266 1,947 852 4,019 Other Bets (1,194) (1,116) (3,232) (3,270) Alphabet-level activities(1) (1,666) (3,166) (6,152) (7,758) Total income from operations $ 21,343 $ 28,521 $ 60,596 $ 81,418 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $(1) million and $17 million for the three months ended September 30, 2023 and 2024, respectively, and $86 million and $191 million for the nine months ended September 30, 2023 and 2024, respectively. For the three and nine months ended September 30, 2023 and 2024, Alphabet-level activities included substantially all of the charges related to employee severance and our office space optimization efforts. During the quarter ended September 30, 2024, we incurred office space charges totaling $607 million. For additional information relating to our segments, see Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. 42",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    }
]