[
    {
        "id": "goog-10-k-2022.pdf_page_60_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 2. Revenues Disaggregated Revenues The following table presents revenues disaggregated by type (in millions): Year Ended December 31, 2020 2021 2022 Google Search & other $ 104,062 $ 148,951 $ 162,450 YouTube ads 19,772 28,845 29,243 Google Network 23,090 31,701 32,780 Google advertising 146,924 209,497 224,473 Google other 21,711 28,032 29,055 Google Services total 168,635 237,529 253,528 Google Cloud 13,059 19,206 26,280 Other Bets 657 753 1,068 Hedging gains (losses) 176 149 1,960 Total revenues $ 182,527 $ 257,637 $ 282,836 No individual customer or groups of affiliated customers represented more than 10% of our revenues in 2020, 2021, or 2022. The following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions): Year Ended December 31, 2020 2021 2022 United States $ 85,014 47 % $ 117,854 46 % $ 134,814 48 % EMEA(1) 55,370 30 79,107 31 82,062 29 APAC(1) 32,550 18 46,123 18 47,024 16 Other Americas(1) 9,417 5 14,404 5 16,976 6 Hedging gains (losses) 176 0 149 0 1,960 1 Total revenues $ 182,527 100 % $ 257,637 100 % $ 282,836 100 % (1) Regions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\"). Revenue Backlog As of December 31, 2022, we had $64.3 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Our revenue backlog represents commitments in customer contracts for future services that have not yet been recognized as revenue. The amount and timing of revenue recognition for these commitments is largely driven by our ability to deliver in accordance with relevant contract terms and when our customers utilize services, which could affect our estimate of revenue backlog and when we expect to recognize such as revenue. We expect to recognize approximately half of the revenue backlog as revenues over the next 24 months with the remaining to be recognized thereafter. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts. Deferred Revenue We record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google other. Total deferred revenue as of December 31, 2021 was $3.8 billion, of which $2.5 billion was recognized as revenues for the year ending December 31, 2022. 59",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "60",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_84_chunk_0",
        "text": "Table of Contents Alphabet Inc. Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs. As AI is critical to delivering our mission of bringing our breakthrough innovations into the real world, beginning in January 2023, we will update our segment reporting relating to certain of Alphabet's AI activities. DeepMind, previously reported within Other Bets, will be reported as part of Alphabet's corporate costs, reflecting its increasing collaboration with Google Services, Google Cloud, and Other Bets. Prior periods will be recast to conform to the revised presentation. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Year Ended December 31, 2020 2021 2022 Revenues: Google Services $ 168,635 $ 237,529 $ 253,528 Google Cloud 13,059 19,206 26,280 Other Bets 657 753 1,068 Hedging gains (losses) 176 149 1,960 Total revenues $ 182,527 $ 257,637 $ 282,836 Operating income (loss): Google Services $ 54,606 $ 91,855 $ 86,572 Google Cloud (5,607) (3,099) (2,968) Other Bets (4,476) (5,281) (6,083) Corporate costs, unallocated (3,299) (4,761) (2,679) Total income from operations $ 41,224 $ 78,714 $ 74,842 For revenues by geography see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of December 31, 2021 2022 Long-lived assets: United States $ 80,207 $ 93,565 International 30,351 33,484 Total long-lived assets $ 110,558 $ 127,049 Note 16. Subsequent Event In January 2023, we announced a reduction of our workforce of approximately 12,000 roles. We expect to incur employee severance and related charges of $1.9 billion to $2.3 billion, the majority of which will be recognized in the first quarter of 2023. In addition, we are taking actions to optimize our global office space. As a result we expect to incur exit costs relating to office space reductions of approximately $0.5 billion in the first quarter of 2023. We may incur additional charges in the future as we further evaluate our real estate needs. 83",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "84",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_87_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 15. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, devices, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket; the sale of apps and in-app purchases and devices. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues primarily from consumption-based fees and subscriptions received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of healthcare-related services and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet-level activities instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. Prior periods have been recast to conform to the current presentation. As announced on April 20, 2023, we brought together part of Google Research (the Brain team) and DeepMind to significantly accelerate our progress in artificial intelligence (AI). The group, called Google DeepMind, is reported within Alphabet-level activities prospectively beginning in the second quarter of 2023. Previously, the Brain team was included within Google Services. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with reductions in our workforce and office space during 2023 were not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Year Ended December 31, 2021 2022 2023 Revenues: Google Services $ 237,529 $ 253,528 $ 272,543 Google Cloud 19,206 26,280 33,088 Other Bets 753 1,068 1,527 Hedging gains (losses) 149 1,960 236 Total revenues $ 257,637 $ 282,836 $ 307,394 Operating income (loss):",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "87",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_87_chunk_1",
        "text": "Google Services $ 88,132 $ 82,699 $ 95,858 Google Cloud (2,282) (1,922) 1,716 Other Bets (4,051) (4,636) (4,095) Alphabet-level activities (3,085) (1,299) (9,186) Total income from operations $ 78,714 $ 74,842 $ 84,293 See Note 2 for information relating to revenues by geography. 86.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "87",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_88_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of December 31, 2022 2023 Long-lived assets: United States $ 93,565 $ 110,053 International 33,484 38,383 Total long-lived assets $ 127,049 $ 148,436 87.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "88",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_89_chunk_0",
        "text": "Table of Contents Alphabet Inc. As announced in April 2024, we consolidated teams that focus on building general AI models across Google Research and Google DeepMind to further accelerate our progress in AI. General AI model development teams previously under Google Research in our Google Services segment are reported within Alphabet-level activities prospectively beginning in the second quarter of 2024. As further announced, in October 2024, the Gemini app team that is developing the direct consumer interface to our Gemini models joined Google DeepMind. The costs associated with the Gemini app team continue to be reported within our Google Services segment. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information. The following table presents revenue, profitability, and expense information about our segments (in millions): Year Ended December 31, 2022 2023 2024 Revenues: Google Services $ 253,528 $ 272,543 $ 304,930 Google Cloud 26,280 33,088 43,229 Other Bets 1,068 1,527 1,648 Hedging gains (losses) 1,960 236 211 Total revenues $ 282,836 $ 307,394 $ 350,018 Operating income (loss): Google Services $ 82,699 $ 95,858 $ 121,263 Google Cloud (1,922) 1,716 6,112 Other Bets (4,636) (4,095) (4,444) Alphabet-level activities (1,299) (9,186) (10,541) Total income from operations $ 74,842 $ 84,293 $ 112,390 Supplemental information about our segment expenses: Google Services: Employee compensation expenses $ 43,529 $ 46,224 $ 44,560 Other costs and expenses 127,300 130,461 139,107 Total Google Services costs and expenses $ 170,829 $ 176,685 $ 183,667 Google Cloud: Employee compensation expenses $ 16,132 $ 19,054 $ 20,519 Other costs and expenses 12,070 12,318 16,598 Total Google Cloud costs and expenses $ 28,202 $ 31,372 $ 37,117 Google Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs. See Note 2 for information relating to revenues by geography. 88.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "89",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_29_chunk_0",
        "text": "Table of Contents Alphabet Inc. Three Months Ended March 31, 2021 2022 Operating income (loss): Google Services $ 19,546 $ 22,920 Google Cloud (974) (931) Other Bets (1,145) (1,155) Corporate costs, unallocated (990) (740) Total income from operations $ 16,437 $ 20,094 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2021 March 31, 2022 Long-lived assets: United States $ 80,207 $ 85,341 International 30,351 31,869 Total long-lived assets $ 110,558 $ 117,210 29",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "29",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_38_chunk_0",
        "text": "Table of Contents Alphabet Inc. Segment Profitability The following table presents segment operating income (loss) (in millions). Three Months Ended March 31, 2021 2022 Operating income (loss): Google Services $ 19,546 $ 22,920 Google Cloud (974) (931) Other Bets (1,145) (1,155) Corporate costs, unallocated(1) (990) (740) Total income from operations $ 16,437 $ 20,094 (1) Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs. Google Services Google Services operating income increased $3.4 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022. The increase was due to growth in revenues, partially offset by increases in TAC, compensation expenses, and content acquisition costs. Google Cloud Google Cloud operating loss decreased $43 million from the three months ended March 31, 2021 to the three months ended March 31, 2022. The decrease in operating loss was primarily driven by growth in revenues, partially offset by an increase in expenses, primarily driven by compensation expenses. Other Bets Other Bets operating loss increased $10 million from the three months ended March 31, 2021 to the three months ended March 31, 2022. The increase in operating loss was due to an increase in expenses, primarily driven by compensation expenses, partially offset by an increase in revenues. Other Income (Expense), Net The following table presents other income (expense), net (in millions): Three Months Ended March 31, 2021 2022 Other income (expense), net $ 4,846 $ (1,160) Other income (expense), net, decreased $6.0 billion from the three months ended March 31, 2021 to the three months ended March 31, 2022, primarily due to gains and losses on equity securities and changes in accrued performance fees. In the three months ended March 31, 2022, $1.5 billion of net unrealized losses were recognized on marketable equity securities, partially offset by $460 million of net unrealized gains on non-marketable equity securities and a $233 million reversal of previously accrued performance fees related to certain investments. In the three months ended March 31, 2021, a net unrealized gain of $4.7 billion was recognized on non-marketable equity securities, partially offset by $665 million of accrued performance fees. See Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. 38",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "38",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_29_chunk_0",
        "text": "Table of Contents Alphabet Inc. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet's unallocated corporate costs instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. After the segment reporting changes discussed above, unallocated corporate costs primarily include AI- focused shared R&D activities; corporate initiatives such as our philanthropic activities; and corporate shared costs such as finance, certain human resource costs, and legal, including certain fines and settlements. In the first quarter of 2023, unallocated corporate costs also include charges associated with reductions in our workforce and office space. Additionally, hedging gains (losses) related to revenue are included in unallocated corporate costs. Prior periods have been recast to conform to the current presentation. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended March 31, 2022 2023 Revenues: Google Services $ 61,472 $ 61,961 Google Cloud 5,821 7,454 Other Bets 440 288 Hedging gains (losses) 278 84 Total revenues $ 68,011 $ 69,787 Three Months Ended March 31, 2022 2023 Operating income (loss): Google Services $ 21,973 $ 21,737 Google Cloud (706) 191 Other Bets (835) (1,225) Corporate costs, unallocated (338) (3,288) Total income from operations $ 20,094 $ 17,415 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2022 March 31, 2023 Long-lived assets: United States $ 93,565 $ 96,519 International 33,484 35,488 Total long-lived assets $ 127,049 $ 132,007 29",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "29",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_39_chunk_0",
        "text": "Table of Contents Alphabet Inc. Segment Profitability The following table presents segment operating income (loss) (in millions). Three Months Ended March 31, 2022 2023 Operating income (loss): Google Services $ 21,973 $ 21,737 Google Cloud (706) 191 Other Bets (835) (1,225) Corporate costs, unallocated(1) (338) (3,288) Total income from operations $ 20,094 $ 17,415 (1) Hedging gains (losses) related to revenue included in unallocated corporate costs were $278 million and $84 million for the three months ended March 31, 2022 and 2023, respectively. For the three months ended March 31, 2023, unallocated corporate costs include charges related to the reductions in our workforce and office space totaling $2.5 billion. Google Services Google Services operating income decreased $236 million from the three months ended March 31, 2022 to the three months ended March 31, 2023. The decrease in operating income was primarily driven by an increase in compensation expenses, partially offset by the effect of the shift in timing of our annual employee stock-based compensation awards, a reduction in costs driven by the change in the estimated useful life of our servers and certain network equipment, and growth in revenues. Google Cloud Google Cloud operating income of $191 million for the three months ended March 31, 2023 compared to an operating loss of $706 million for the three months ended March 31, 2022 represents an increase of $897 million. The increase was primarily driven by revenue growth, partially offset by an increase in compensation expenses. Additionally, operating income benefited from a reduction in costs driven by the change in the estimated useful life of our servers and certain network equipment and the effect of the shift in timing of our annual employee stock- based compensation awards. Other Bets Other Bets operating loss increased $390 million from the three months ended March 31, 2022 to the three months ended March 31, 2023 due to a combination of factors none of which were individually significant. Other Income (Expense), Net The following table presents other income (expense), net (in millions): Three Months Ended March 31, 2022 2023 Other income (expense), net $ (1,160) $ 790 Other income (expense), net, increased $2.0 billion from the three months ended March 31, 2022 to the three months ended March 31, 2023 primarily due to unrealized gains and losses on equity securities and changes in interest income. In the three months ended March 31, 2023, $797 million of interest income was recognized and $221 million and $51 million of net unrealized gains were recognized on non-marketable and marketable equity securities, respectively. In the three months ended March 31, 2022, $1.5 billion of net unrealized losses were recognized on marketable equity securities, partially offset by $460 million of net unrealized gains on non- marketable equity securities and $414 million of interest income. See Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. 39",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_28_chunk_0",
        "text": "The following table presents information about our segments (in millions): Three Months Ended March 31, 2023 2024 Revenues: Google Services $ 61,961 $ 70,398 Google Cloud 7,454 9,574 Other Bets 288 495 Hedging gains (losses) 84 72 Total revenues $ 69,787 $ 80,539 Three Months Ended March 31, 2023 2024 Operating income (loss): Google Services $ 21,737 $ 27,897 Google Cloud 191 900 Other Bets (1,225) (1,020) Alphabet-level activities (3,288) (2,305) Total income from operations $ 17,415 $ 25,472 See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2023 March 31, 2024 Long-lived assets: United States $ 110,053 $ 117,085 International 38,383 39,865 Total long-lived assets $ 148,436 $ 156,950 28",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "28",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_31_chunk_0",
        "text": "Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions are also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information. The following table presents revenue, profitability, and expense information about our segments (in millions): Three Months Ended March 31, 2024 2025 Revenues: Google Services $ 70,398 $ 77,264 Google Cloud 9,574 12,260 Other Bets 495 450 Hedging gains (losses) 72 260 Total revenues $ 80,539 $ 90,234 Operating income (loss): Google Services $ 27,897 $ 32,682 Google Cloud 900 2,177 Other Bets (1,020) (1,226) Alphabet-level activities (2,305) (3,027) Total income from operations $ 25,472 $ 30,606 Supplemental information about segment expenses: Google Services: Employee compensation expenses $ 11,511 $ 11,337 Other costs and expenses 30,990 33,245 Total Google Services costs and expenses $ 42,501 $ 44,582 Google Cloud: Employee compensation expenses $ 5,157 $ 5,412 Other costs and expenses 3,517 4,671 Total Google Cloud costs and expenses $ 8,674 $ 10,083 Google Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs. See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2024 March 31, 2025 Long-lived assets: United States $ 138,993 $ 149,304 International 45,631 49,480 Total long-lived assets $ 184,624 $ 198,784 31",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "31",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_38_chunk_0",
        "text": "Revenues by Geography The following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers: Three Months Ended March 31, 2024 2025 United States 48 % 49 % EMEA 30 % 29 % APAC 16 % 16 % Other Americas 6 % 6 % Hedging gains (losses) 0 % 0 % For additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Use of Non-GAAP Constant Currency Information International revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates. The effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. 38",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "38",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_41_chunk_0",
        "text": "The following table presents segment operating income (loss) (in millions): Three Months Ended March 31, 2024 2025 Operating income (loss): Google Services $ 27,897 $ 32,682 Google Cloud 900 2,177 Other Bets (1,020) (1,226) Alphabet-level activities(1) (2,305) (3,027) Total income from operations $ 25,472 $ 30,606 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $72 million and $260 million for the three months ended March 31, 2024 and 2025, respectively. Alphabet-level activities include all of the charges related to employee severance and office space charges. Google Services Google Services operating income increased $4.8 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in content acquisition costs and TAC. Google Cloud Google Cloud operating income increased $1.3 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure and employee compensation expenses. Other Bets Other Bets operating loss increased $206 million from the three months ended March 31, 2024 to the three months ended March 31, 2025. The increase in operating loss was due to a combination of factors, none of which were individually significant. Other Income (Expense), Net The following table presents OI&E (in millions): Three Months Ended March 31, 2024 2025 Interest income $ 1,061 $ 1,001 Interest expense (94) (34) Foreign currency exchange gain (loss), net (238) (106) Gain (loss) on debt securities, net (462) 202 Gain (loss) on equity securities, net 2,243 9,758 Performance fees 104 (40) Income (loss) and impairment from equity method investments, net (26) (22) Other 255 424 Other income (expense), net $ 2,843 $ 11,183 OI&E, net increased $8.3 billion from the three months ended March 31, 2024 to the three months ended March 31, 2025 primarily due to an increase in net gains on equity securities. The net gains on equity securities were due to net unrealized gains on non-marketable equity securities driven by fair value adjustments related to observable transactions. For additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. 41",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "41",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Operating income (loss): Google Services $ 22,343 $ 22,770 $ 41,889 $ 45,690 Google Cloud (591) (858) (1,565) (1,789) Other Bets (1,398) (1,686) (2,543) (2,841) Corporate costs, unallocated (993) (773) (1,983) (1,513) Total income from operations $ 19,361 $ 19,453 $ 35,798 $ 39,547 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2021 June 30, 2022 Long-lived assets: United States $ 80,207 $ 88,044 International 30,351 31,577 Total long-lived assets $ 110,558 $ 119,621 32",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. Google Services Google Services operating income increased $427 million from the three months ended June 30, 2021 to the three months ended June 30, 2022. The increase was due to growth in revenues, partially offset by increases in compensation expenses and TAC. Google Services operating income increased $3.8 billion from the six months ended June 30, 2021 to the six months ended June 30, 2022. The increase was due to growth in revenues, partially offset by increases in TAC and compensation expenses. Google Cloud Google Cloud operating loss increased $267 million and $224 million from the three and six months ended June 30, 2021 to the three and six months ended June 30, 2022, respectively. The increase in operating loss was primarily driven by an increase in expenses, primarily driven by compensation expenses, partially offset by growth in revenues. Other Bets Other Bets operating loss increased $288 million from the three months ended June 30, 2021 to the three months ended June 30, 2022. The increase in operating loss was primarily driven by an increase in compensation expenses. Other Bets operating loss increased $298 million from the six months ended June 30, 2021 to the six months ended June 30, 2022. The increase in operating loss was primarily driven by increases in compensation expenses, partially offset by growth in revenues. Other Income (Expense), Net The following table presents other income (expense), net (in millions): Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Other income (expense), net $ 2,624 $ (439) $ 7,470 $ (1,599) Other income (expense), net, decreased $3.1 billion from the three months ended June 30, 2021 to the three months ended June 30, 2022 primarily due to gains and losses on equity and debt securities and changes in accrued performance fees. In the three months ended June 30, 2022, $1.2 billion of net unrealized losses were recognized on marketable equity securities and $790 million of net losses on debt securities. These losses were partially offset by $911 million of net unrealized gains on non-marketable equity securities and a $318 million reversal of previously accrued performance fees related to certain investments. In the three months ended June 30, 2021, $2.6 billion of net unrealized gains on marketable and non-marketable equity securities were recognized, partially offset by $523 million of accrued performance fees related to certain investments. Other income (expense), net, decreased $9.1 billion from the six months ended June 30, 2021 to the six months ended June 30, 2022 primarily due to gains and losses on equity securities and changes in accrued performance fees. In the six months ended June 30, 2022, $2.5 billion of net unrealized losses were recognized on marketable equity securities, partially offset by $1.4 billion of net unrealized gains on non-marketable equity securities and a $551 million reversal of previously accrued performance fees related to certain investments. In the six months ended June 30, 2021, $7.1 billion of net unrealized gains on marketable",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_42_chunk_1",
        "text": "and non-marketable equity securities were recognized, partially offset by $1.2 billion of accrued performance fees related to certain investments. See Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. 42",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "42",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Revenues: Google Services $ 62,841 $ 66,285 $ 124,313 $ 128,246 Google Cloud 6,276 8,031 12,097 15,485 Other Bets 193 285 633 573 Hedging gains (losses) 375 3 653 87 Total revenues $ 69,685 $ 74,604 $ 137,696 $ 144,391 Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Operating income (loss): Google Services $ 21,621 $ 23,454 $ 43,594 $ 45,191 Google Cloud (590) 395 (1,296) 586 Other Bets (1,339) (813) (2,174) (2,038) Corporate costs, unallocated (239) (1,198) (577) (4,486) Total income from operations $ 19,453 $ 21,838 $ 39,547 $ 39,253 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2022 June 30, 2023 Long-lived assets: United States $ 93,565 $ 99,714 International 33,484 35,963 Total long-lived assets $ 127,049 $ 135,677 32",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. Revenues by Geography The following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers: Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 United States 47 % 47 % 47 % 47 % EMEA 29 % 30 % 30 % 30 % APAC 17 % 17 % 17 % 17 % Other Americas 6 % 6 % 6 % 6 % Hedging gains (losses) 1 % 0 % 0 % 0 % For further details on revenues by geography, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Use of Non-GAAP Constant Currency Information International revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates. The effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. 40",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_41_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended June 30, 2023 % Change from Prior Period Three Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 32,727 $ 35,073 $ 0 $ 35,073 7 % 0 % 7 % EMEA 20,533 22,289 (275) 22,564 9 % (1) % 10 % APAC 11,710 12,728 (565) 13,293 9 % (5) % 14 % Other Americas 4,340 4,511 (306) 4,817 4 % (7) % 11 % Revenues, excluding hedging effect 69,310 74,601 (1,146) 75,747 8 % (1) % 9 % Hedging gains (losses) 375 3 Total revenues(1) $ 69,685 $ 74,604 $ 75,747 7 % (1) % (1) % 9 % (1) Total constant currency revenues of $75.7 billion for the three months ended June 30, 2023 increased $6.4 billion compared to $69.3 billion in revenues, excluding hedging effect, for the three months ended June 30, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the British pound. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Six Months Ended June 30, 2023 % Change from Prior Period Six Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 64,460 $ 67,937 $ 0 $ 67,937 5 % 0 % 5 % EMEA 40,850 43,367 (1,448) 44,815 6 % (4) % 10 % APAC 23,551 24,409 (1,399) 25,808 4 % (6) % 10 % Other Americas 8,182 8,591 (473) 9,064 5 % (6) % 11 % Revenues, excluding hedging effect 137,043 144,304 (3,320) 147,624 5 % (3) % 8 % Hedging gains (losses) 653 87 Total revenues(1) $ 137,696 $ 144,391 $ 147,624 5 % 0 % (3) % 8 % (1) Total constant currency revenues of $147.6 billion for the six months ended June 30, 2023 increased $10.6 billion compared to $137.0 billion in revenues, excluding hedging effect, for the six months ended June 30, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the British pound and the Euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. 41",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "41",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_32_chunk_0",
        "text": "managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. As announced on April 18, 2024, we further consolidated teams that focus on building AI models across Google Research and Google DeepMind to further accelerate our progress in AI. AI model development teams previously under Google Research in our Google Services segment are included as part of Google DeepMind, reported within Alphabet-level activities, prospectively beginning in the second quarter of 2024. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and employee severance in 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Revenues: Google Services $ 66,285 $ 73,928 $ 128,246 $ 144,326 Google Cloud 8,031 10,347 15,485 19,921 Other Bets 285 365 573 860 Hedging gains (losses) 3 102 87 174 Total revenues $ 74,604 $ 84,742 $ 144,391 $ 165,281 Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,454 $ 29,674 $ 45,191 $ 57,571 Google Cloud 395 1,172 586 2,072 Other Bets (813) (1,134) (2,038) (2,154) Alphabet-level activities (1,198) (2,287) (4,486) (4,592) Total income from operations $ 21,838 $ 27,425 $ 39,253 $ 52,897 See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2023 June 30, 2024 Long-lived assets: United States $ 110,053 $ 122,463 International 38,383 42,298 Total long-lived assets $ 148,436 $ 164,761 32",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_42_chunk_0",
        "text": "Segment Profitability The following table presents segment operating income (loss) (in millions): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,454 $ 29,674 $ 45,191 $ 57,571 Google Cloud 395 1,172 586 2,072 Other Bets (813) (1,134) (2,038) (2,154) Alphabet-level activities(1) (1,198) (2,287) (4,486) (4,592) Total income from operations $ 21,838 $ 27,425 $ 39,253 $ 52,897 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $3 million and $102 million for the three months ended June 30, 2023 and 2024, respectively, and $87 million and $174 million for the six months ended June 30, 2023 and 2024, respectively. For the three and six months ended June 30, 2023 and 2024, Alphabet-level activities included substantially all of the charges related to employee severance and our office space optimization efforts. For additional information relating to our segments, see Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Google Services Google Services operating income increased $6.2 billion from the three months ended June 30, 2023 to the three months ended June 30, 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in content acquisition costs and TAC. Additionally, a reduction in compensation expenses contributed to the increase in operating income. Google Services operating income increased $12.4 billion from the six months ended June 30, 2023 to the six months ended June 30, 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in TAC and content acquisition costs. Additionally, a reduction in compensation expenses contributed to the increase in operating income. Google Cloud Google Cloud operating income increased $777 million and $1.5 billion from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure assets as well as compensation expenses, largely driven by headcount growth. Other Bets Other Bets operating loss increased $321 million and $116 million from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024, respectively. The increase in operating loss was primarily due to an increase in compensation expenses as a result of the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period. Additionally, growth in revenues partially offset the increase in operating loss from the six months ended June 30, 2023 to the six months ended June 30, 2024. 42",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_35_chunk_0",
        "text": "• Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of autonomous transportation services, healthcare- related services and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions are also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information. The following table presents revenue, profitability, and expense information about our segments (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Revenues: Google Services $ 73,928 $ 82,543 $ 144,326 $ 159,807 Google Cloud 10,347 13,624 19,921 25,884 Other Bets 365 373 860 823 Hedging gains (losses) 102 (112) 174 148 Total revenues $ 84,742 $ 96,428 $ 165,281 $ 186,662 Operating income (loss): Google Services $ 29,674 $ 33,063 $ 57,571 $ 65,745 Google Cloud 1,172 2,826 2,072 5,003 Other Bets (1,134) (1,246) (2,154) (2,472) Alphabet-level activities (2,287) (3,372) (4,592) (6,399) Total income from operations $ 27,425 $ 31,271 $ 52,897 $ 61,877 Supplemental information about segment expenses: Google Services: Employee compensation expenses $ 11,240 $ 11,306 $ 22,751 $ 22,643 Other costs and expenses 33,014 38,174 64,004 71,419 Total Google Services costs and expenses $ 44,254 $ 49,480 $ 86,755 $ 94,062 Google Cloud: Employee compensation expenses $ 5,175 $ 5,517 $ 10,332 $ 10,929 Other costs and expenses 4,000 5,281 7,517 9,952 Total Google Cloud costs and expenses $ 9,175 $ 10,798 $ 17,849 $ 20,881 35",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_36_chunk_0",
        "text": "Google Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs. See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2024 June 30, 2025 Long-lived assets: United States $ 138,993 $ 160,877 International 45,631 56,609 Total long-lived assets $ 184,624 $ 217,486 36",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "36",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_42_chunk_0",
        "text": "YouTube ads YouTube ads revenues increased $1.1 billion and $2.0 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025. The growth was driven by our direct response advertising products followed by our brand advertising products, both of which benefited from increased spending by our advertisers. Google Network Google Network revenues decreased $90 million from the three months ended June 30, 2024 to the three months ended June 30, 2025, primarily due to a decrease in AdSense and Google Ad Manager revenues, partially offset by an increase in AdMob revenues. Google Network revenues decreased $247 million from the six months ended June 30, 2024 to the six months ended June 30, 2025, primarily due to a decrease in Google Ad Manager revenues and the unfavorable effect of foreign currency exchange rates. These decreases were partially offset by an increase in AdSense revenues. Monetization Metrics The following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from three and six months ended June 30, 2024 to three and six months ended June 30, 2025: Three Months Ended Six Months Ended June 30, 2025 June 30, 2025 Google Search & other Paid clicks change 4 % 3 % Cost-per-click change 8 % 8 % Google Network Impressions change (6)% (5) % Cost-per-impression change 6 % 5 % Changes in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices. Changes in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates. Google subscriptions, platforms, and devices Google subscriptions, platforms, and devices revenues increased $1.9 billion and $3.5 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025. The growth was primarily driven by an increase in subscription revenues. This increase was primarily due to the contribution from growth in paid subscriptions across both YouTube services and Google One. Google Cloud Google Cloud revenues increased $3.3 billion and $6.0 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure services. 42",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_43_chunk_0",
        "text": "Revenues by Geography The following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers: Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 United States 49 % 48 % 48 % 48 % EMEA 29 % 29 % 29 % 29 % APAC 16 % 17 % 17 % 17 % Other Americas 6 % 6 % 6 % 6 % Hedging gains (losses) 0 % 0 % 0 % 0 % For additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Use of Non-GAAP Constant Currency Information International revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates. The effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. 43",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "43",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_44_chunk_0",
        "text": "The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended June 30, 2025 % Change from Prior Period Three Months Ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 41,196 $ 46,063 $ 0 $ 46,063 12 % 0 % 12 % EMEA 24,683 28,262 780 27,482 14 % 3 % 11 % APAC 13,823 16,480 115 16,365 19 % 1 % 18 % Other Americas 4,938 5,735 (352) 6,087 16 % (7) % 23 % Revenues, excluding hedging effect 84,640 96,540 543 95,997 14 % 1 % 13 % Hedging gains (losses) 102 (112) Total revenues(1) $ 84,742 $ 96,428 $ 95,997 14 % 0 % 1 % 13 % (1) Total constant currency revenues of $96.0 billion for the three months ended June 30, 2025 increased $11.4 billion compared to $84.6 billion in revenues, excluding hedging effect, for the three months ended June 30, 2024. EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the euro and British pound. APAC revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Japanese yen, partially offset by the U.S. dollar strengthening relative to the South Korean won and Australian dollar. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso. Six Months Ended June 30, 2025 % Change from Prior Period Six months ended June 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2024 2025 Effect Revenues Reported Effect Effect Revenues United States $ 79,933 $ 90,027 $ 0 $ 90,027 13 % 0 % 13 % EMEA 48,471 54,185 56 54,129 12 % 0 % 12 % APAC 27,112 31,334 (266) 31,600 16 % (1) % 17 % Other Americas 9,591 10,968 (852) 11,820 14 % (9) % 23 % Revenues, excluding hedging effect 165,107 186,514 (1,062) 187,576 13 % (1) % 14 % Hedging gains (losses) 174 148 Total revenues(1) $ 165,281 $ 186,662 $ 187,576 13 % 0 % (1) % 14 % (1) Total constant currency revenues of $187.6 billion for the six months ended June 30, 2025 increased $22.5 billion compared to $165.1 billion in revenues, excluding hedging effect, for the six months ended June 30, 2024. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar weakening relative to the British pound was largely offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Australian dollar, South Korean won, and Indian rupee. Other",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "44",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_44_chunk_1",
        "text": "Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Brazilian real and Mexican peso. Costs and Expenses 44",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "44",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_46_chunk_0",
        "text": "Sales and marketing expenses increased $55 million from the six months ended June 30, 2024 to the six months ended June 30, 2025, primarily driven by an increase in advertising and promotional activities of $361 million, partially offset by a decrease in employee compensation expenses of $314 million. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 General and administrative expenses $ 3,158 $ 5,209 $ 6,184 $ 8,748 General and administrative expenses as a percentage of revenues 4 % 5 % 4 % 5 % General and administrative expenses increased $2.1 billion and $2.6 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025, primarily driven by an increase in expenses related to legal and other matters of $2.3 billion and $2.6 billion, respectively, largely due to a settlement in principle of certain legal matters. Segment Profitability We report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. The following table presents segment operating income (loss) (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Operating income (loss): Google Services $ 29,674 $ 33,063 $ 57,571 $ 65,745 Google Cloud 1,172 2,826 2,072 5,003 Other Bets (1,134) (1,246) (2,154) (2,472) Alphabet-level activities(1) (2,287) (3,372) (4,592) (6,399) Total income from operations $ 27,425 $ 31,271 $ 52,897 $ 61,877 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $102 million and $(112) million for the three months ended June 30, 2024 and 2025, respectively, and $174 million and $148 million for the six months ended June 30, 2024 and 2025, respectively. Alphabet-level activities include charges related to employee severance and office space charges. Google Services Google Services operating income increased $3.4 billion from the three months ended June 30, 2024 to the three months ended June 30, 2025. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in expenses related to legal and other matters, TAC, and content acquisition costs. Google Services operating income increased $8.2 billion from the six months ended June 30, 2024 to the six months ended June 30, 2025. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in TAC and content acquisition costs. Google Cloud Google Cloud operating income increased $1.7 billion and $2.9 billion from the three and six months ended June 30, 2024 to the three and six months ended June 30, 2025, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "46",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_46_chunk_1",
        "text": "by increases in usage costs for technical infrastructure and employee compensation expenses. Other Bets 46",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "46",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Operating income (loss): Google Services $ 23,973 $ 19,781 $ 65,862 $ 65,471 Google Cloud (644) (699) (2,209) (2,488) Other Bets (1,288) (1,611) (3,831) (4,452) Corporate costs, unallocated (1,010) (336) (2,993) (1,849) Total income from operations $ 21,031 $ 17,135 $ 56,829 $ 56,682 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2021 September 30, 2022 Long-lived assets: United States $ 80,207 $ 91,632 International 30,351 30,408 Total long-lived assets $ 110,558 $ 122,040 33",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "33",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_38_chunk_0",
        "text": "Table of Contents Alphabet Inc. Financial Results Revenues The following table presents revenues by type (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Google Search & other $ 37,926 $ 39,539 $ 105,650 $ 119,846 YouTube ads 7,205 7,071 20,212 21,280 Google Network 7,999 7,872 22,396 24,305 Google advertising 53,130 54,482 148,258 165,431 Google other 6,754 6,895 19,871 20,259 Google Services total 59,884 61,377 168,129 185,690 Google Cloud 4,990 6,868 13,665 18,965 Other Bets 182 209 572 842 Hedging gains (losses) 62 638 (54) 1,291 Total revenues $ 65,118 $ 69,092 $ 182,312 $ 206,788 Google Services Google advertising revenues Google Search & other Google Search & other revenues increased $1.6 billion and $14.2 billion from the three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022, respectively. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage, primarily on mobile devices, growth in advertiser spending, and improvements we have made in ad formats and delivery. Growth was partially offset by the unfavorable effect of foreign currency exchange rates. YouTube ads YouTube ads revenues decreased $134 million from the three months ended September 30, 2021 to the three months ended September 30, 2022, as the unfavorable effect of foreign currency exchange rates more than offset growth in our brand and direct response advertising products. YouTube ads revenues increased $1.1 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The growth was driven by our brand and direct response advertising products, both of which benefited from increased spending by our advertisers as well as improvements to ad formats and delivery. Growth was partially offset by the unfavorable effect of foreign currency exchange rates. Google Network Google Network revenues decreased $127 million from the three months ended September 30, 2021 to the three months ended September 30, 2022, as the unfavorable effect of foreign currency exchange rates more than offset strength in AdSense. Google Network revenues increased $1.9 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The growth was primarily driven by strength in AdSense and AdMob, partially offset by the unfavorable effect of foreign currency exchange rates. 38",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "38",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_43_chunk_0",
        "text": "Table of Contents Alphabet Inc. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 General and administrative expenses $ 3,256 $ 3,597 $ 9,370 $ 10,628 General and administrative expenses as a percentage of revenues 5.0 % 5.2 % 5.1 % 5.1 % General and administrative expenses increased $341 million from the three months ended September 30, 2021 to the three months ended September 30, 2022. The increase was primarily driven by an increase in compensation expenses of $385 million, largely resulting from a 23% increase in headcount, and an increase in professional services fees of $214 million. The overall increase was partially offset by a decrease in charges related to legal matters of $228 million, including the $217 million reduction of the EC fine imposed in 2018. For further details on the EC fine imposed in 2018, see Note 9 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. General and administrative expenses increased $1.3 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The increase was primarily driven by an increase in compensation expenses of $985 million, largely resulting from a 21% increase in headcount, and an increase in professional services fees of $811 million. The overall increase was partially offset by a decrease in charges related to legal matters of $1.0 billion. Segment Profitability The following table presents segment operating income (loss) (in millions). Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Operating income (loss): Google Services $ 23,973 $ 19,781 $ 65,862 $ 65,471 Google Cloud (644) (699) (2,209) (2,488) Other Bets (1,288) (1,611) (3,831) (4,452) Corporate costs, unallocated(1) (1,010) (336) (2,993) (1,849) Total income from operations $ 21,031 $ 17,135 $ 56,829 $ 56,682 (1) Unallocated corporate costs primarily include corporate initiatives, corporate shared costs, such as finance and legal, including certain fines and settlements, as well as costs associated with certain shared R&D activities. Additionally, hedging gains (losses) related to revenue are included in corporate costs. Google Services Google Services operating income decreased $4.2 billion from the three months ended September 30, 2021 to the three months ended September 30, 2022. The decrease in operating income was primarily driven by increases in compensation expenses, hardware costs, and advertising and promotional activities, partially offset by growth in revenues. Google Services operating income decreased $391 million from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The decrease in operating income was primarily driven by increases in compensation expenses and TAC, partially offset by growth in revenues. Google Cloud Google Cloud operating loss increased $55 million and $279 million from the three and nine months ended September 30, 2021 to the three and nine months ended September 30, 2022, respectively. The increase in operating loss was primarily",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "43",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_43_chunk_1",
        "text": "driven by an increase in expenses, primarily driven by compensation expenses, partially offset by growth in revenues. 43",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "43",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_32_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of September 30, 2023, there was $38.5 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.6 years. Note 13. Income Taxes The following table presents provision for income taxes (in millions, except for effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Income before provision for income taxes $ 16,233 $ 21,197 $ 54,181 $ 61,305 Provision for income taxes $ 2,323 $ 1,508 $ 7,833 $ 8,197 Effective tax rate 14.3 % 7.1 % 14.5 % 13.4 % We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $7.1 billion and $8.8 billion as of December 31, 2022 and September 30, 2023, respectively, of which $5.3 billion and $6.8 billion, if recognized, would affect our effective tax rate, respectively. Note 14. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, and hardware; and fees received for subscription-based products such as YouTube Premium and YouTube TV. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. Reflecting DeepMind's increasing collaboration with Google Services, Google Cloud, and Other Bets, beginning in the first quarter of 2023 DeepMind is reported as part of Alphabet's unallocated corporate costs instead of within Other Bets. Additionally, beginning in the first quarter of 2023, we updated and simplified our cost allocation methodologies to provide our business leaders with increased transparency for decision-making. Prior periods have been recast to conform to the current presentation. As announced on April 20, 2023, we brought together part of Google Research (the Brain team) and DeepMind to significantly accelerate our progress in artificial intelligence (AI). The group, called Google DeepMind, is reported within Alphabet's unallocated corporate",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_32_chunk_1",
        "text": "costs prospectively beginning in the second quarter of 2023. Previously, the Brain team was included within Google Services. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with reductions in our workforce and office space announced in January 2023 are not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. 32",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "32",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_33_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents information about our segments (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Revenues: Google Services $ 61,377 $ 67,986 $ 185,690 $ 196,232 Google Cloud 6,868 8,411 18,965 23,896 Other Bets 209 297 842 870 Hedging gains (losses) 638 (1) 1,291 86 Total revenues $ 69,092 $ 76,693 $ 206,788 $ 221,084 Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Operating income (loss): Google Services $ 18,883 $ 23,937 $ 62,477 $ 69,128 Google Cloud (440) 266 (1,736) 852 Other Bets (1,225) (1,194) (3,399) (3,232) Corporate costs, unallocated (83) (1,666) (660) (6,152) Total income from operations $ 17,135 $ 21,343 $ 56,682 $ 60,596 For revenues by geography, see Note 2. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2022 September 30, 2023 Long-lived assets: United States $ 93,565 $ 104,113 International 33,484 35,791 Total long-lived assets $ 127,049 $ 139,904 33",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "33",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended September 30, 2023 % Change from Prior Period Three Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 33,372 $ 36,354 $ 0 $ 36,354 9 % 0 % 9 % EMEA 19,450 22,661 803 21,858 17 % 5 % 12 % APAC 11,494 13,126 (270) 13,396 14 % (3) % 17 % Other Americas 4,138 4,553 (106) 4,659 10 % (3) % 13 % Revenues, excluding hedging effect 68,454 76,694 427 76,267 12 % 1 % 11 % Hedging gains (losses) 638 (1) Total revenues(1) $ 69,092 $ 76,693 $ 76,267 11 % (1) % 1 % 11 % (1) Total constant currency revenues of $76.3 billion for the three months ended September 30, 2023 increased $7.8 billion compared to $68.5 billion in revenues, excluding hedging effect, for the three months ended September 30, 2022. EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Euro and to a lesser extent the British pound, partially offset by the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. Nine Months Ended September 30, 2023 % Change from Prior Period Nine Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2022 2023 Effect Revenues Reported Effect Effect Revenues United States $ 97,832 $ 104,291 $ 0 $ 104,291 7 % 0 % 7 % EMEA 60,300 66,028 (645) 66,673 9 % (2) % 11 % APAC 35,045 37,535 (1,669) 39,204 7 % (5) % 12 % Other Americas 12,320 13,144 (579) 13,723 7 % (4) % 11 % Revenues, excluding hedging effect 205,497 220,998 (2,893) 223,891 8 % (1) % 9 % Hedging gains (losses) 1,291 86 Total revenues(1) $ 206,788 $ 221,084 $ 223,891 7 % (1) % (1) % 9 % (1) Total constant currency revenues of $223.9 billion for the nine months ended September 30, 2023 increased $18.4 billion compared to $205.5 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2022. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Turkish lira and the British pound, partially offset by the U.S. dollar weakening relative to the Euro. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_42_chunk_1",
        "text": "was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso. 42",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "42",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_32_chunk_0",
        "text": "managed centrally at a consolidated level. These costs, including the associated depreciation and impairment, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue. As announced on April 18, 2024, we further consolidated teams that focus on building AI models across Google Research and Google DeepMind to further accelerate our progress in AI. AI model development teams previously under Google Research in our Google Services segment are included as part of Google DeepMind, reported within Alphabet-level activities, prospectively beginning in the second quarter of 2024. Certain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments. Our operating segments are not evaluated using asset information. The following table presents information about our segments (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Revenues: Google Services $ 67,986 $ 76,510 $ 196,232 $ 220,836 Google Cloud 8,411 11,353 23,896 31,274 Other Bets 297 388 870 1,248 Hedging gains (losses) (1) 17 86 191 Total revenues $ 76,693 $ 88,268 $ 221,084 $ 253,549 Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,937 $ 30,856 $ 69,128 $ 88,427 Google Cloud 266 1,947 852 4,019 Other Bets (1,194) (1,116) (3,232) (3,270) Alphabet-level activities (1,666) (3,166) (6,152) (7,758) Total income from operations $ 21,343 $ 28,521 $ 60,596 $ 81,418 See Note 2 for information relating to revenues by geography. The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions): As of As of December 31, 2023 September 30, 2024 Long-lived assets: United States $ 110,053 $ 129,318 International 38,383 45,513 Total long-lived assets $ 148,436 $ 174,831 32",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "32",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_39_chunk_0",
        "text": "Revenues by Geography The following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers: Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 United States 47 % 49 % 47 % 49 % EMEA 30 % 29 % 30 % 29 % APAC 17 % 16 % 17 % 16 % Other Americas 6 % 6 % 6 % 6 % Hedging gains (losses) 0 % 0 % 0 % 0 % For additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Use of Non-GAAP Constant Currency Information International revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates. The effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results. Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period. Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods. These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP. 39",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "39",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_40_chunk_0",
        "text": "The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages): Three Months Ended September 30, 2024 % Change from Prior Period Three Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 36,354 $ 43,139 $ 0 $ 43,139 19 % 0 % 19 % EMEA 22,661 25,472 (146) 25,618 12 % (1) % 13 % APAC 13,126 14,547 (285) 14,832 11 % (2) % 13 % Other Americas 4,553 5,093 (586) 5,679 12 % (13) % 25 % Revenues, excluding hedging effect 76,694 88,251 (1,017) 89,268 15 % (1) % 16 % Hedging gains (losses) (1) 17 Total revenues(1) $ 76,693 $ 88,268 $ 89,268 15 % 0 % (1) % 16 % (1) Total constant currency revenues of $89.3 billion for the three months ended September 30, 2024 increased $12.6 billion compared to $76.7 billion in revenues, excluding hedging effect, for the three months ended September 30, 2023. EMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Turkish lira. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso and the Brazilian real. Nine Months Ended September 30, 2024 % Change from Prior Period Nine Months Ended September 30, Constant Less Constant Less FX Currency As Hedging Less FX Currency 2023 2024 Effect Revenues Reported Effect Effect Revenues United States $ 104,291 $ 123,072 $ 0 $ 123,072 18 % 0 % 18 % EMEA 66,028 73,943 (309) 74,252 12 % 0 % 12 % APAC 37,535 41,659 (1,319) 42,978 11 % (4) % 15 % Other Americas 13,144 14,684 (1,043) 15,727 12 % (8) % 20 % Revenues, excluding hedging effect 220,998 253,358 (2,671) 256,029 15 % (1) % 16 % Hedging gains (losses) 86 191 Total revenues(1) $ 221,084 $ 253,549 $ 256,029 15 % 0 % (1) % 16 % (1) Total constant currency revenues of $256.0 billion for the nine months ended September 30, 2024 increased $35.0 billion compared to $221.1 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2023. EMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar strengthening relative to the Turkish lira was largely offset by the U.S. dollar weakening relative to the British pound. APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen. Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_40_chunk_1",
        "text": "Argentine peso. Costs and Expenses 40",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_42_chunk_0",
        "text": "Sales and Marketing The following table presents sales and marketing expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Sales and marketing expenses $ 6,884 $ 7,227 $ 20,198 $ 20,445 Sales and marketing expenses as a percentage of revenues 9 % 8 % 9 % 8 % Sales and marketing expenses increased $343 million from the three months ended September 30, 2023 to the three months ended September 30, 2024, primarily driven by an increase in advertising and promotional activities of $206 million. Sales and marketing expenses increased $247 million from the nine months ended September 30, 2023 to the nine months ended September 30, 2024, due to a combination of factors, none of which were individually significant. General and Administrative The following table presents general and administrative expenses (in millions, except percentages): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 General and administrative expenses $ 3,979 $ 3,599 $ 11,219 $ 9,783 General and administrative expenses as a percentage of revenues 5 % 4 % 5 % 4 % General and administrative expenses decreased $380 million and $1.4 billion from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024, primarily driven by a reduction in charges related to legal and other matters of $693 million and $1.4 billion, respectively, partially offset by a combination of factors, none of which were individually significant. Segment Profitability The following table presents segment operating income (loss) (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Operating income (loss): Google Services $ 23,937 $ 30,856 $ 69,128 $ 88,427 Google Cloud 266 1,947 852 4,019 Other Bets (1,194) (1,116) (3,232) (3,270) Alphabet-level activities(1) (1,666) (3,166) (6,152) (7,758) Total income from operations $ 21,343 $ 28,521 $ 60,596 $ 81,418 (1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $(1) million and $17 million for the three months ended September 30, 2023 and 2024, respectively, and $86 million and $191 million for the nine months ended September 30, 2023 and 2024, respectively. For the three and nine months ended September 30, 2023 and 2024, Alphabet-level activities included substantially all of the charges related to employee severance and our office space optimization efforts. During the quarter ended September 30, 2024, we incurred office space charges totaling $607 million. For additional information relating to our segments, see Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. 42",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "42",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_43_chunk_0",
        "text": "Google Services Google Services operating income increased $6.9 billion and $19.3 billion from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in TAC and content acquisition costs. Additionally, a reduction in compensation expenses contributed to the increase in operating income. Google Cloud Google Cloud operating income increased $1.7 billion and $3.2 billion from the three and nine months ended September 30, 2023 to the three and nine months ended September 30, 2024, respectively. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure assets as well as compensation expenses, largely driven by headcount growth. Other Bets Other Bets operating loss decreased $78 million from the three months ended September 30, 2023 to the three months ended September 30, 2024, due to a combination of factors, none of which were individually significant. Other Bets operating loss increased $38 million from the nine months ended September 30, 2023 to the nine months ended September 30, 2024. The increase in operating loss was primarily due to an increase in expenses, largely driven by compensation expenses, partially offset by an increase in revenues. The increase in compensation expenses was primarily as a result of the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period. Other Income (Expense), Net The following table presents OI&E (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Interest income $ 1,066 $ 1,243 $ 2,755 $ 3,394 Interest expense (116) (54) (239) (215) Foreign currency exchange gain (loss), net (311) 23 (789) (388) Gain (loss) on debt securities, net (503) 160 (1,100) (612) Gain (loss) on equity securities, net (366) 1,821 (194) 3,350 Performance fees 179 29 302 261 Income (loss) and impairment from equity method investments, net (215) (107) (372) (101) Other 120 70 346 465 Other income (expense), net $ (146) $ 3,185 $ 709 $ 6,154 OI&E increased $3.3 billion from the three months ended September 30, 2023 to the three months ended September 30, 2024. The increase was primarily due to an increase in net unrealized gains on equity securities driven by fair value adjustments related to observable transactions and market driven changes, and increased net gains on debt securities. OI&E increased $5.4 billion from the nine months ended September 30, 2023 to the nine months ended September 30, 2024. The increase was primarily due to an increase in net unrealized gains on non-marketable equity securities driven by fair value adjustments related to observable transactions and increased interest income related to higher interest rates. For additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. 43",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "43",
            "chunk_index": 0,
            "page_section": "segment_info"
        }
    }
]