[
    {
        "id": "goog-10-k-2022.pdf_page_40_chunk_0",
        "text": "Table of Contents Alphabet Inc. further details, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Taxes As of December 31, 2022, we had short-term and long-term income taxes payable of $1.6 billion and $4.2 billion related to a one-time transition tax payable incurred as a result of the U.S. Tax Cuts and Jobs Act (\"Tax Act\"). As permitted by the Tax Act, we will pay the transition tax in annual interest-free installments through 2025. We also have taxes payable of $5.1 billion primarily related to uncertain tax positions as of December 31, 2022. Purchase Commitments As of December 31, 2022, we had material non-cancelable contractual obligations of $32.0 billion, of which $17.3 billion was short-term. These amounts represent the non-cancelable portion of agreements or the minimum cancellation fee and are primarily related to commitments to purchase licenses, technical infrastructure, inventory, and network capacity. For those agreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of December 31, 2022. In addition we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable. Critical Accounting Estimates We prepare our consolidated financial statements in accordance with GAAP. In doing so, we have to make estimates and assumptions. Our critical accounting estimates are those estimates that involve a significant level of uncertainty at the time the estimate was made, and changes in them have had or are reasonably likely to have a material effect on our financial condition or results of operations. Accordingly, actual results could differ materially from our estimates. We base our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis. We have reviewed our critical accounting estimates with the Audit and Compliance Committee of our Board of Directors. See Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for a summary of significant accounting policies and the effect on our financial statements. Fair Value Measurements of Non-Marketable Equity Securities We measure certain financial instruments at fair value on a nonrecurring basis, consisting primarily of our non- marketable equity securities. These investments are accounted for under the measurement alternative method (\"the measurement alternative\") and are measured at cost, less impairment, subject to upward and downward adjustments resulting from observable price changes for identical or similar investments of the same issuer. These adjustments require quantitative assessments of the fair value of our securities, which may require the use of unobservable inputs. Pricing adjustments are determined by using various valuation methodologies and involve the use of estimates using the best information available, which may include cash flow",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "40",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_40_chunk_1",
        "text": "projections or other available market data. Non-marketable equity securities are also evaluated for impairment, based on qualitative factors including the companies' financial and liquidity position and access to capital resources, among others. When indicators of impairment exist, we prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach, which requires judgment and the use of unobservable inputs, including discount rates, investee revenues and costs, and comparable market data of private and public companies, among others. When the quantitative remeasurements of fair value indicate an impairment exists, we write down the investment to its current fair value. We also have compensation arrangements with payouts based on realized returns from certain investments, i.e. performance fees. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs. Property and Equipment We assess the reasonableness of the useful lives of our property and equipment periodically as well as when other changes occur, such as when there are changes to ongoing business operations, changes in the planned use and utilization of assets, or technological advancements, that could indicate a change in the period over which we expect to benefit from the assets. 39",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "40",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_45_chunk_0",
        "text": "Table of Contents Alphabet Inc. REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM To the Stockholders and the Board of Directors of Alphabet Inc. Opinion on the Financial Statements We have audited the accompanying consolidated balance sheets of Alphabet Inc. (the Company) as of December 31, 2021 and 2022, the related consolidated statements of income, comprehensive income, stockholders' equity and cash flows for each of the three years in the period ended December 31, 2022, and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2021 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2022, in conformity with U.S. generally accepted accounting principles. We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2022, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 2, 2023 expressed an unqualified opinion thereon. Basis for Opinion These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the U.S. Securities and Exchange Commission and the PCAOB. We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. Critical Audit Matter The critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "45",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_45_chunk_1",
        "text": "a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates. 44",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "45",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_53_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers with infrastructure and platform services as well as communication and collaboration tools; sales of other products and services, such as apps and in-app purchases, and hardware; and fees received for subscription- based products. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Use of Estimates Preparation of consolidated financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates due to uncertainties. On an ongoing basis, we evaluate our estimates, including those related to the allowance for credit losses; fair values of financial instruments, intangible assets, and goodwill; inventory; useful lives of intangible assets and property and equipment; income taxes; and contingent liabilities, among others. We base our estimates on assumptions, both historical and forward looking, that are believed to be reasonable, and the results of which form the basis for making judgments about the carrying values of assets and liabilities. In January 2023, we completed an assessment of the useful lives of our servers and network equipment and adjusted the estimated useful life of our servers from four years to six years and the estimated useful life of certain network equipment from five years to six years. This change in accounting estimate is effective beginning in fiscal year 2023. Stock Split Effected in the Form of a Stock Dividend (“Stock Split”) On February 1, 2022, the company announced that the Board of Directors had approved and declared a 20-for- one stock split in the form of a one-time special stock dividend on each share of the company’s Class A, Class B, and Class C stock. The Stock Split had a record date of July 1, 2022 and an effective date of July 15, 2022. The par value per share of our Class A, Class B, and Class C stock remains unchanged at $0.001 per share after the Stock Split. All prior period references made to share or per share amounts in the accompanying consolidated financial statements and applicable disclosures prior to the effective date have been retroactively adjusted to reflect the effects of the Stock Split. Revenue Recognition Revenues are recognized when control of the promised goods or services is transferred to our customers, and the collectibility of an amount that we expect in exchange for those goods or services is probable. Sales and other similar",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "53",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_53_chunk_1",
        "text": "taxes are excluded from revenues. Advertising Revenues We generate advertising revenues primarily by delivering advertising on: • Google Search and other properties, including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc. and other Google owned and operated properties like Gmail, Google Maps, and Google Play; • YouTube properties; and • Google Network properties, including revenues from Google Network properties participating in AdMob, AdSense, and Google Ad Manager. Our customers generally purchase advertising inventory through Google Ads, Google Ad Manager, and Google Marketing Platform, among others. 52",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "53",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_56_chunk_0",
        "text": "Table of Contents Alphabet Inc. liabilities recorded at fair value are measured and classified in accordance with a three-tier fair value hierarchy based on the observability of the inputs available in the market used to measure fair value: Level 1 - Observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets. Level 2 - Inputs that are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant inputs are observable in the market or can be derived from observable market data. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, foreign exchange rates, and credit ratings. Level 3 - Unobservable inputs that are supported by little or no market activities. The fair value hierarchy requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The determination of fair value involves the use of appropriate valuation methods and relevant inputs into valuation models. Our financial assets and liabilities that are measured at fair value on a recurring basis include cash equivalents, marketable securities, derivative financial instruments, and certain non-marketable debt securities. Our financial assets measured at fair value on a nonrecurring basis include non-marketable equity securities. Other financial assets and liabilities are carried at cost with fair value disclosed, if required. We measure certain other instruments, including stock-based compensation awards settled in the stock of certain Other Bets, and certain assets and liabilities acquired in a business combination, also at fair value on a nonrecurring basis. Financial Instruments Our financial instruments include cash, cash equivalents, marketable and non-marketable securities, derivative financial instruments and accounts receivable. Credit Risks We are subject to credit risk from cash equivalents, marketable securities, derivative financial instruments, including foreign exchange contracts, and accounts receivable. We manage our credit risk exposure through timely assessment of our counterparty creditworthiness, credit limits and use of collateral management. Foreign exchange contracts are transacted with various financial institutions with high credit standing. Accounts receivable are typically unsecured and are derived from revenues earned from customers located around the world. We manage our credit risk exposure by performing ongoing evaluations to determine customer credit and we limit the amount of credit we extend. We generally do not require collateral from our customers. Cash Equivalents We invest excess cash primarily in government bonds, corporate debt securities, mortgage-backed and asset- backed securities, time deposits, and money market funds. Marketable Securities We classify all marketable debt securities that have effective maturities of three months or less from the date of purchase as cash equivalents and those with effective maturities of greater than three months as marketable securities on our Consolidated Balance Sheets. We determine the appropriate classification of our investments in marketable debt securities at the time of purchase and reevaluate such designation",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "56",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_56_chunk_1",
        "text": "at each balance sheet date. We have classified and accounted for our marketable debt securities as available-for-sale. After consideration of our risk versus reward objectives, as well as our liquidity requirements, we may sell these debt securities prior to their effective maturities. As we view these securities as available to support current operations, we classify highly liquid securities with maturities beyond 12 months as current assets under the caption marketable securities on the Consolidated Balance Sheets. We carry these securities at fair value, and report the unrealized gains and losses, net of taxes, as a component of stockholders’ equity, except for the changes in allowance for expected credit losses, which are recorded in other income (expense), net. For certain marketable debt securities we have elected the fair value option, for which changes in fair value are recorded in other income (expense), net. We determine any realized gains or losses on the sale of marketable debt securities on a specific identification method, and we record such gains and losses as a component of other income (expense), net. Our investments in marketable equity securities are measured at fair value with the related gains and losses, including unrealized, recognized in other income (expense), net. We classify our marketable equity securities subject 55",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "56",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_57_chunk_0",
        "text": "Table of Contents Alphabet Inc. to long-term lock-up restrictions beyond twelve months as other non-current assets on the Consolidated Balance Sheets. Non-Marketable Securities We account for non-marketable equity securities through which we exercise significant influence but do not have control over the investee under the equity method, All other non-marketable equity securities that we hold are primarily accounted for under the measurement alternative. Under the measurement alternative, the carrying value is measured at cost, less any impairment, plus or minus changes resulting from observable price changes in orderly transactions for identical or similar investments of the same issuer. Adjustments are determined primarily based on a market approach as of the transaction date and are recorded as a component of other income (expense), net. Non-marketable debt securities are classified as available-for-sale securities. Non-marketable securities that do not have effective contractual maturity dates are classified as other non- current assets on the Consolidated Balance Sheets. Derivative Financial Instruments See Note 3 for the accounting policy pertaining to derivative financial instruments. Accounts Receivable Our payment terms for accounts receivable vary by the types and locations of our customers and the products or services offered. The term between invoicing and when payment is due is not significant. For certain products or services and customers, we require payment before the products or services are delivered to the customer. Additionally, accounts receivable includes amounts for services performed in advance of the right to invoice the customer. We maintain an allowance for credit losses for accounts receivable, which is recorded as an offset to accounts receivable, and changes in such are classified as general and administrative expense in the Consolidated Statements of Income. We assess collectibility by reviewing accounts receivable on a collective basis where similar characteristics exist and on an individual basis when we identify specific customers with known disputes or collectibility issues. In determining the amount of the allowance for credit losses, we consider historical collectibility based on past due status and make judgments about the creditworthiness of customers based on ongoing credit evaluations. We also consider customer-specific information, current market conditions, and reasonable and supportable forecasts of future economic conditions. Other Our financial instruments also include debt and equity investments in companies with which we also have commercial arrangements. For these transactions, judgment is required to assess the substance of the arrangements, whether the arrangements and each component of the arrangements should be accounted for as separate transactions under the applicable GAAP, as well as the determination of the value of the components of the arrangements, including the fair value of the investments. Impairment of Investments We periodically review our debt and non-marketable equity securities for impairment. For debt securities in an unrealized loss position, we determine whether a credit loss exists. The credit loss is estimated by considering available information relevant to the collectibility of the security and information about past events, current conditions, and reasonable and supportable forecasts. Any credit loss is recorded as a charge to other income (expense), net, not",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "57",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_57_chunk_1",
        "text": "to exceed the amount of the unrealized loss. Unrealized losses other than the credit loss are recognized in AOCI. If we have an intent to sell, or if it is more likely than not that we will be required to sell a debt security in an unrealized loss position before recovery of its amortized cost basis, we will write down the security to its fair value and record the corresponding charge as a component of other income (expense), net. For non-marketable equity securities, including equity method investments, we consider whether impairment indicators exist by evaluating the companies' financial and liquidity position and access to capital resources, among other indicators. If the assessment indicates that the investment is impaired, we write down the investment to its fair value by recording the corresponding charge as a component of other income (expense), net. We prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach. 56",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "57",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_61_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 3. Financial Instruments Fair Value Measurements Investments measured at fair value on a recurring basis Cash, cash equivalents, and marketable equity securities are measured at fair value and classified within Level 1 and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets. Debt securities are classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in other income (expense), net. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts. The following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions): As of December 31, 2021 Gross Gross Cash and Fair Value Adjusted Unrealized Unrealized Cash Marketable Hierarchy Cost Gains Losses Fair Value Equivalents Securities Fair value changes recorded in other comprehensive income Time deposits(1) Level 2 $ 5,133 $ 0 $ 0 $ 5,133 $ 5,133 $ 0 Government bonds Level 2 53,288 258 (238) 53,308 5 53,303 Corporate debt securities Level 2 35,605 194 (223) 35,576 12 35,564 Mortgage-backed and asset-backed securities Level 2 18,829 96 (112) 18,813 0 18,813 Total investments with fair value change reflected in Other Comprehensive Income(2) $ 112,855 $ 548 $ (573) $ 112,830 $ 5,150 $ 107,680 Fair value adjustments recorded in net income Money market funds Level 1 $ 7,499 $ 7,499 $ 0 Current marketable Level 1 equity securities(3) 5,998 0 5,998 Mutual funds Level 2 351 0 351 Government bonds Level 2 1,165 0 1,165 Corporate debt securities Level 2 2,503 0 2,503 Mortgage-backed and Level 2 asset-backed securities 1,007 0 1,007 Total investments with fair value change recorded in Net Income $ 18,523 $ 7,499 $ 11,024 Cash 0 8,296 0 Total $ 112,855 $ 548 $ (573) $ 131,353 $ 20,945 $ 118,704 (1) The majority of our time deposits are domestic deposits. (2) Represents gross unrealized gains and losses for debt securities recorded to AOCI. (3) The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $1.4 billion as of December 31, 2021 is included within other non-current assets. 60",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "61",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_62_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of December 31, 2022 Gross Gross Cash and Fair Value Adjusted Unrealized Unrealized Cash Marketable Hierarchy Cost Gains Losses Fair Value Equivalents Securities Fair value changes recorded in other comprehensive income Time deposits(1) Level 2 $ 5,297 $ 0 $ 0 $ 5,297 $ 5,293 $ 4 Government bonds Level 2 41,036 64 (2,045) 39,055 283 38,772 Corporate debt securities Level 2 28,578 8 (1,569) 27,017 1 27,016 Mortgage-backed and 16,176 5 (1,242) 14,939 0 14,939 asset-backed securities Level 2 Total investments with fair value change reflected in Other Comprehensive Income(2) $ 91,087 $ 77 $ (4,856) $ 86,308 $ 5,577 $ 80,731 Fair value adjustments recorded in net income Money market funds Level 1 $ 7,234 $ 7,234 $ 0 Current marketable equity securities(3) Level 1 4,013 0 4,013 Mutual funds Level 2 339 0 339 Government bonds Level 2 1,877 440 1,437 Corporate debt securities Level 2 3,744 65 3,679 Mortgage-backed and Level 2 asset-backed securities 1,686 2 1,684 Total investments with fair value change recorded in Net Income $ 18,893 $ 7,741 $ 11,152 Cash 0 8,561 0 Total $ 91,087 $ 77 $ (4,856) $ 105,201 $ 21,879 $ 91,883 (1) The majority of our time deposits are domestic deposits. (2) Represents gross unrealized gains and losses for debt securities recorded to AOCI. (3) The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $803 million as of December 31, 2022 is included within other non-current assets. Investments measured at fair value on a nonrecurring basis Our non-marketable equity securities are investments in privately held companies without readily determinable market values. The carrying value of our non-marketable equity securities is adjusted to fair value upon observable transactions for identical or similar investments of the same issuer or impairment. Non-marketable equity securities that have been remeasured during the period based on observable transactions are classified within Level 2 or Level 3 in the fair value hierarchy because we estimate the value based on valuation methods which may include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, rights, and obligations of the securities we hold. The fair value of non-marketable equity securities that have been remeasured due to impairment are classified within Level 3. During the year ended December 31, 2022, included in the $28.5 billion of non-marketable equity securities held as of the end of the period, $14.1 billion were measured at fair value and primarily classified as Level 2 investments. 61",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "62",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_68_chunk_0",
        "text": "Table of Contents Alphabet Inc. The gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions): As of December 31, 2021 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Amounts Presented in Cash and Offset in the the Non-Cash Gross Consolidated Consolidated Collateral Amounts Balance Balance Financial Received or Recognized Sheets Sheets Instruments(1) Pledged Net Amounts Derivatives assets $ 999 $ (38) $ 961 $ (434) $ (406) $ 121 Derivatives liabilities $ 619 $ (38) $ 581 $ (434) $ (114) $ 33 As of December 31, 2022 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Amounts Presented in Cash and Offset in the the Non-Cash Gross Consolidated Consolidated Collateral Amounts Balance Balance Financial Received or Recognized Sheets Sheets Instruments(1) Pledged Net Amounts Derivatives assets $ 760 $ (84) $ 676 $ (463) $ (132) $ 81 Derivatives liabilities $ 894 $ (84) $ 810 $ (463) $ (28) $ 319 (1) The balances as of December 31, 2021 and 2022 were related to derivatives allowed to be net settled in accordance with our master netting agreements. Note 4. Leases We have entered into operating lease agreements primarily for data centers, land, and offices throughout the world with lease periods expiring between 2023 and 2063. Components of operating lease expense were as follows (in millions): Year Ended December 31, 2020 2021 2022 Operating lease cost $ 2,267 $ 2,699 $ 2,900 Variable lease cost 619 726 838 Total operating lease cost $ 2,886 $ 3,425 $ 3,738 Supplemental information related to operating leases was as follows (in millions): Year Ended December 31, 2020 2021 2022 Cash payments for operating leases $ 2,004 $ 2,489 $ 2,722 New operating lease assets obtained in exchange for operating lease liabilities $ 2,765 $ 2,951 $ 4,383 67",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "68",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_69_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of December 31, 2022, our operating leases had a weighted average remaining lease term of eight years and a weighted average discount rate of 2.8%. Future lease payments under operating leases as of December 31, 2022 were as follows (in millions): 2023 $ 2,955 2024 2,771 2025 2,377 2026 1,953 2027 1,502 Thereafter 5,882 Total future lease payments 17,440 Less imputed interest (2,462) Total lease liability balance $ 14,978 As of December 31, 2022, we have entered into leases that have not yet commenced with short-term and long- term future lease payments of $630 million and $3.1 billion that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2023 and 2026 with non-cancelable lease terms between 1 and 25 years. Note 5. Variable Interest Entities Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2021 and 2022, assets that can only be used to settle obligations of these VIEs were $6.0 billion and $4.1 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.5 billion and $2.6 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Total noncontrolling interests (NCI) in our consolidated subsidiaries were $4.3 billion and $3.8 billion as of December 31, 2021 and 2022, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. We have determined that the single source of our exposure to these VIEs is our capital investments in them. The carrying value and maximum exposure of these unconsolidated VIEs were $2.7 billion and $2.9 billion, respectively, as of December 31, 2021 and $2.7 billion and $2.8 billion, respectively, as",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "69",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_69_chunk_1",
        "text": "of December 31, 2022. Note 6. Debt Short-Term Debt We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2021 and 2022. Our short-term debt balance also includes the current portion of certain long-term debt. 68",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "69",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_81_chunk_0",
        "text": "Table of Contents Alphabet Inc. Provision for income taxes consisted of the following (in millions): Year Ended December 31, 2020 2021 2022 Current: Federal and state $ 4,789 $ 10,126 $ 17,120 Foreign 1,687 2,692 2,434 Total 6,476 12,818 19,554 Deferred: Federal and state 1,552 2,018 (8,052) Foreign (215) (135) (146) Total 1,337 1,883 (8,198) Provision for income taxes $ 7,813 $ 14,701 $ 11,356 The reconciliation of federal statutory income tax rate to our effective income tax rate was as follows: Year Ended December 31, 2020 2021 2022 U.S. federal statutory tax rate 21.0 % 21.0 % 21.0 % Foreign income taxed at different rates (0.3) 0.2 3.0 Foreign-derived intangible income deduction (3.0) (2.5) (5.4) Stock-based compensation expense (1.7) (2.5) (1.2) Federal research credit (2.3) (1.6) (2.2) Deferred tax asset valuation allowance 1.4 0.6 0.9 State and local income taxes 1.1 1.0 0.8 Other 0.0 0.0 (1.0) Effective tax rate 16.2 % 16.2 % 15.9 % In 2022, there was an increase in the U.S. Foreign Derived Intangible Income tax deduction from the effects of capitalization and amortization of R&D expenses in 2022 as required by the 2017 Tax Cuts and Jobs Act. 80",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "81",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_87_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES We have filed the following documents as part of this Annual Report on Form 10-K: 1. Consolidated Financial Statements Reports of Independent Registered Public Accounting Firm 44 Financial Statements: Consolidated Balance Sheets 47 Consolidated Statements of Income 48 Consolidated Statements of Comprehensive Income 49 Consolidated Statements of Stockholders’ Equity 50 Consolidated Statements of Cash Flows 51 Notes to Consolidated Financial Statements 52 2. Financial Statement Schedules Schedule II: Valuation and Qualifying Accounts The table below details the activity of the allowance for credit losses and sales credits for the years ended December 31, 2020, 2021, and 2022 (in millions): Balance at Balance at Beginning of Year Additions Usage End of Year Year ended December 31, 2020 $ 753 $ 2,013 $ (1,422) $ 1,344 Year ended December 31, 2021 $ 1,344 $ 2,092 $ (2,047) $ 1,389 Year ended December 31, 2022 $ 1,389 $ 2,125 $ (2,301) $ 1,213 Note: Additions to the allowance for credit losses are charged to expense. Additions to the allowance for sales credits are charged against revenues. All other schedules have been omitted because they are not required, not applicable, or the required information is otherwise included. 3. Exhibits Incorporated by reference herein Exhibit Number Description Form Date 2.01 Agreement and Plan of Merger, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, by and among Google Inc., (File No. 001-37580) the Registrant and Maple Technologies Inc. 3.01 Amended and Restated Certificate of Current Report on Form 8-K June 3, 2022 Incorporation of the Registrant (File No. 001-37580) 3.02 Amended and Restated Bylaws of the Current Report on Form 8-K October 25, 2022 Registrant, dated October 19, 2022 (File No. 001-37580) 4.01 Specimen Class A Common Stock certificate Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.02 Specimen Class C Capital Stock certificate Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.03 Alphabet Inc. Deferred Compensation Plan Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.04 Transfer Restriction Agreement, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, between the Registrant and (File No. 001-37580) Larry Page and certain of his affiliates 4.05 Transfer Restriction Agreement, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, between the Registrant and (File No. 001-37580) Sergey Brin and certain of his affiliates 4.06 Joinder Agreement, dated December 31, Annual Report on Form 10-K February 2, 2022 2021, among the Registrant, Sergey Brin and (File No. 001-37580) certain of his affiliates 86",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "87",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_3_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-K For the Fiscal Year Ended December 31, 2023 TABLE OF CONTENTS Page Note About Forward-Looking Statements 3 PART I Item 1. Business 4 Item 1A. Risk Factors 11 Item 1B. Unresolved Staff Comments 24 Item 1C. Cybersecurity 24 Item 2. Properties 25 Item 3. Legal Proceedings 25 Item 4. Mine Safety Disclosures 25 PART II Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases 25 of Equity Securities Item 6. [Reserved] 28 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations 29 Item 7A. Quantitative and Qualitative Disclosures About Market Risk 45 Item 8. Financial Statements and Supplementary Data 47 Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure 88 Item 9A. Controls and Procedures 88 Item 9B. Other Information 89 Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections 89 PART III Item 10. Directors, Executive Officers, and Corporate Governance 90 Item 11. Executive Compensation 90 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder 90 Matters Item 13. Certain Relationships and Related Transactions, and Director Independence 90 Item 14. Principal Accountant Fees and Services 90 PART IV Item 15. Exhibits, Financial Statement Schedules 91 Item 16. Form 10-K Summary 94 Signatures 2.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "3",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_44_chunk_0",
        "text": "Table of Contents Alphabet Inc. European Commission Fines In 2017, 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €2.4 billion ($2.7 billion as of June 27, 2017), €4.3 billion ($5.1 billion as of June 30, 2018), and €1.5 billion ($1.7 billion as of March 20, 2019), respectively. On September 14, 2022, the General Court reduced the 2018 fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal to the European Court of Justice. While each EC decision is under appeal, we included the fines in accrued expenses and other current liabilities on our Consolidated Balance Sheets as we provided bank guarantees (in lieu of a cash payment) for the fines. For additional information, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Taxes As of December 31, 2023, we had income taxes payable of $4.2 billion, of which $2.1 billion was short-term, related to a one-time transition tax payable incurred as a result of the U.S. Tax Cuts and Jobs Act (\"Tax Act\"). As permitted by the Tax Act, we will pay the transition tax in annual interest-free installments through 2025. We also have long-term taxes payable of $6.3 billion primarily related to uncertain tax positions as of December 31, 2023. Purchase Commitments and Other Contractual Obligations As of December 31, 2023, we had material purchase commitments and other contractual obligations of $45.9 billion, of which $31.6 billion was short-term. These amounts primarily consist of purchase orders for certain technical infrastructure as well as the non-cancelable portion or the minimum cancellation fee in certain agreements related to commitments to purchase licenses, including content licenses, inventory and network capacity. For those agreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of December 31, 2023. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. In addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable. Critical Accounting Estimates We prepare our consolidated financial statements in accordance with GAAP. In doing so, we have to make estimates and assumptions. Our critical accounting estimates are those estimates that involve a significant level of uncertainty at the time the estimate was made, and changes in them have had or are reasonably likely to have a material effect on our financial condition or results of operations. Accordingly, actual results could differ materially from our estimates. We base",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "44",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_44_chunk_1",
        "text": "our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis. We have reviewed our critical accounting estimates with the Audit and Compliance Committee of our Board of Directors. For a summary of significant accounting policies and the effect on our financial statements, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Fair Value Measurements of Non-Marketable Equity Securities We measure certain financial instruments at fair value on a nonrecurring basis, consisting primarily of our non- marketable equity securities. These investments are accounted for under the measurement alternative method (\"the measurement alternative\") and are measured at cost, less impairment, subject to upward and downward adjustments resulting from observable price changes for identical or similar investments of the same issuer. These adjustments require quantitative assessments of the fair value of our securities, which may require the use of unobservable inputs. Adjustments are determined primarily based on a market approach as of the transaction date and involve the use of estimates using the best information available, which may include cash flow projections or other available market data. Non-marketable equity securities are also evaluated for impairment, based on qualitative factors including the companies' financial and liquidity position and access to capital resources, among others. When indicators of impairment exist, we prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach, which requires judgment and the use of unobservable inputs, including discount rates, investee revenues and costs, and comparable market data of private and public companies, among others. 43.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "44",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_45_chunk_0",
        "text": "Table of Contents Alphabet Inc. When the quantitative remeasurements of fair value indicate an impairment exists, we write down the investment to its current fair value. We also have compensation arrangements with payouts based on realized returns from certain investments, i.e. performance fees. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs. Property and Equipment We assess the reasonableness of the useful lives of our property and equipment periodically as well as when other changes occur, such as when there are changes to ongoing business operations, changes in the planned use and utilization of assets, or technological advancements, that could indicate a change in the period over which we expect to benefit from the assets. Income Taxes We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. Recording an uncertain tax position involves various qualitative considerations, including evaluation of comparable and resolved tax exposures, applicability of tax laws, and likelihood of settlement. We evaluate uncertain tax positions periodically, considering changes in facts and circumstances, such as new regulations or recent judicial opinions, as well as the status of audit activities by taxing authorities. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final tax outcome of these matters will not be different. To the extent that the final tax outcome of these matters is different than the amounts recorded, such differences will affect the provision for income taxes and the effective tax rate in the period in which such determination is made. The provision for income taxes includes the effect of reserve provisions and changes to reserves as well as the related net interest and penalties. In addition, we are subject to the continuous examination of our income tax returns by the IRS and other tax authorities which may assert assessments against us. We regularly assess the likelihood of adverse outcomes resulting from these examinations and assessments to determine the adequacy of our provision for income taxes. Loss Contingencies We are regularly subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, privacy, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury consumer protection, and other matters. Certain of these matters include speculative claims for substantial or indeterminate amounts of damages. We record a liability when we believe that it is probable that a loss has been incurred and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the possible loss in Note 10 of the Notes to Consolidated",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "45",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_45_chunk_1",
        "text": "Financial Statements included in Item 8 of this Annual Report on Form 10-K. We evaluate, on a regular basis, developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments and changes to our disclosures. Significant judgment is required to determine both the likelihood and the estimated amount of a loss related to such matters. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material. Change in Accounting Estimate In January 2023, we completed an assessment of the useful lives of our servers and network equipment resulting in a change in the estimated useful life of our servers and certain network equipment to six years. This change in accounting estimate was effective beginning fiscal year 2023. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. 44.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "45",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_49_chunk_0",
        "text": "Table of Contents Alphabet Inc. REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM To the Stockholders and the Board of Directors of Alphabet Inc. Opinion on the Financial Statements We have audited the accompanying consolidated balance sheets of Alphabet Inc. (the Company) as of December 31, 2022 and 2023, the related consolidated statements of income, comprehensive income, stockholders' equity and cash flows for each of the three years in the period ended December 31, 2023, and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2022 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2023, in conformity with U.S. generally accepted accounting principles. We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2023, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated January 30, 2024 expressed an unqualified opinion thereon. Basis for Opinion These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. Critical Audit Matter The critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "49",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_49_chunk_1",
        "text": "whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates. 48.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "49",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_63_chunk_0",
        "text": "Table of Contents Alphabet Inc. to generate. If the carrying value of the assets or asset group is not recoverable, the impairment recognized is measured as the amount by which the carrying value exceeds its fair value. Income Taxes We account for income taxes using the asset and liability method, under which we recognize the amount of taxes payable or refundable for the current year and deferred tax assets and liabilities for the future tax consequences of events that have been recognized in our financial statements or tax returns. We measure current and deferred tax assets and liabilities based on provisions of enacted tax law. We evaluate the likelihood of future realization of our deferred tax assets based on all available evidence and establish a valuation allowance to reduce deferred tax assets when it is more likely than not that they will not be realized or release a valuation allowance to increase deferred tax assets when it is more likely than not that they will be realized. We have elected to account for the tax effects of the global intangible low tax Income provision as a current period expense. We recognize the financial statement effects of a tax position when it is more likely than not that, based on technical merits, the position will be sustained upon examination. The tax benefits of the position recognized in the financial statements are then measured based on the largest amount of benefit that is greater than 50% likely to be realized upon settlement with a taxing authority. In addition, we recognize interest and penalties related to unrecognized tax benefits as a component of the income tax provision. Business Combinations We include the results of operations of the businesses that we acquire as of the acquisition date. We allocate the purchase price of the acquisitions to the assets acquired and liabilities assumed based on their estimated fair values, except for revenue contracts acquired, which are recognized in accordance with our revenue recognition policy. The excess of the purchase price over the fair values of identifiable assets and liabilities is recorded as goodwill. Acquisition-related expenses are recognized separately from the business combination and are expensed as incurred. Foreign Currency We translate the financial statements of our international subsidiaries to U.S. dollars using month-end exchange rates for assets and liabilities, and average rates for the annual period derived from month-end exchange rates for revenues, costs, and expenses. We record translation gains and losses in AOCI as a component of stockholders’ equity. We reflect net foreign exchange transaction gains and losses resulting from the conversion of the transaction currency to functional currency as a component of foreign currency exchange gain (loss) in OI&E. Recent Accounting Pronouncements In November 2023, the Financial Standards Accounting Board (FASB) issued Accounting Standards Update (ASU) 2023-07 \"Segment Reporting (Topic 280):Improvements to Reportable Segment Disclosures\" which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. ASU 2023-07 is effective for our annual periods beginning January",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "63",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_63_chunk_1",
        "text": "1, 2024, and for interim periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures. In December 2023, the FASB issued ASU 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes, specifically related to the rate reconciliation and income taxes paid. ASU 2023-09 is effective for our annual periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 62.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "63",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_92_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES We have filed the following documents as part of this Annual Report on Form 10-K: 1. Consolidated Financial Statements Reports of Independent Registered Public Accounting Firm 48 Financial Statements: Consolidated Balance Sheets 51 Consolidated Statements of Income 52 Consolidated Statements of Comprehensive Income 53 Consolidated Statements of Stockholders’ Equity 54 Consolidated Statements of Cash Flows 55 Notes to Consolidated Financial Statements 56 2. Financial Statement Schedules Schedule II: Valuation and Qualifying Accounts The table below details the activity of the allowance for credit losses and sales credits for the years ended December 31, 2021, 2022, and 2023 (in millions): Balance at Balance at Beginning of Year Additions Usage End of Year Year ended December 31, 2021 $ 1,344 $ 2,092 $ (2,047) $ 1,389 Year ended December 31, 2022 $ 1,389 $ 2,125 $ (2,301) $ 1,213 Year ended December 31, 2023 $ 1,213 $ 3,115 $ (2,737) $ 1,591 Note: Additions to the allowance for credit losses are charged to expense. Additions to the allowance for sales credits are charged against revenues. All other schedules have been omitted because they are not required, not applicable, or the required information is otherwise included. 3. Exhibits Incorporated by reference herein Exhibit Number Description Form Date 2.01 Agreement and Plan of Merger, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, by and among Google Inc., (File No. 001-37580) the Registrant and Maple Technologies Inc. 3.01 Amended and Restated Certificate of Current Report on Form 8-K June 3, 2022 Incorporation of the Registrant (File No. 001-37580) 3.02 Amended and Restated Bylaws of the Current Report on Form 8-K October 25, 2022 Registrant, dated October 19, 2022 (File No. 001-37580) 4.01 Specimen Class A Common Stock certificate Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.02 Specimen Class C Capital Stock certificate Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.03 Alphabet Inc. Deferred Compensation Plan Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.04 Transfer Restriction Agreement, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, between the Registrant and (File No. 001-37580) Larry Page and certain of his affiliates 4.05 Transfer Restriction Agreement, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, between the Registrant and (File No. 001-37580) Sergey Brin and certain of his affiliates 4.06 Joinder Agreement, dated December 31, Annual Report on Form 10-K February 2, 2022 2021, among the Registrant, Sergey Brin and (File No. 001-37580) certain of his affiliates 91.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "92",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_3_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-K For the Fiscal Year Ended December 31, 2024 TABLE OF CONTENTS Page Note About Forward-Looking Statements 3 PART I Item 1. Business 4 Item 1A. Risk Factors 10 Item 1B. Unresolved Staff Comments 25 Item 1C. Cybersecurity 25 Item 2. Properties 26 Item 3. Legal Proceedings 26 Item 4. Mine Safety Disclosures 26 PART II Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases 27 of Equity Securities Item 6. [Reserved] 29 Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations 30 Item 7A. Quantitative and Qualitative Disclosures About Market Risk 45 Item 8. Financial Statements and Supplementary Data 48 Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure 90 Item 9A. Controls and Procedures 90 Item 9B. Other Information 90 Item 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections 91 PART III Item 10. Directors, Executive Officers, and Corporate Governance 92 Item 11. Executive Compensation 92 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder 92 Matters Item 13. Certain Relationships and Related Transactions, and Director Independence 92 Item 14. Principal Accountant Fees and Services 92 PART IV Item 15. Exhibits, Financial Statement Schedules 93 Item 16. Form 10-K Summary 96 Signatures 2.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "3",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_35_chunk_0",
        "text": "Table of Contents Alphabet Inc. Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative. The main components of our R&D expenses are: • depreciation; • employee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and • third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts. The main components of our sales and marketing expenses are: • employee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and • spend relating to our advertising and promotional activities in support of our products and services. The main components of our general and administrative expenses are: • employee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; • expenses relating to legal and other matters, including certain fines and settlements; and • third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services. Other Income (Expense), Net OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments. For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Item 8 as well as Item 7A Quantitative and Qualitative Disclosures About Market Risk of this Annual Report on Form 10-K. Provision for Income Taxes Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties. For additional information, including a reconciliation of the U.S. federal statutory rate to our effective tax rate, see Note 14 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. 34.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "35",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_45_chunk_0",
        "text": "Table of Contents Alphabet Inc. with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of December 31, 2024. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. In addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable. Critical Accounting Estimates We prepare our consolidated financial statements in accordance with GAAP. In doing so, we have to make estimates and assumptions. Our critical accounting estimates are those estimates that involve a significant level of uncertainty at the time the estimate was made, and changes in them have had or are reasonably likely to have a material effect on our financial condition or results of operations. Accordingly, actual results could differ materially from our estimates. We base our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis. We have reviewed our critical accounting estimates with the Audit and Compliance Committee of our Board of Directors. For a summary of significant accounting policies and the effect on our financial statements, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. Fair Value Measurements of Non-Marketable Equity Securities We measure certain financial instruments at fair value on a nonrecurring basis, consisting primarily of our non- marketable equity securities. These investments are accounted for under the measurement alternative method (\"the measurement alternative\") and are measured at cost, less impairment, subject to upward and downward adjustments resulting from observable price changes for identical or similar investments of the same issuer. These adjustments require quantitative assessments of the fair value of our securities, which may require the use of unobservable inputs. Adjustments are determined primarily based on a market approach as of the transaction date and involve the use of estimates using the best information available, which may include cash flow projections or other available market data. Non-marketable equity securities are also evaluated for impairment, based on qualitative factors including the companies' financial and liquidity position and access to capital resources, among others. When indicators of impairment exist, we prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach, which requires judgment and the use of unobservable inputs, including discount rates, investee revenues and costs, and comparable market data of private and public companies, among others. When the quantitative remeasurements of fair value indicate an impairment exists, we write down",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "45",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_45_chunk_1",
        "text": "the investment to its current fair value. We also have compensation arrangements with payouts based on realized returns from certain investments, i.e. performance fees. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs. Property and Equipment We assess the reasonableness of the useful lives of our property and equipment periodically as well as when other changes occur, such as when there are changes to ongoing business operations, changes in the planned use and utilization of assets, or technological advancements, that could indicate a change in the period over which we expect to benefit from the asset. Income Taxes We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. Recording an uncertain tax position involves various qualitative considerations, including evaluation of comparable and resolved tax exposures, applicability of tax laws, and likelihood of settlement. We evaluate uncertain tax positions periodically, considering changes in facts and circumstances, such as new regulations or recent judicial opinions, as well as the status of audit activities by taxing authorities. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final tax outcome of these matters will not be different. To the extent that the final tax outcome of these matters is different than the amounts recorded, such 44.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "45",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_50_chunk_0",
        "text": "Table of Contents Alphabet Inc. REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM To the Stockholders and the Board of Directors of Alphabet Inc. Opinion on the Financial Statements We have audited the accompanying consolidated balance sheets of Alphabet Inc. (the Company) as of December 31, 2023 and 2024, the related consolidated statements of income, comprehensive income, stockholders' equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2023 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 4, 2025 expressed an unqualified opinion thereon. Basis for Opinion These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. Critical Audit Matter The critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "50",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_50_chunk_1",
        "text": "whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates. 49.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "50",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_62_chunk_0",
        "text": "Table of Contents Alphabet Inc. Non-marketable securities that do not have effective contractual maturity dates are classified as other non- current assets on the Consolidated Balance Sheets. Derivative Financial Instruments See Note 3 for the accounting policy pertaining to derivative financial instruments. Accounts Receivable Our payment terms for accounts receivable vary by the types and locations of our customers and the products or services offered. The term between invoicing and when payment is due is not significant. For certain products or services and customers, we require payment before the products or services are delivered to the customer. Additionally, accounts receivable includes amounts for services performed in advance of the right to invoice the customer. We maintain an allowance for credit losses for accounts receivable, which is recorded as an offset to accounts receivable, and changes in such are classified as general and administrative expense in the Consolidated Statements of Income. We assess collectibility by reviewing accounts receivable on a collective basis where similar characteristics exist and on an individual basis when we identify specific customers with known disputes or collectibility issues. In determining the amount of the allowance for credit losses, we consider historical collectibility based on past due status and make judgments about the creditworthiness of customers based on ongoing credit evaluations. We also consider customer-specific information, current market conditions, and reasonable and supportable forecasts of future economic conditions. Convertible Notes Our investments in convertible notes are primarily recorded at amortized cost which includes unpaid principal balances, deferred origination costs, and any related discount or premium, net of allowances for credit losses, and are included within other non-current assets on our Consolidated Balance Sheets. Other Our financial instruments also include debt and equity investments in companies with which we also entered into commercial arrangements at or near the same time. For these transactions, judgment is required in assessing the substance of the arrangements, including assessing whether the components of the arrangements should be accounted for as separate transactions under the applicable GAAP, and determining the value of the components of the arrangements, including the fair value of the investments. Additionally, if our investment in such companies becomes impaired, we may need to re-evaluate the accounting for the commercial arrangement, including reducing any remaining performance obligations. Impairment of Investments We periodically review our debt and non-marketable equity securities for impairment. For debt securities in an unrealized loss position, we determine whether a credit loss exists. The credit loss is estimated by considering available information relevant to the collectibility of the security and information about past events, current conditions, and reasonable and supportable forecasts. Any credit loss is recorded as a charge to OI&E, not to exceed the amount of the unrealized loss. Unrealized losses other than the credit loss are recognized in AOCI. If we have an intent to sell, or if it is more likely than not that we will be required to sell a debt security in an unrealized loss position before recovery of its amortized cost basis,",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "62",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_62_chunk_1",
        "text": "we will write down the security to its fair value and record the corresponding charge as a component of OI&E. For non-marketable equity securities, including equity method investments, we consider whether impairment indicators exist by evaluating the companies' financial and liquidity position and access to capital resources, among other indicators. If the assessment indicates that the investment is impaired, we write down the investment to its fair value by recording the corresponding charge as a component of OI&E. We prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach. Inventory Inventory consists primarily of finished goods and is stated at the lower of cost and net realizable value. Cost is computed using the first-in, first-out method. Variable Interest Entities We determine at the inception of each arrangement whether an entity in which we have made an investment or in which we have other variable interests is considered a variable interest entity (VIE). We consolidate VIEs when we are 61.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "62",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_64_chunk_0",
        "text": "Table of Contents Alphabet Inc. at the lowest level of identifiable cash flows independent of other assets. We measure recoverability of these assets by comparing the carrying amounts to the future undiscounted cash flows that the assets or the asset group are expected to generate. If the carrying value of the assets or asset group is not recoverable, the impairment recognized is measured as the amount by which the carrying value exceeds its fair value. Income Taxes We account for income taxes using the asset and liability method, under which we recognize the amount of taxes payable or refundable for the current year and deferred tax assets and liabilities for the future tax consequences of events that have been recognized in our financial statements or tax returns. We measure current and deferred tax assets and liabilities based on provisions of enacted tax law. We evaluate the likelihood of future realization of our deferred tax assets based on all available evidence and establish a valuation allowance to reduce deferred tax assets when it is more likely than not that they will not be realized or release a valuation allowance to increase deferred tax assets when it is more likely than not that they will be realized. We have elected to account for the tax effects of the global intangible low tax income provision as a current period expense. We recognize the financial statement effects of a tax position when it is more likely than not that, based on technical merits, the position will be sustained upon examination. The tax benefits of the position recognized in the financial statements are then measured based on the largest amount of benefit that is greater than 50% likely to be realized upon settlement with a taxing authority. In addition, we recognize interest and penalties related to unrecognized tax benefits as a component of the income tax provision. Business Combinations We include the results of operations of the businesses that we acquire as of the acquisition date. We allocate the purchase price of the acquisitions to the assets acquired and liabilities assumed based on their estimated fair values, except for revenue contracts acquired, which are recognized in accordance with our revenue recognition policy. The excess of the purchase price over the fair values of identifiable assets and liabilities is recorded as goodwill. Acquisition-related expenses are recognized separately from the business combination and are expensed as incurred. Foreign Currency We translate the financial statements of our international subsidiaries to U.S. dollars using month-end exchange rates for assets and liabilities, and average rates for the period derived from month-end exchange rates for revenues, costs, and expenses. We record translation gains and losses in AOCI as a component of stockholders’ equity. We reflect net foreign exchange transaction gains and losses resulting from the conversion of the transaction currency to functional currency as a component of foreign currency exchange gain (loss) in OI&E. Recently Issued Accounting Pronouncements Not Yet Adopted In December 2023, the Financial Accounting Standards Board (FASB) issued",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "64",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_64_chunk_1",
        "text": "Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard can be applied either prospectively or retrospectively. We will adopt the standard in our 2025 annual period and are currently assessing the effect that the updated standard will have on our financial statement disclosures. In November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income- Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures. Recently Adopted Accounting Pronouncements In November 2023, the FASB issued ASU No. 2023-07 “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures” which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. We adopted this ASU for our 2024 annual period with the comparative periods updated to reflect additional disclosures. See Note 15 for further details. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 63.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "64",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_94_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES We have filed the following documents as part of this Annual Report on Form 10-K: 1. Consolidated Financial Statements Reports of Independent Registered Public Accounting Firm 49 Financial Statements: Consolidated Balance Sheets 52 Consolidated Statements of Income 53 Consolidated Statements of Comprehensive Income 54 Consolidated Statements of Stockholders’ Equity 55 Consolidated Statements of Cash Flows 56 Notes to Consolidated Financial Statements 57 2. Financial Statement Schedules Schedule II: Valuation and Qualifying Accounts The table below details the activity of the allowance for credit losses and sales credits for the years ended December 31, 2022, 2023, and 2024 (in millions): Balance at Balance at Beginning of Year Additions Usage End of Year Year ended December 31, 2022 $ 1,389 $ 2,125 $ (2,301) $ 1,213 Year ended December 31, 2023 $ 1,213 $ 3,115 $ (2,737) $ 1,591 Year ended December 31, 2024 $ 1,591 $ 2,895 $ (2,850) $ 1,636 Note: Additions to the allowance for credit losses are charged to expense. Additions to the allowance for sales credits are charged against revenues. All other schedules have been omitted because they are not required, not applicable, or the required information is otherwise included. 3. Exhibits Incorporated by reference herein Exhibit Number Description Form Date 2.01 Agreement and Plan of Merger, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, by and among Google Inc., (File No. 001-37580) the Registrant and Maple Technologies Inc. 3.01 Amended and Restated Certificate of Current Report on Form 8-K June 3, 2022 Incorporation of the Registrant (File No. 001-37580) 3.02 Amended and Restated Bylaws of the Current Report on Form 8-K October 25, 2022 Registrant, dated October 19, 2022 (File No. 001-37580) 4.01 Specimen Class A Common Stock certificate Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.02 Specimen Class C Capital Stock certificate Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.03 u Alphabet Inc. Deferred Compensation Plan Current Report on Form 8-K October 2, 2015 (File No. 001-37580) 4.04 Transfer Restriction Agreement, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, between the Registrant and (File No. 001-37580) Larry Page and certain of his affiliates 4.05 Transfer Restriction Agreement, dated Current Report on Form 8-K October 2, 2015 October 2, 2015, between the Registrant and (File No. 001-37580) Sergey Brin and certain of his affiliates 4.06 Joinder Agreement, dated December 31, Annual Report on Form 10-K February 2, 2022 2021, among the Registrant, Sergey Brin and (File No. 001-37580) certain of his affiliates 93.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "94",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended March 31, 2022 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2021 and March 31, 2022 5 Consolidated Statements of Income - Three Months Ended March 31, 2021 and 2022 6 Consolidated Statements of Comprehensive Income - Three Months Ended March 31, 2021 7 and 2022 Consolidated Statements of Stockholders' Equity - Three Months Ended March 31, 2021 and 8 2022 Consolidated Statements of Cash Flows - Three Months Ended March 31, 2021 and 2022 9 Notes to Consolidated Financial Statements 10 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 30 Item 3 Quantitative and Qualitative Disclosures About Market Risk 42 Item 4 Controls and Procedures 42 PART II. OTHER INFORMATION Item 1 Legal Proceedings 43 Item 1A Risk Factors 43 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 43 Item 6 Exhibits 44 Signature 45 2",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended March 31, 2023 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2022 and March 31, 2023 5 Consolidated Statements of Income - Three Months Ended March 31, 2022 and 2023 6 Consolidated Statements of Comprehensive Income - Three Months Ended March 31, 2022 7 and 2023 Consolidated Statements of Stockholders' Equity - Three Months Ended March 31, 2022 and 8 2023 Consolidated Statements of Cash Flows - Three Months Ended March 31, 2022 and 2023 9 Notes to Consolidated Financial Statements 10 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 30 Item 3 Quantitative and Qualitative Disclosures About Market Risk 43 Item 4 Controls and Procedures 43 PART II. OTHER INFORMATION Item 1 Legal Proceedings 44 Item 1A Risk Factors 44 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 44 Item 5 Other Information 49 Item 6 Exhibits 45 Signatures 46 2",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_19_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of March 31, 2023 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Amounts Presented in Cash and Offset in the the Non-Cash Gross Consolidated Consolidated Collateral Amounts Balance Balance Financial Received or Recognized Sheets Sheets Instruments(1) Pledged Net Amounts Derivatives assets $ 525 $ (82) $ 443 $ (368) $ (34) $ 41 Derivatives liabilities $ 858 $ (82) $ 776 $ (368) $ (24) $ 384 (1) The balances as of December 31, 2022 and March 31, 2023 were related to derivative allowed to be net settled in accordance with our master netting agreements. Note 4. Variable Interest Entities (VIE) Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2022 and March 31, 2023, assets that can only be used to settle obligations of these VIEs were $4.1 billion and $3.2 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.6 billion and $2.5 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Total noncontrolling interests (NCI) in our consolidated subsidiaries were $3.8 billion and $3.7 billion as of December 31, 2022 and March 31, 2023, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 6 for further details on OI&E. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. We have determined that the single source of our exposure to these VIEs is our capital investments in them. The carrying value and maximum exposure of these unconsolidated VIEs were $2.7 billion and $2.8 billion, respectively, as of December 31, 2022 and $2.6 billion and $2.7 billion, respectively, as of March 31, 2023. Note 5. Debt Short-Term Debt We have a debt financing program",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "19",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_19_chunk_1",
        "text": "of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2022 and March 31, 2023. Our short-term debt balance also includes the current portion of certain long-term debt. 19",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "19",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended March 31, 2024 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2023 and March 31, 2024 5 Consolidated Statements of Income - Three Months Ended March 31, 2023 and 2024 6 Consolidated Statements of Comprehensive Income - Three Months Ended March 31, 2023 7 and 2024 Consolidated Statements of Stockholders' Equity - Three Months Ended March 31, 2023 and 8 2024 Consolidated Statements of Cash Flows - Three Months Ended March 31, 2023 and 2024 9 Notes to Consolidated Financial Statements 10 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 29 Item 3 Quantitative and Qualitative Disclosures About Market Risk 42 Item 4 Controls and Procedures 42 PART II. OTHER INFORMATION Item 1 Legal Proceedings 43 Item 1A Risk Factors 43 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 44 Item 5 Other Information 44 Item 6 Exhibits 45 Signatures 46 2",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers with infrastructure and platform services as well as communication and collaboration tools; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2024. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the SEC. Recent Accounting Pronouncements In November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07 \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\" which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. ASU 2023-07 is effective for our annual periods beginning January 1, 2024, and for interim periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures. In December 2023, the FASB issued ASU 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes, specifically related to the rate reconciliation and income taxes paid. ASU 2023-09 is effective for our annual periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 10",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "10",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_38_chunk_0",
        "text": "Other Income (Expense), Net The following table presents OI&E (in millions): Three Months Ended March 31, 2023 2024 Interest income $ 797 $ 1,061 Interest expense (80) (94) Foreign currency exchange gain (loss), net (210) (238) Gain (loss) on debt securities, net (293) (462) Gain (loss) on equity securities, net 377 2,243 Performance fees 118 104 Income (loss) and impairment from equity method investments, net (51) (26) Other 132 255 Other income (expense), net $ 790 $ 2,843 OI&E increased $2.1 billion from the three months ended March 31, 2023 to the three months ended March 31, 2024. The increase was primarily due to net unrealized gains in non-marketable equity securities due to fair value adjustments related to observable transactions and increased interest income due to interest rates. For additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended March 31, 2023 2024 Income before provision for income taxes $ 18,205 $ 28,315 Provision for income taxes $ 3,154 $ 4,653 Effective tax rate 17.3 % 16.4 % The effective tax rate decreased from the three months ended March 31, 2023 to the three months ended March 31, 2024, primarily due to the tax rule change related to U.S. federal foreign tax credits issued by the IRS in July 2023 and an increase in stock-based compensation-related tax benefits, partially offset by a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction and an increase in taxes for certain U.S. jurisdictions. The OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however we do not expect a material change to our income tax provision for the 2024 fiscal year. As additional jurisdictions enact such legislation, transitional rules lapse, and other provisions of the minimum tax legislation become effective, we expect our effective tax rate and cash tax payments could increase in future years. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of March 31, 2024, we had $108.1 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "38",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_38_chunk_1",
        "text": "to stockholders. 38",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "38",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended March 31, 2025 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2024 and March 31, 2025 5 Consolidated Statements of Income - Three Months Ended March 31, 2024 and 2025 6 Consolidated Statements of Comprehensive Income - Three Months Ended March 31, 2024 7 and 2025 Consolidated Statements of Stockholders' Equity - Three Months Ended March 31, 2024 and 8 2025 Consolidated Statements of Cash Flows - Three Months Ended March 31, 2024 and 2025 9 Notes to Consolidated Financial Statements 10 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 32 Item 3 Quantitative and Qualitative Disclosures About Market Risk 46 Item 4 Controls and Procedures 46 PART II. OTHER INFORMATION Item 1 Legal Proceedings 47 Item 1A Risk Factors 47 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 47 Item 5 Other Information 47 Item 6 Exhibits 48 Signatures 49 2",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_10_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC. Recently Issued Accounting Pronouncements Not Yet Adopted In December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard is effective for our 2025 annual period and can be applied either prospectively or retrospectively. We are currently assessing the effect that the updated standard will have on our financial statement disclosures. In November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income- Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures. Prior Period Reclassifications Certain",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "10",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_10_chunk_1",
        "text": "amounts in prior periods have been reclassified to conform with current period presentation. 10",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "10",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended June 30, 2022 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2021 and June 30, 2022 5 Consolidated Statements of Income - Three and Six Months Ended June 30, 2021 and 2022 6 Consolidated Statements of Comprehensive Income - Three and Six Months Ended June 30, 7 2021 and 2022 Consolidated Statements of Stockholders' Equity - Three and Six Months Ended June 30, 8 2021 and 2022 Consolidated Statements of Cash Flows - Six Months Ended June 30, 2021 and 2022 10 Notes to Consolidated Financial Statements 11 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 33 Item 3 Quantitative and Qualitative Disclosures About Market Risk 46 Item 4 Controls and Procedures 46 PART II. OTHER INFORMATION Item 1 Legal Proceedings 47 Item 1A Risk Factors 47 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 47 Item 6 Exhibits 48 Signatures 49 2",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_23_chunk_0",
        "text": "Table of Contents Alphabet Inc. The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $12.4 billion and $10.4 billion as of December 31, 2021 and June 30, 2022, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of June 30, 2022, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2023 and $6.0 billion expiring in April 2026. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2021 and June 30, 2022. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $550 million and $634 million as of December 31, 2021 and June 30, 2022, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2021 June 30, 2022 Land and buildings $ 58,881 $ 65,015 Information technology assets 55,606 59,643 Construction in progress 23,172 25,341 Leasehold improvements 9,146 9,992 Furniture and fixtures 208 267 Property and equipment, gross 147,013 160,258 Less: accumulated depreciation (49,414) (54,035) Property and equipment, net $ 97,599 $ 106,223 Accrued expenses and other current liabilities Accrued expenses and other current liabilities consisted of the following (in millions): As of As of December 31, 2021 June 30, 2022 European Commission fines(1) $ 9,799 $ 9,191 Accrued customer liabilities 3,505 2,948 Accrued purchases of property and equipment 2,415 2,797 Current operating lease liabilities 2,189 2,297 Other accrued expenses and current liabilities 13,328 15,743 Accrued expenses and other current liabilities $ 31,236 $ 32,976 (1) Includes the effects of foreign exchange and interest. See Note 9 for further details. 23",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "23",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended June 30, 2023 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2022 and June 30, 2023 5 Consolidated Statements of Income - Three and Six Months Ended June 30, 2022 and 2023 6 Consolidated Statements of Comprehensive Income - Three and Six Months Ended June 30, 7 2022 and 2023 Consolidated Statements of Stockholders' Equity - Three and Six Months Ended June 30, 8 2022 and 2023 Consolidated Statements of Cash Flows - Six Months Ended June 30, 2022 and 2023 10 Notes to Consolidated Financial Statements 11 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 33 Item 3 Quantitative and Qualitative Disclosures About Market Risk 48 Item 4 Controls and Procedures 48 PART II. OTHER INFORMATION Item 1 Legal Proceedings 50 Item 1A Risk Factors 50 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 50 Item 5 Other Information 49 Item 6 Exhibits 52 Signatures 53 2",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_21_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of June 30, 2023 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Amounts Presented in Cash and Offset in the the Non-Cash Gross Consolidated Consolidated Collateral Amounts Balance Balance Financial Received or Recognized Sheets Sheets Instruments(1) Pledged Net Amounts Derivatives assets $ 444 $ (47) $ 397 $ (138) $ (226) $ 33 Derivatives liabilities $ 451 $ (47) $ 404 $ (138) $ (34) $ 232 (1) The balances as of December 31, 2022 and June 30, 2023 were related to derivatives allowed to be net settled in accordance with our master netting agreements. Note 4. Variable Interest Entities (VIE) Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2022 and June 30, 2023, assets that can only be used to settle obligations of these VIEs were $4.1 billion and $3.1 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.6 billion for both periods. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Total noncontrolling interests (NCI) in our consolidated subsidiaries were $3.8 billion and $3.6 billion as of December 31, 2022 and June 30, 2023, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 6 for further details on OI&E. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. We have determined that the single source of our exposure to these VIEs is our capital investments in them. The carrying value and maximum exposure of these unconsolidated VIEs were $2.7 billion and $2.8 billion, respectively, as of December 31, 2022 and $3.0 billion and $3.0 billion, respectively, as of June 30, 2023. Note 5. Debt Short-Term Debt We have a debt financing program of",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "21",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_21_chunk_1",
        "text": "up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2022 and June 30, 2023. Our short-term debt balance also includes the current portion of certain long-term debt. 21",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "21",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended June 30, 2024 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2023 and June 30, 2024 5 Consolidated Statements of Income - Three and Six Months Ended June 30, 2023 and 2024 6 Consolidated Statements of Comprehensive Income - Three and Six Months Ended June 30, 7 2023 and 2024 Consolidated Statements of Stockholders' Equity - Three and Six Months Ended June 30, 8 2023 and 2024 Consolidated Statements of Cash Flows - Six Months Ended June 30, 2023 and 2024 10 Notes to Consolidated Financial Statements 11 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 33 Item 3 Quantitative and Qualitative Disclosures About Market Risk 47 Item 4 Controls and Procedures 47 PART II. OTHER INFORMATION Item 1 Legal Proceedings 49 Item 1A Risk Factors 49 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 49 Item 5 Other Information 50 Item 6 Exhibits 51 Signatures 52 2",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_11_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers with infrastructure and platform services as well as communication and collaboration tools; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2024. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the SEC. Recent Accounting Pronouncements In November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07 \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\" which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. ASU 2023-07 is effective for our annual periods beginning January 1, 2024, and for interim periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures. In December 2023, the FASB issued ASU 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption we will be required to disclose standardized categories in the rate reconciliation in both percentage and dollar amounts. ASU 2023-09 will also require income taxes paid to be disaggregated by jurisdiction, among other disclosure requirements. We will adopt ASU 2023-09 for our annual periods beginning January 1, 2025. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 11",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "11",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_29_chunk_0",
        "text": "Note 10. Net Income Per Share The following table sets forth the computation of basic and diluted net income per share of Class A, Class B, and Class C stock (in millions, except per share amounts): Three Months Ended June 30, 2023 2024 Class A Class B Class C Consolidated Class A Class B Class C Consolidated Basic net income per share: Numerator Allocation of distributed earnings (cash dividends paid) $ 0 $ 0 $ 0 $ 0 $ 1,173 $ 173 $ 1,120 $ 2,466 Allocation of undistributed earnings 8,600 1,275 8,493 18,368 10,046 1,484 9,623 21,153 Net income $ 8,600 $ 1,275 $ 8,493 $ 18,368 $ 11,219 $ 1,657 $ 10,743 $ 23,619 Denominator Number of shares used in per share computation 5,931 879 5,858 12,668 5,862 866 5,615 12,343 Basic net income per share $ 1.45 $ 1.45 $ 1.45 $ 1.45 $ 1.91 $ 1.91 $ 1.91 $ 1.91 Diluted net income per share: Numerator Allocation of total earnings for basic computation $ 8,600 $ 1,275 $ 8,493 $ 18,368 $ 11,219 $ 1,657 $ 10,743 $ 23,619 Reallocation of total earnings as a result of conversion of Class B to Class A shares 1,275 0 0 _(1) 1,657 0 0 _(1) Reallocation of undistributed earnings (75) (10) 75 _(1) (140) (18) 140 _(1) Net income $ 9,800 $ 1,265 $ 8,568 $ 18,368 $ 12,736 $ 1,639 $ 10,883 23,619 Denominator Number of shares used in basic computation 5,931 879 5,858 12,668 5,862 866 5,615 12,343 Weighted-average effect of dilutive securities Add: Conversion of Class B to Class A shares outstanding 879 0 0 _(1) 866 0 0 _(1) Restricted stock units and other contingently issuable shares 0 0 96 96 0 0 152 152 Number of shares used in per share computation 6,810 879 5,954 12,764 6,728 866 5,767 12,495 Diluted net income per share $ 1.44 $ 1.44 $ 1.44 $ 1.44 $ 1.89 $ 1.89 $ 1.89 $ 1.89 (1) Not applicable for consolidated net income per share. 29",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "29",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_43_chunk_0",
        "text": "Other Income (Expense), Net The following table presents OI&E (in millions): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Interest income $ 892 $ 1,090 $ 1,689 $ 2,151 Interest expense (43) (67) (123) (161) Foreign currency exchange gain (loss), net (268) (173) (478) (411) Gain (loss) on debt securities, net (304) (310) (597) (772) Gain (loss) on equity securities, net (205) (714) 172 1,529 Performance fees 5 128 123 232 Income (loss) and impairment from equity method investments, net (106) 32 (157) 6 Other 94 140 226 395 Other income (expense), net $ 65 $ 126 $ 855 $ 2,969 OI&E increased $61 million from the three months ended June 30, 2023 to the three months ended June 30, 2024. Net unrealized losses in marketable equity securities reflecting market driven changes were offset by a decrease in unrealized losses on non-marketable equity securities from fair value adjustments related to observable transactions and increased interest income related to higher interest rates. OI&E increased $2.1 billion from the six months ended June 30, 2023 to the six months ended June 30, 2024. The increase was primarily due to an increase in net unrealized gains on non-marketable equity securities driven by fair value adjustments related to observable transactions and increased interest income related to higher interest rates. The increases were partially offset by net unrealized losses in marketable equity securities reflecting market driven changes. For additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Income before provision for income taxes $ 21,903 $ 27,551 $ 40,108 $ 55,866 Provision for income taxes $ 3,535 $ 3,932 $ 6,689 $ 8,585 Effective tax rate 16.1 % 14.3 % 16.7 % 15.4 % The effective tax rate decreased from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024, primarily due to the tax rule change related to U.S. federal foreign tax credits issued by the IRS in July 2023, an increase in stock-based compensation-related tax benefits, partially offset by a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction. The OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however we do not expect a material change to our income tax provision for the 2024 fiscal year. As additional jurisdictions enact such legislation, transitional rules lapse, and other provisions of the minimum tax legislation become effective, we expect our effective tax rate and cash tax",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "43",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_43_chunk_1",
        "text": "payments could increase in future years. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of June 30, 2024, we had $100.7 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid 43",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "43",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_3_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended June 30, 2025 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 4 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 6 Consolidated Balance Sheets - December 31, 2024 and June 30, 2025 6 Consolidated Statements of Income - Three and Six Months Ended June 30, 2024 and 2025 7 Consolidated Statements of Comprehensive Income - Three and Six Months Ended June 30, 8 2024 and 2025 Consolidated Statements of Stockholders' Equity - Three and Six Months Ended June 30, 9 2024 and 2025 Consolidated Statements of Cash Flows - Six Months Ended June 30, 2024 and 2025 11 Notes to Consolidated Financial Statements 12 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 37 Item 3 Quantitative and Qualitative Disclosures About Market Risk 51 Item 4 Controls and Procedures 52 PART II. OTHER INFORMATION Item 1 Legal Proceedings 53 Item 1A Risk Factors 53 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 53 Item 5 Other Information 53 Item 6 Exhibits 55 Signatures 57 3",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "3",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_12_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC. Recently Issued Accounting Pronouncements Not Yet Adopted In December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption, we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard, which is effective for our 2025 annual period, can be applied either prospectively or retrospectively and we are currently assessing which method to adopt. In November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income- Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "12",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_12_chunk_1",
        "text": "conform with current period presentation. 12",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "12",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended September 30, 2022 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2021 and September 30, 2022 5 Consolidated Statements of Income - Three and Nine Months Ended September 30, 2021 6 and 2022 Consolidated Statements of Comprehensive Income - Three and Nine Months Ended 7 September 30, 2021 and 2022 Consolidated Statements of Stockholders' Equity - Three and Nine Months Ended September 8 30, 2021 and 2022 Consolidated Statements of Cash Flows - Nine Months Ended September 30, 2021 and 2022 10 Notes to Consolidated Financial Statements 11 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 34 Item 3 Quantitative and Qualitative Disclosures About Market Risk 47 Item 4 Controls and Procedures 47 PART II. OTHER INFORMATION Item 1 Legal Proceedings 49 Item 1A Risk Factors 49 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 50 Item 5 Other Information 49 Item 6 Exhibits 52 Signatures 53 2",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_23_chunk_0",
        "text": "Table of Contents Alphabet Inc. The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually. The total estimated fair value of the outstanding notes was approximately $12.4 billion and $9.7 billion as of December 31, 2021 and September 30, 2022, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy. Credit Facility As of September 30, 2022, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2023 and $6.0 billion expiring in April 2026. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2021 and September 30, 2022. Note 6. Supplemental Financial Statement Information Accounts Receivable The allowance for credit losses on accounts receivable was $550 million and $731 million as of December 31, 2021 and September 30, 2022, respectively. Property and Equipment, Net Property and equipment, net, consisted of the following (in millions): As of As of December 31, 2021 September 30, 2022 Land and buildings $ 58,881 $ 64,679 Information technology assets 55,606 61,938 Construction in progress 23,172 26,899 Leasehold improvements 9,146 10,062 Furniture and fixtures 208 297 Property and equipment, gross 147,013 163,875 Less: accumulated depreciation (49,414) (55,512) Property and equipment, net $ 97,599 $ 108,363 Accrued expenses and other current liabilities Accrued expenses and other current liabilities consisted of the following (in millions): As of As of December 31, 2021 September 30, 2022 European Commission fines(1) $ 9,799 $ 8,264 Accrued customer liabilities 3,505 2,943 Accrued purchases of property and equipment 2,415 3,255 Current operating lease liabilities 2,189 2,285 Other accrued expenses and current liabilities 13,328 18,291 Accrued expenses and other current liabilities $ 31,236 $ 35,038 (1) Includes the effects of foreign exchange and interest. See Note 9 for further details. 23",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "23",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_44_chunk_0",
        "text": "Table of Contents Alphabet Inc. Other Bets Other Bets operating loss increased $323 million from the three months ended September 30, 2021 to the three months ended September 30, 2022. The increase in operating loss was primarily driven by an increase in compensation expenses. Other Bets operating loss increased $621 million from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The increase in operating loss was primarily driven by increases in compensation expenses, partially offset by growth in revenues. Other Income (Expense), Net The following table presents other income (expense), net (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Other income (expense), net $ 2,033 $ (902) $ 9,503 $ (2,501) Other income (expense), net, decreased $2.9 billion from the three months ended September 30, 2021 to the three months ended September 30, 2022 primarily due to changes in gains and losses on equity and debt securities. In the three months ended September 30, 2022, $731 million of net losses were recognized on debt securities, and $492 million of net unrealized losses were recognized on non-marketable equity securities. These losses were partially offset by interest income recognized of $615 million. In the three months ended September 30, 2021, $2.2 billion of net unrealized gains were recognized on marketable and non-marketable equity securities, partially offset by $492 million of accrued performance fees related to certain investments. Other income (expense), net, decreased $12.0 billion from the nine months ended September 30, 2021 to the nine months ended September 30, 2022 primarily due changes in gains and losses on equity securities and performance fees. In the nine months ended September 30, 2022, $2.5 billion of net unrealized losses were recognized on marketable equity securities and $1.9 billion of net losses were recognized on debt securities. These losses were partially offset by interest income recognized of $1.5 billion and $879 million of net unrealized gains on non-marketable equity securities. In the nine months ended September 30, 2021, $9.2 billion of net unrealized gains were recognized on marketable and non-marketable equity securities, partially offset by $1.7 billion of accrued performance fees related to certain investments. See Note 3 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2021 2022 2021 2022 Income before provision for income taxes $ 23,064 $ 16,233 $ 66,332 $ 54,181 Provision for income taxes $ 4,128 $ 2,323 $ 10,941 $ 7,833 Effective tax rate 17.9 % 14.3 % 16.5 % 14.5 % The effective tax rate decreased by 3.6 percentage points from the three months ended September 30, 2021 to the three months ended September 30, 2022.The decrease was primarily driven by a change in unrecognized tax benefits and the effects of capitalization and",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "44",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_44_chunk_1",
        "text": "amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign-Derived Intangible Income tax deduction. These decreases were partially offset by a decrease in pre-tax earnings, including in countries that have lower statutory rates and a decrease in the stock-based compensation-related tax benefit. The effective tax rate decreased by 2.0 percentage points from the nine months ended September 30, 2021 to the nine months ended September 30, 2022. The decrease was primarily driven by the effects of capitalization and amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act generating an increase in the U.S. federal Foreign-Derived Intangible Income tax deduction and a change in unrecognized tax benefits. These decreases were partially offset by a decrease in pre-tax earnings, including in countries that have lower statutory rates and a decrease in the stock-based compensation-related tax benefit. 44",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "44",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended September 30, 2023 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2022 and September 30, 2023 5 Consolidated Statements of Income - Three and Nine Months Ended September 30, 2022 6 and 2023 Consolidated Statements of Comprehensive Income - Three and Nine Months Ended 7 September 30, 2022 and 2023 Consolidated Statements of Stockholders' Equity - Three and Nine Months Ended September 8 30, 2022 and 2023 Consolidated Statements of Cash Flows - Nine Months Ended September 30, 2022 and 2023 10 Notes to Consolidated Financial Statements 11 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 34 Item 3 Quantitative and Qualitative Disclosures About Market Risk 49 Item 4 Controls and Procedures 49 PART II. OTHER INFORMATION Item 1 Legal Proceedings 51 Item 1A Risk Factors 51 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 51 Item 5 Other Information 51 Item 6 Exhibits 52 Signatures 53 2",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_21_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of September 30, 2023 Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset Gross Net Amounts Amounts Presented in Cash and Offset in the the Non-Cash Gross Consolidated Consolidated Collateral Amounts Balance Balance Financial Received or Recognized Sheets Sheets Instruments(1) Pledged Net Amounts Derivatives assets $ 1,396 $ (22) $ 1,374 $ (448) $ (730) $ 196 Derivatives liabilities $ 617 $ (22) $ 595 $ (448) $ (25) $ 122 (1) The balances as of December 31, 2022 and September 30, 2023 were related to derivatives allowed to be net settled in accordance with our master netting agreements. Note 4. Variable Interest Entities (VIE) Consolidated VIEs We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements. For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2022 and September 30, 2023, assets that can only be used to settle obligations of these VIEs were $4.1 billion and $2.6 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.6 billion and $2.2 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets. Total noncontrolling interests (NCI) in our consolidated subsidiaries were $3.8 billion and $3.4 billion as of December 31, 2022 and September 30, 2023, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 6 for further details on OI&E. Unconsolidated VIEs We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources. We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments primarily as non-marketable equity securities or equity method investments. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. The maximum exposure and carrying value of these unconsolidated VIEs were $2.8 billion and $2.7 billion, respectively, as of December 31, 2022 and $5.5 billion and $3.8 billion, respectively, as of September 30, 2023. The difference between the maximum exposure and the carrying value relates primarily to future funding commitments. Note 5. Debt Short-Term Debt We have a debt financing program of up",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "21",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_21_chunk_1",
        "text": "to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2022 and September 30, 2023. Our short-term debt balance also includes the current portion of certain long-term debt. 21",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "21",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. See Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q for further information. Provision for Income Taxes The following table presents provision for income taxes (in millions, except effective tax rate): Three Months Ended Nine Months Ended September 30, September 30, 2022 2023 2022 2023 Income before provision for income taxes $ 16,233 $ 21,197 $ 54,181 $ 61,305 Provision for income taxes $ 2,323 $ 1,508 $ 7,833 $ 8,197 Effective tax rate 14.3 % 7.1 % 14.5 % 13.4 % On July 21, 2023 the IRS issued a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits. This announcement only applies to foreign taxes paid or accrued in our fiscal years 2022 and 2023. Additionally, on September 8, 2023, the IRS issued a separate rule change with interim guidance on the capitalization and amortization of R&D expenses. A cumulative one-time adjustment applicable to prior periods for these tax rule changes was recorded in the third quarter of 2023. The effective tax rate decreased from the three months ended September 30, 2022 to the three months ended September 30, 2023, reflecting the effect of the two tax rule changes, particularly the change related to foreign tax credits. The effect of these tax rule changes was partially offset by a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction. The effective tax rate decreased from the nine months ended September 30, 2022 to the nine months ended September 30, 2023, reflecting the effect of the two tax rule changes, particularly the change related to foreign tax credits. The effect of these tax rule changes was partially offset by changes in uncertain tax benefits, a decrease in the stock-based compensation-related tax benefit, and a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction. Financial Condition Cash, Cash Equivalents, and Marketable Securities As of September 30, 2023, we had $119.9 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities. Sources, Uses of Cash and Related Trends Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders. The following table presents our cash flows (in millions): Nine Months Ended September 30, 2022 2023 Net cash provided by operating activities $ 67,881 $ 82,831 Net cash used in investing activities $ (14,071) $ (20,896) Net cash used in financing activities $ (52,128) $ (52,785) Cash Provided by Operating Activities Our largest source of cash provided",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "46",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_46_chunk_1",
        "text": "by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. Additionally, we generate cash through sales of apps and in-app purchases, and hardware; and licensing and service fees, including fees received for Google Cloud offerings and subscription-based products. 46",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "46",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_49_chunk_0",
        "text": "Table of Contents Alphabet Inc. Taxes As of September 30, 2023, we had short-term and long-term income taxes payable of $3.6 billion and $2.1 billion related to a one-time transition tax payable incurred as a result of the U.S. Tax Cuts and Jobs Act (\"Tax Act\"). As permitted by the Tax Act, we will pay the transition tax in annual interest-free installments through 2025. We also have long-term taxes payable of $5.9 billion primarily related to uncertain tax positions as of September 30, 2023. As a result of the 2023 IRS payment deferral relief made available to taxpayers headquartered in designated counties in California, we postponed our second and third quarter U.S. federal income tax payments. On October 16, 2023, we made an estimated income tax payment to the IRS of $10.5 billion. See Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Purchase Commitments As of September 30, 2023, we had material contractual obligations of $44.3 billion, of which $29.4 billion was short-term. These amounts primarily consist of purchase orders for certain technical infrastructure as well as the non-cancelable portion or the minimum cancellation fee in certain agreements related to commitments to purchase licenses, including content licenses, inventory and network capacity. For those agreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of September 30, 2023. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 9 of the Notes to Consolidated Financial Statements included in Item I of this Quarterly Report on Form 10-Q. In addition we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable. Critical Accounting Estimates See Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended December 31, 2022. Available Information Our website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor. Access to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and our Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of charge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov. We webcast via our investor relations website our earnings calls and certain events we participate in or host with members of the investment community. Our investor relations website also provides notifications of news or announcements regarding our financial performance and other items of interest to our investors, including SEC filings, investor events, press and earnings releases, and blogs. We also share",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "49",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_49_chunk_1",
        "text": "Google news and product updates on Google’s Keyword blog at https://www.blog.google/, which may be of interest or material to our investors. Further, corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of conduct, is also available on our investor relations website under the heading \"Governance.\" The content of our websites are not incorporated by reference into this Quarterly Report on Form 10-Q or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only. ITEM 3. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK For quantitative and qualitative disclosures about market risk, refer to Part II, Item 7A, Quantitative and Qualitative Disclosures About Market Risk, in our Annual Report on Form 10-K for the year ended December 31, 2022. ITEM 4. CONTROLS AND PROCEDURES Evaluation of Disclosure Controls and Procedures Our management, with the participation of our chief executive officer and chief financial officer, evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 under the Exchange Act, as of the end of the period covered by this Quarterly Report on Form 10-Q. 49",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "49",
            "chunk_index": 1,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_2_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. Form 10-Q For the Quarterly Period Ended September 30, 2024 TABLE OF CONTENTS Page No. Note About Forward-Looking Statements 3 PART I. FINANCIAL INFORMATION Item 1 Financial Statements 5 Consolidated Balance Sheets - December 31, 2023 and September 30, 2024 5 Consolidated Statements of Income - Three and Nine Months Ended September 30, 2023 6 and 2024 Consolidated Statements of Comprehensive Income - Three and Nine Months Ended 7 September 30, 2023 and 2024 Consolidated Statements of Stockholders' Equity - Three and Nine Months Ended September 8 30, 2023 and 2024 Consolidated Statements of Cash Flows - Nine Months Ended September 30, 2023 and 2024 10 Notes to Consolidated Financial Statements 11 Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations 33 Item 3 Quantitative and Qualitative Disclosures About Market Risk 48 Item 4 Controls and Procedures 48 PART II. OTHER INFORMATION Item 1 Legal Proceedings 49 Item 1A Risk Factors 49 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 50 Item 5 Other Information 50 Item 6 Exhibits 52 Signatures 53 2",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "2",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_11_chunk_0",
        "text": "Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers with infrastructure and platform services as well as communication and collaboration tools; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2024. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the SEC. Recent Accounting Pronouncements In November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07 \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\" which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. ASU 2023-07 is effective for our annual periods beginning January 1, 2024, and for interim periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures. In December 2023, the FASB issued ASU 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption we will be required to disclose standardized categories in the rate reconciliation in both percentage and dollar amounts. ASU 2023-09 will also require income taxes paid to be disaggregated by jurisdiction, among other disclosure requirements. We will adopt ASU 2023-09 for our annual periods beginning January 1, 2025. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 11",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "11",
            "chunk_index": 0,
            "page_section": "financial_statements"
        }
    }
]