[
    {
        "id": "goog-10-k-2023-final.pdf-page-30-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF\nOPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together with\n“Note about Forward-Looking Statements,” Part I, Item 1 \"Business,\" Part I, Item 1A \"Risk Factors,\" and our\nconsolidated financial statements and related notes included under Item 8 of this Annual Report on Form 10-K.\nThe following section generally discusses 2023 results compared to 2022 results. Discussion of 2022 results\ncompared to 2021 results to the extent not included in this report can be found in Item 7 of our 2022 Annual Report on\nForm 10-K.\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For\nadditional information on our segments, see Part I, Item 1 Business and Note 15 of the Notes to Consolidated\nFinancial Statements included in Item 8 of this Annual Report on Form 10-K.\nTrends in Our Business and Financial Effect\nThe following long-term trends have contributed to the results of our consolidated operations, and we anticipate\nthat they will continue to affect our future results:\n• Users' behaviors and advertising continue to shift online as the digital economy evolves.\nThe continuing evolution of the online world has contributed to the growth of our business and our revenues since\ninception. We expect that this evolution will continue to benefit our business and our revenues, although at a slower\npace than we have experienced historically, in particular after the outsized growth in our advertising revenues during\nthe COVID-19 pandemic. In addition, we face increasing competition for user engagement and advertisers, which may\naffect our revenues.\n• Users continue to access our products and services using diverse devices and modalities, which\nallows for new advertising formats that may benefit our revenues but adversely affect our margins.\nOur users are accessing our products and services via diverse devices and modalities, such as smartphones,\nwearables, connected TVs, and smart home devices, and want to be able to be connected no matter where they are or\nwhat they are doing. We are focused on expanding our products and services to stay in front of these trends in order to\nmaintain and grow our business.\nWe benefit from advertising revenues generated from different channels, including mobile, and newer advertising\nformats. The margins from these channels and newer products have generally been lower than those from traditional\ndesktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues\nmay be affected. For example, changing dynamics within the global smartphone market, such as increased market\nsaturation in developed countries, can affect our mobile advertising revenues.\nWe expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow\nand TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device mix; geographic\nmix; partner agreement terms; partner mix; the percentage of queries channeled through paid access points; product\nmix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms.\nWe expect these trends to continue to affect our revenues and put pressure on our margins.\n• As online advertising evolves, we continue to expand our product offerings, which may affect our\nmonetization.\nAs interactions between users and advertisers change, and as online user behavior evolves, we continue to\nexpand our product offerings to serve these changing needs, which may affect our monetization. For example,\nrevenues from ads on YouTube and Google Play monetize at a lower rate than our traditional search ads. We also\nexpect to continue to incorporate AI innovations into our products, such as AI in Search, that could affect our\nmonetization trends. When developing new products and services we generally focus first on user experience and then\non monetization.\n• As users in developing economies increasingly come online, our revenues from international markets\ncontinue to increase, and may require continued investments. In addition, movements in foreign exchange\nrates affect such revenues.\n29.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "30",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf-page-37-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage,\nfrom 2022 to 2023:\nGoogle Search & other\nPaid clicks change 7 %\nCost-per-click change 1 %\nGoogle Network\nImpressions change (5) %\nCost-per-impression change 0 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $5.6 billion from 2022 to 2023 primarily driven\nby growth in subscriptions, largely for YouTube services. The growth in YouTube services was primarily due to an\nincrease in paid subscribers.\nGoogle subscriptions, platforms, and devices revenues increased $1.0 billion from 2021 to 2022 primarily driven\nby growth in subscription and device revenues, partially offset by a decrease in platform revenues. The growth in\nsubscriptions was largely for YouTube services, primarily due to an increase in paid subscribers. The growth in device\nrevenues was primarily driven by increased sales of Pixel devices. The decrease in platform revenues was primarily\ndue to Google Play, driven by the fee structure changes we announced in 2021 as well as a decrease in buyer\nspending. Additionally, the overall increase in Google subscriptions, platforms, and devices revenues was adversely\naffected by the unfavorable effect of foreign currency exchange rates.\nGoogle Cloud\nGoogle Cloud revenues increased $6.8 billion from 2022 to 2023. Growth was primarily driven by Google Cloud\nPlatform followed by Google Workspace offerings. Google Cloud's infrastructure and platform services were the largest\ndrivers of growth in Google Cloud Platform.\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the\naddresses of our customers:\nYear Ended December 31,\n2022 2023\nUnited States 48 % 47 %\nEMEA 29 % 30 %\nAPAC 16 % 17 %\nOther Americas 6 % 6 %\nHedging gains (losses) 1 % 0 %\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 8 of this\nAnnual Report on Form 10-K.\n36.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "37",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2024.pdf-page-31-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF\nOPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together with\n“Note about Forward-Looking Statements,” Part I, Item 1 \"Business,\" Part I, Item 1A \"Risk Factors,\" and our\nconsolidated financial statements and related notes included under Item 8 of this Annual Report on Form 10-K.\nThe following section generally discusses 2024 results compared to 2023 results. Discussion of 2023 results\ncompared to 2022 results to the extent not included in this report can be found in Item 7 of our 2023 Annual Report on\nForm 10-K.\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Part I, Item 1 Business and Note 15 of the Notes to Consolidated Financial Statements\nincluded in Item 8 of this Annual Report on Form 10-K.\nTrends in Our Business and Financial Effect\nThe following long-term trends have contributed to the results of our consolidated operations, and we anticipate\nthat they will continue to affect our future results:\n• Users' behaviors and advertising continue to shift online as the digital economy evolves.\nThe continuing evolution of the online world has contributed to the growth of our business and our revenues since\ninception. We expect that this evolution will continue to benefit our business and our revenues, although at a slower\npace than we have experienced historically. In addition, we face increasing competition for user engagement and\nadvertisers, including from other developers and providers of AI products and services, which may affect our revenues.\n• Users continue to access our products and services using diverse devices and modalities, which\nallows for new advertising formats that may benefit our revenues but adversely affect our margins.\nOur users are accessing our products and services via diverse devices and modalities beyond traditional desktop,\nsuch as smartphones, wearables, connected TVs, and smart home devices, and want to be able to be connected no\nmatter where they are or what they are doing. We are focused on expanding our products and services to stay in front\nof these trends in order to maintain and grow our business.\nWe benefit from advertising revenues generated from different channels, including mobile, and newer advertising\nformats. The margins from these channels and newer products have generally been lower than those from traditional\ndesktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues\nmay be affected. For example, changing dynamics within the global smartphone market, such as increased market\nsaturation in developed countries, can affect our mobile advertising revenues.\nWe expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow\nand TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device mix; geographic\nmix; partner agreement terms; partner mix; the percentage of queries channeled through paid access points; product\nmix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms.\nWe expect these trends to continue to affect our revenues and put pressure on our margins.\n• As online advertising evolves, we continue to expand our product offerings, which may affect our\nmonetization.\nAs interactions between users and advertisers change, and as online user behavior evolves, for example with AI,\nwe continue to expand our product offerings to serve these changing needs, which may affect monetization of our\nproducts and services. We expect to continue to incorporate AI innovations into our products, such as AI in Search,\nthat could affect our monetization trends. When developing new products and services we generally focus first on user\nexperience and then on monetization.\n• As users in developing economies increasingly come online, our revenues from international markets\ncontinue to increase, and may require continued investments. In addition, movements in foreign exchange\nrates affect such revenues.\nThe shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S.,\nincluding in emerging markets, such as India. We continue to invest heavily and develop localized versions of our\nproducts and advertising programs relevant to our users in these markets. This has led to a trend of increased\n30.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "31",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2024.pdf-page-39-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nThe following table presents the foreign currency exchange effect on international revenues and total revenues (in\nmillions, except percentages):\nYear Ended December 31, 2024\n% Change from Prior Period\nYear Ended December 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2023 2024 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 146,286 $ 170,447 $ 0 $ 170,447 17 % 0 % 17 %\nEMEA 91,038 102,127 41 102,086 12 % 0 % 12 %\nAPAC 51,514 56,815 (1,369) 58,184 10 % (3) % 13 %\nOther Americas 18,320 20,418 (1,608) 22,026 11 % (9) % 20 %\nRevenues, excluding hedging effect 307,158 349,807 (2,936) 352,743 14 % (1) % 15 %\nHedging gains (losses) 236 211\nTotal revenues(1) $ 307,394 $ 350,018 $ 352,743 14 % 0 % (1) % 15 %\n(1) Total constant currency revenues of $352.7 billion for 2024 increased $45.6 billion compared to $307.2 billion in revenues,\nexcluding hedging effect, for 2023.\nEMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of\nthe U.S. dollar strengthening relative to the Turkish lira was offset by the U.S. dollar weakening relative to the British\npound and the euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to\nthe U.S. dollar strengthening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Argentine peso and the Brazilian real.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nYear Ended December 31,\n2023 2024\nTAC $ 50,886 $ 54,900\nOther cost of revenues 82,446 91,406\nTotal cost of revenues $ 133,332 $ 146,306\nTotal cost of revenues as a percentage of revenues 43 % 42 %\nCost of revenues increased $13.0 billion from 2023 to 2024 due to an increase in other cost of revenues and TAC\nof $9.0 billion and $4.0 billion, respectively.\nThe increase in TAC from 2023 to 2024 was largely due to an increase in TAC paid to distribution partners,\nprimarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.4% to 20.7% from 2023 to\n2024 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The\nTAC rate on Google Search & other revenues increased from 2023 to 2024 primarily due to increases related to mobile\nsearches, which carries higher TAC because more mobile searches are channeled through paid access points. The\nTAC rate on Google Network revenues was substantially consistent from 2023 to 2024.\nThe increase in other cost of revenues from 2023 to 2024 was primarily due to increases in content acquisition\ncosts, largely for YouTube, depreciation expense, and other technical infrastructure operations costs.\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\n38.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "39",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-2024.pdf-page-42-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nexpenses. Additionally, a decrease in the 2024 U.S. federal Foreign Derived Intangible Income tax deduction\ncontributed to an increase in the effective tax rate. These factors were partially offset by an increase in stock-based\ncompensation-related tax benefits in 2024.\nThe OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus\naround substantial changes to international tax policies, including the implementation of a minimum global effective tax\nrate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others\nto follow, however this did not have a material effect on our income tax provision for the 2024 fiscal year.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of December 31, 2024, we had $95.7 billion in cash, cash equivalents, and short-term marketable securities.\nCash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid\ngovernment bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity\nsecurities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow\nthat we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the\nbusiness. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to\nstockholders.\nThe following table presents our cash flows (in millions):\nYear Ended December 31,\n2023 2024\nNet cash provided by operating activities $ 101,746 $ 125,299\nNet cash used in investing activities $ (27,063) $ (45,536)\nNet cash used in financing activities $ (72,093) $ (79,733)\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search & other\nproperties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through\nconsumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash\nthrough consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network partners,\nto employees for compensation, and to content providers. Other uses of cash from operating activities include\npayments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures.\nNet cash provided by operating activities increased from 2023 to 2024 due to an increase in cash received from\ncustomers, partially offset by an increase in cash payments for cost of revenues and operating expenses.\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable and\nnon-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-\nmarketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from 2023 to 2024 primarily due to an increase in purchases of\nproperty and equipment and purchases of marketable securities, partially offset by increases in maturities and sales of\nmarketable securities. The increase in purchases of property and equipment is primarily driven by investments in\ntechnical infrastructure.\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the\nsale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock,\nnet payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities increased from 2023 to 2024 due to dividend payments and net payments\nrelated to stock-based award activities, partially offset by an increase in proceeds from issuance of debt, net of\nrepayments.\n41.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "42",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-q4-2022.pdf-page-27-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF\nOPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together with\n“Note about Forward-Looking Statements,” Part I, Item 1 \"Business,\" Part I, Item 1A \"Risk Factors,\" and our\nconsolidated financial statements and related notes included under Item 8 of this Annual Report on Form 10-K.\nWe have omitted discussion of 2020 results where it would be redundant to the discussion previously included in\nItem 7 of our 2021 Annual Report on Form 10-K.\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Part I, Item 1 “Business” and Note 15 of the Notes to Consolidated Financial Statements\nincluded in Item 8 of this Annual Report on Form 10-K.\nTrends in Our Business and Financial Effect\nThe following long-term trends have contributed to the results of our consolidated operations, and we anticipate\nthat they will continue to affect our future results:\n• Users' behaviors and advertising continue to shift online as the digital economy evolves.\nThe continuing shift from an offline to online world has contributed to the growth of our business and our revenues\nsince inception. We expect that this shift to an online world will continue to benefit our business and our revenues,\nalthough at a slower pace than we have experienced historically, in particular after the outsized growth in our\nadvertising revenues during the COVID-19 pandemic. In addition, we face increasing competition for user engagement\nand advertisers, which may affect our revenues.\n• Users continue to access our products and services using diverse devices and modalities, which\nallows for new advertising formats that may benefit our revenues but adversely affect our margins.\nOur users are accessing the Internet via diverse devices and modalities, such as smartphones, wearables, and\nsmart home devices, and want to be able to be connected no matter where they are or what they are doing. We are\nfocused on expanding our products and services to stay in front of these trends in order to maintain and grow our\nbusiness.\nWe benefit from advertising revenues generated from different channels, including mobile, and newer advertising\nformats. The margins from these channels and newer products have generally been lower than those from traditional\ndesktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues\nmay be affected. For example, growth in the global smartphone market has slowed due to various factors, including\nincreased market saturation in developed countries, which can affect our mobile advertising revenues.\nWe expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow\nand TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device mix; geographic\nmix; partner mix; partner agreement terms; the percentage of queries channeled through paid access points; product\nmix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms.\nWe expect these trends to continue to affect our revenues and put pressure on our margins.\n• As online advertising evolves, we continue to expand our product offerings, which may affect our\nmonetization.\nAs interactions between users and advertisers change, and as online user behavior evolves, we continue to\nexpand our product offerings to serve these changing needs, which may affect our monetization. For example,\nrevenues from ads on YouTube and Google Play monetize at a lower rate than our traditional search ads. We also may\ndevelop new products incorporating AI innovations that could affect our monetization trends. Additionally, when\ndeveloping new products and services we generally focus first on user experience before prioritizing monetization.\n• As users in developing economies increasingly come online, our revenues from international markets\ncontinue to increase, and may require continued investments. In addition, movements in foreign exchange\nrates affect such revenues.\nThe shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S.,\nincluding in emerging markets, such as India. We continue to invest heavily and develop localized versions of our\nproducts and advertising programs relevant to our users in these markets. This has led to a trend of increased\n26",
        "metadata": {
            "document": "goog-10-k-q4-2022.pdf",
            "page_number": "27",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-k-q4-2022.pdf-page-35-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nConstant currency revenue percentage change is calculated by determining the change in current period\nrevenues over prior year comparable period revenues where current period foreign currency revenues are translated\nusing prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with\nGAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures\nused by other companies and are not a measure of performance presented in accordance with GAAP.\nThe following table presents the foreign exchange effect on international revenues and total revenues (in millions,\nexcept percentages):\nYear Ended December 31, 2022\n% Change from Prior Period\nYear Ended December 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2021 2022 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 117,854 $ 134,814 $ 0 $ 134,814 14 % 0 % 14 %\nEMEA 79,107 82,062 (8,979) 91,041 4 % (11) % 15 %\nAPAC 46,123 47,024 (3,915) 50,939 2 % (8) % 10 %\nOther Americas 14,404 16,976 (430) 17,406 18 % (3) % 21 %\nRevenues, excluding hedging effect 257,488 280,876 (13,324) 294,200 9 % (5) % 14 %\nHedging gains (losses) 149 1,960\nTotal revenues(1) $ 257,637 $ 282,836 $ 294,200 10 % 1 % (5) % 14 %\n(1) Total constant currency revenues of $294.2 billion for 2022 increased $36.7 billion compared to $257.5 billion in revenues,\nexcluding hedging effect for 2021.\nEMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to\nthe U.S. dollar strengthening relative to the Euro and the British pound.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to\nthe U.S. dollar strengthening relative to the Japanese yen and the Australian dollar.\nOther Americas growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to\nthe U.S. dollar strengthening relative to the Argentine peso.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nYear Ended December 31,\n2021 2022\nTAC $ 45,566 $ 48,955\nOther cost of revenues 65,373 77,248\nTotal cost of revenues $ 110,939 $ 126,203\nTotal cost of revenues as a percentage of revenues 43 % 45 %\nCost of revenues increased $15.3 billion from 2021 to 2022. The increase was due to an increase in other cost of\nrevenues and TAC of $11.9 billion and $3.4 billion, respectively.\nThe increase in TAC from 2021 to 2022 was due to an increase in TAC paid to distribution partners and to Google\nNetwork partners, primarily driven by growth in revenues subject to TAC. The TAC rate was 22% in both 2021 and\n2022. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both\nsubstantially consistent from 2021 to 2022.\nThe increase in other cost of revenues from 2021 to 2022 was primarily due to increases in data center costs and\nother operations costs as well as hardware costs.\n34",
        "metadata": {
            "document": "goog-10-k-q4-2022.pdf",
            "page_number": "35",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf-page-36-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nConstant currency revenue percentage change is calculated by determining the change in current period\nrevenues over prior year comparable period revenues where current period foreign currency revenues are\ntranslated using prior year comparable period exchange rates and hedging effects are excluded from revenues of\nboth periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with\nGAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled\nmeasures used by other companies and are not a measure of performance presented in accordance with GAAP.\nThe following table presents the foreign exchange effect on international revenues and total revenues (in\nmillions, except percentages):\nThree Months Ended\nMarch 31,\n% Change from\n2021 2022 Prior Year\nEMEA revenues $ 17,031 $ 20,317 19 %\nEMEA constant currency revenues 21,628 27 %\nAPAC revenues 10,455 11,841 13 %\nAPAC constant currency revenues 12,440 19 %\nOther Americas revenues 2,905 3,842 32 %\nOther Americas constant currency revenues 3,923 35 %\nUnited States revenues 25,032 31,733 27 %\nHedging gains (losses) (109) 278\nTotal revenues $ 55,314 $ 68,011 23 %\nRevenues, excluding hedging effect $ 55,423 $ 67,733\nExchange rate effect 1,991\nTotal constant currency revenues $ 69,724 26 %\nEMEA revenue growth from the three months ended March 31, 2021 to the three months ended March 31,\n2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar\nstrengthening relative to the Euro.\nAPAC revenue growth from the three months ended March 31, 2021 to the three months ended March 31,\n2022 was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar\nstrengthening relative to the Japanese yen.\nOther Americas revenue growth from the three months ended March 31, 2021 to the three months ended\nMarch 31, 2022 was not materially affected by changes in foreign currency exchange rates.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2021 2022\nTAC $ 9,712 $ 11,990\nOther cost of revenues 14,391 17,609\nTotal cost of revenues $ 24,103 $ 29,599\nTotal cost of revenues as a percentage of revenues 43.6 % 43.5 %\n36",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "36",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf-page-30-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2022, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure and platform services as well as communication and\ncollaboration tools; sales of other products and services, such as apps and in-app purchases, and hardware; and\nfees received for subscription-based products. For details on how we recognize revenue, see Note 1 of the Notes to\nConsolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year\nended December 31, 2022.\nIn addition to the long-term trends and their financial effect on our business noted in \"Trends in Our Business\nand Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31,\n2022, fluctuations in our revenues have been and may continue to be affected by a combination of factors,\nincluding:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product and service launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from\nother sources (\"Google other revenues\"), Google Cloud, and Other Bets revenues have been and may continue to\nbe affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google other revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google\nsearch properties and other Google owned and operated properties including Gmail, Google Maps, and Google\n30",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "30",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf-page-29-text",
        "text": "Financial filing text section: ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2023, including Part I, Item 1A \"Risk Factors,\" as updated in this Quarterly Report\non Form 10-Q.\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure and platform services as well as communication and\ncollaboration tools; sales of other products and services, such as fees received for subscription-based products,\napps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of\nthe Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for\nthe fiscal year ended December 31, 2023.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2023, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product and service launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from\nother sources (\"Google subscriptions, platforms, and devices revenues\"), Google Cloud, and Other Bets revenues\nhave been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n29",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "29",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf-page-34-text",
        "text": "Financial filing text section: Google Network\nGoogle Network revenues decreased $83 million from the three months ended March 31, 2023 to the three\nmonths ended March 31, 2024 primarily driven by a decrease in AdSense revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a\npercentage, from three months ended March 31, 2023 to three months ended March 31, 2024:\nGoogle Search & other\nPaid clicks change 5 %\nCost-per-click change 8 %\nGoogle Network\nImpressions change (13) %\nCost-per-impression change 14 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $1.3 billion from the three months ended\nMarch 31, 2023 to the three months ended March 31, 2024, primarily driven by an increase in subscription\nrevenues, largely from growth in the number of paid subscribers for YouTube services.\nGoogle Cloud\nGoogle Cloud revenues increased $2.1 billion from the three months ended March 31, 2023 to the three\nmonths ended March 31, 2024. Growth was primarily driven by Google Cloud Platform followed by Google\nWorkspace offerings. Google Cloud's infrastructure and platform services were the largest drivers of growth in\nGoogle Cloud Platform.\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the\naddresses of our customers:\nThree Months Ended\nMarch 31,\n2023 2024\nUnited States 47 % 48 %\nEMEA 30 % 30 %\nAPAC 17 % 16 %\nOther Americas 6 % 6 %\nHedging gains (losses) 0 % 0 %\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in\nmultiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period\ncomparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP\npercentage change in constant currency revenues (\"percentage change in constant currency revenues\") for\n34",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "34",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf-page-35-text",
        "text": "Financial filing text section: financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe\nthe presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to\nunderstand our performance, because it excludes the effects of foreign currency volatility that are not indicative of\nour core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant\nperiod over period. We define constant currency revenues as revenues excluding the effect of foreign currency\nexchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated\nlevel. We use constant currency revenues to determine the constant currency revenue percentage change on a\nyear-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior\nyear comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period\nrevenues over prior year comparable period revenues where current period foreign currency revenues are\ntranslated using prior year comparable period exchange rates and hedging effects are excluded from revenues of\nboth periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with\nGAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled\nmeasures used by other companies and are not a measure of performance presented in accordance with GAAP.\nThe following table presents the foreign currency exchange effect on international revenues and total revenues\n(in millions, except percentages):\nThree Months Ended March 31, 2024\n% Change from Prior Period\nThree Months Ended\nMarch 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2023 2024 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 32,864 $ 38,737 $ 0 $ 38,737 18 % 0 % 18 %\nEMEA 21,078 23,788 204 23,584 13 % 1 % 12 %\nAPAC 11,681 13,289 (439) 13,728 14 % (4) % 18 %\nOther Americas 4,080 4,653 (152) 4,805 14 % (4) % 18 %\nRevenues, excluding hedging\neffect 69,703 80,467 (387) 80,854 15 % (1) % 16 %\nHedging gains (losses) 84 72\nTotal revenues(1) $ 69,787 $ 80,539 $ 80,854 15 % 0 % (1) % 16 %\n(1) Total constant currency revenues of $80.9 billion for the three months ended March 31, 2024 increased $11.2 billion\ncompared to $69.7 billion in revenues, excluding hedging effect, for the three months ended March 31, 2023.\nEMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to\nthe U.S. dollar weakening relative to the Euro, partially offset by the U.S. dollar strengthening relative to the Turkish\nlira.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Argentine peso.\n35",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "35",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf-page-32-text",
        "text": "Financial filing text section: ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other\nproducts and services, such as fees received for subscription-based products, apps and in-app purchases, and\ndevices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated\nFinancial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product, service, and market launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources\n(\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to\nbe, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n32",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "32",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf-page-39-text",
        "text": "Financial filing text section: The following table presents the foreign currency exchange effect on international revenues and total revenues\n(in millions, except percentages):\nThree Months Ended March 31, 2025\n% Change from Prior Period\nThree Months Ended\nMarch 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2024 2025 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 38,737 $ 43,964 $ 0 $ 43,964 13 % 0 % 13 %\nEMEA 23,788 25,923 (724) 26,647 9 % (3) % 12 %\nAPAC 13,289 14,854 (381) 15,235 12 % (3) % 15 %\nOther Americas 4,653 5,233 (500) 5,733 12 % (11) % 23 %\nRevenues, excluding hedging\neffect 80,467 89,974 (1,605) 91,579 12 % (2) % 14 %\nHedging gains (losses) 72 260\nTotal revenues(1) $ 80,539 $ 90,234 $ 91,579 12 % 0 % (2) % 14 %\n(1) Total constant currency revenues of $91.6 billion for the three months ended March 31, 2025 increased $11.1 billion\ncompared to $80.5 billion in revenues, excluding hedging effect, for the three months ended March 31, 2024.\nEMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen, Australian dollar, and South Korean won.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Brazilian real.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nTAC $ 12,946 $ 13,748\nOther cost of revenues 20,766 22,613\nTotal cost of revenues $ 33,712 $ 36,361\nTotal cost of revenues as a percentage of revenues 42 % 40 %\nCost of revenues increased $2.6 billion from the three months ended March 31, 2024 to the three months\nended March 31, 2025 due to an increase in other cost of revenues and TAC of $1.8 billion and $802 million,\nrespectively.\nThe increase in TAC from the three months ended March 31, 2024 to the three months ended March 31, 2025\nwas largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to\nTAC. The TAC rate decreased from 21.0% to 20.6% from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to a revenue mix shift from Google Network properties to Google\nSearch & other properties. The TAC rate on Google Search & other revenues increased from the three months\nended March 31, 2024 to the three months ended March 31, 2025 primarily due to increases related to mobile\nsearches, which carries higher TAC because more mobile searches are channeled through paid access points. The\nTAC rate on Google Network revenues decreased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to a combination of factors, none of which were individually significant.\nThe increase in other cost of revenues from the three months ended March 31, 2024 to the three months\nended March 31, 2025 was primarily due to increases in content acquisition costs, largely for YouTube,\ndepreciation expense, and other technical infrastructure operations costs.\n39",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "39",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf-page-33-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2022, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure and platform services as well as communication and\ncollaboration tools; sales of other products and services, such as apps and in-app purchases, and hardware; and\nfees received for subscription-based products. For details on how we recognize revenue, see Note 1 of the Notes to\nConsolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year\nended December 31, 2022.\nIn addition to the long-term trends and their financial effect on our business noted in \"Trends in Our Business\nand Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31,\n2022, fluctuations in our revenues have been and may continue to be affected by a combination of factors,\nincluding:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product and service launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from\nother sources (\"Google other revenues\"), Google Cloud, and Other Bets revenues have been and may continue to\nbe affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google other revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google\nsearch properties and other Google owned and operated properties including Gmail, Google Maps, and Google\n33",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "33",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf-page-33-text",
        "text": "Financial filing text section: ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2023, including Part I, Item 1A \"Risk Factors,\" as updated in our Quarterly Report\non Form 10-Q for the quarter ended March 31, 2024 and in this Quarterly Report on Form 10-Q.\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 13 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure and platform services as well as communication and\ncollaboration tools; sales of other products and services, such as fees received for subscription-based products,\napps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of\nthe Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for\nthe fiscal year ended December 31, 2023.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2023, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product and service launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from\nother sources (\"Google subscriptions, platforms, and devices revenues\"), Google Cloud, and Other Bets revenues\nhave been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n33",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "33",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf-page-38-text",
        "text": "Financial filing text section: Google Network\nGoogle Network revenues decreased $406 million from the three months ended June 30, 2023 to the three\nmonths ended June 30, 2024, primarily driven by a decrease in AdMob revenues. Additionally, Google Network\nrevenues were adversely affected by changes in foreign currency exchange rates for the three months ended June\n30, 2024.\nGoogle Network revenues decreased $489 million from the six months ended June 30, 2023 to the six months\nended June 30, 2024 primarily driven by a decrease in AdSense revenues. Additionally, Google Network revenues\nwere adversely affected by changes in foreign currency exchange rates for the six months ended June 30, 2024.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a\npercentage, from three and six months ended June 30, 2023 to three and six months ended June 30, 2024:\nThree Months Six Months\nEnded June 30, Ended June 30,\n2024 2024\nGoogle Search & other\nPaid clicks change 6 % 5 %\nCost-per-click change 7 % 8 %\nGoogle Network\nImpressions change (17) % (15) %\nCost-per-impression change 13 % 14 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $1.2 billion and $2.5 billion from the three\nand six months ended June 30, 2023 to the three and six months ended June 30, 2024, respectively. The growth\nwas primarily driven by an increase in subscription revenues, largely from growth in the number of paid subscribers\nfor YouTube services.\nGoogle Cloud\nGoogle Cloud revenues increased $2.3 billion and $4.4 billion from the three and six months ended June 30,\n2023 to the three and six months ended June 30, 2024, respectively. The growth was primarily driven by Google\nCloud Platform followed by Google Workspace offerings. Google Cloud's infrastructure and platform services were\nthe largest drivers of growth in Google Cloud Platform.\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the\naddresses of our customers:\nThree Months Ended Six Months Ended\nJune 30, June 30,\n2023 2024 2023 2024\nUnited States 47 % 49 % 47 % 48 %\nEMEA 30 % 29 % 30 % 29 %\nAPAC 17 % 16 % 17 % 17 %\nOther Americas 6 % 6 % 6 % 6 %\nHedging gains (losses) 0 % 0 % 0 % 0 %\n38",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "38",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf-page-40-text",
        "text": "Financial filing text section: Six Months Ended June 30, 2024\n% Change from Prior Period\nSix Months Ended June\n30, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2023 2024 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 67,937 $ 79,933 $ 0 $ 79,933 18 % 0 % 18 %\nEMEA 43,367 48,471 (163) 48,634 12 % 0 % 12 %\nAPAC 24,409 27,112 (1,034) 28,146 11 % (4) % 15 %\nOther Americas 8,591 9,591 (457) 10,048 12 % (5) % 17 %\nRevenues, excluding hedging\neffect 144,304 165,107 (1,654) 166,761 14 % (2) % 16 %\nHedging gains (losses) 87 174\nTotal revenues(1) $ 144,391 $ 165,281 $ 166,761 14 % 0 % (2) % 16 %\n(1) Total constant currency revenues of $166.8 billion for the six months ended June 30, 2024 increased $22.5 billion\ncompared to $144.4 billion in revenues, excluding hedging effect, for the six months ended June 30, 2023.\nEMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect\nof the U.S. dollar strengthening relative to the Turkish lira was largely offset by the U.S. dollar weakening relative to\nthe British pound and the Euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Argentine peso.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended Six Months Ended\nJune 30, June 30,\n2023 2024 2023 2024\nTAC $ 12,537 $ 13,387 $ 24,258 $ 26,333\nOther cost of revenues 19,379 22,120 38,270 42,886\nTotal cost of revenues $ 31,916 $ 35,507 $ 62,528 $ 69,219\nTotal cost of revenues as a percentage of revenues 43 % 42 % 43 % 42 %\nCost of revenues increased $3.6 billion from the three months ended June 30, 2023 to the three months ended\nJune 30, 2024 due to an increase in other cost of revenues and TAC of $2.7 billion and $850 million, respectively.\nCost of revenues increased $6.7 billion from the six months ended June 30, 2023 to the six months ended June 30,\n2024 due to an increase in other cost of revenues and TAC of $4.6 billion and $2.1 billion, respectively.\nThe increase in TAC from the three and six months ended June 30, 2023 to the three and six months ended\nJune 30, 2024 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in\nrevenues subject to TAC. The TAC rate decreased from 21.6% to 20.7% from the three months ended June 30,\n2023 to the three months ended June 30, 2024 and decreased from 21.5% to 20.9% from the six months ended\nJune 30, 2023 to the six months ended June 30, 2024, primarily due to a revenue mix shift from Google Network\nproperties to Google Search & other properties. The TAC rate on Google Search & other revenues was substantially\nconsistent from the three and six months ended June 30, 2023 to the three and six months ended June 30, 2024.\nThe TAC rate on Google Network revenues was substantially consistent from the three months ended June 30,\n2023 to the three months ended June 30, 2024 and reflected a slight increase from the six months ended June 30,\n2023 to the six months ended June 30, 2024 due to a combination of factors, none of which were individually\nsignificant.\nThe increase in other cost of revenues from the three and six months ended June 30, 2023 to the three and six\nmonths ended June 30, 2024 was primarily due to increases in content acquisition costs, largely for YouTube,\ndepreciation expense, digital services tax related to the recently enacted law in Canada, which is applied\nretroactively, and other technical infrastructure operations costs. Additionally, an increase in third-party service fees\n40",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "40",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf-page-37-text",
        "text": "Financial filing text section: ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other\nproducts and services, such as fees received for subscription-based products, apps and in-app purchases, and\ndevices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated\nFinancial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product, service, and market launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources\n(\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to\nbe, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n37",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "37",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf-page-34-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2022, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure and platform services as well as communication and\ncollaboration tools; sales of other products and services, such as apps and in-app purchases, and hardware; and\nfees received for subscription-based products. For details on how we recognize revenue, see Note 1 of the Notes to\nConsolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year\nended December 31, 2022.\nIn addition to the long-term trends and their financial effect on our business noted in \"Trends in Our Business\nand Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 31,\n2022, fluctuations in our revenues have been and may continue to be affected by a combination of factors,\nincluding:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product and service launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from\nother sources (\"Google other revenues\"), Google Cloud, and Other Bets revenues have been and may continue to\nbe affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google other revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google\nsearch properties and other Google owned and operated properties including Gmail, Google Maps, and Google\n34",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "34",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf-page-40-text",
        "text": "Financial filing text section: Table of Contents Alphabet Inc.\nPaid clicks increased from the three months ended September 30, 2022 to the three months ended September\n30, 2023 driven by a number of interrelated factors, including an increase in search queries resulting from growth in\nuser adoption and usage on mobile devices; growth in advertiser spending; and ongoing product and policy\nchanges. Cost-per-click increased from the three months ended September 30, 2022 to the three months ended\nSeptember 30, 2023 driven by a number of interrelated factors, including changes in device mix, geographic mix,\nadvertiser spending, ongoing product and policy changes, and property mix.\nPaid clicks increased from the nine months ended September 30, 2022 to the nine months ended September\n30, 2023 driven by a number of interrelated factors, including an increase in search queries resulting from growth in\nuser adoption and usage on mobile devices; growth in advertiser spending; and ongoing product and policy\nchanges. Cost-per-click decreased from the nine months ended September 30, 2022 to the nine months ended\nSeptember 30, 2023, driven by a number of interrelated factors, including changes in device mix, geographic mix,\nadvertiser spending, ongoing product and policy changes, and property mix, as well as by the adverse effect of\nchanges in foreign currency exchange rates for the nine months ended September 30, 2023, particularly during the\nfirst six months of the year.\nImpressions and cost-per-impression\nThe following table presents year-over-year changes in impressions and cost-per-impression (expressed as a\npercentage):\nThree Months Ended Nine Months Ended\nSeptember 30, September 30,\n2023 2023\nImpressions change (3)% (2)%\nCost-per-impression change 1% (3)%\nImpressions decreased from the three months ended September 30, 2022 to the three months ended\nSeptember 30, 2023, driven by decreases in Google Ad Manager and AdSense, partially offset by an increase in\nAdMob. The increase in cost-per-impression from the three months ended September 30, 2022 to the three months\nended September 30, 2023 was driven by a number of interrelated factors, including ongoing product and policy\nchanges, changes in device mix, geographic mix, product mix, and property mix.\nImpressions decreased from the nine months ended September 30, 2022 to the nine months ended\nSeptember 30, 2023, driven by decreases in Google Ad Manager and AdSense, partially offset by an increase in\nAdMob. The decrease in cost-per-impression from the nine months ended September 30, 2022 to the nine months\nended September 30, 2023 was driven by a number of interrelated factors, including ongoing product and policy\nchanges, changes in device mix, geographic mix, product mix, and property mix, as well as the adverse effect of\nchanges in foreign currency exchange rates for the nine months ended September 30, 2023, particularly during the\nfirst six months of the year.\nGoogle other revenues\nGoogle other revenues increased $1.4 billion and $3.6 billion from the three and nine months ended\nSeptember 30, 2022 to the three and nine months ended September 30, 2023, primarily driven by growth in\nYouTube non-advertising, largely due to an increase in paid subscribers. Growth was adversely affected by changes\nin foreign currency exchange rates for the nine months ended September 30, 2023, particularly during the first six\nmonths of the year.\nGoogle Cloud\nGoogle Cloud revenues increased $1.5 billion and $4.9 billion from the three and nine months ended\nSeptember 30, 2022 to the three and nine months ended September 30, 2023, respectively. Growth was primarily\ndriven by Google Cloud Platform followed by Google Workspace offerings. Google Cloud's infrastructure and\nplatform services were the largest drivers of growth in Google Cloud Platform.\n40",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "40",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf-page-33-text",
        "text": "Financial filing text section: ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2023, including Part I, Item 1A \"Risk Factors,\" as updated in our Quarterly Report\non Form 10-Q for the quarter ended June 30, 2024 and in this Quarterly Report on Form 10-Q.\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 14 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure and platform services as well as communication and\ncollaboration tools; sales of other products and services, such as fees received for subscription-based products,\napps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of\nthe Notes to Consolidated Financial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for\nthe fiscal year ended December 31, 2023.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2023, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product and service launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from\nother sources (\"Google subscriptions, platforms, and devices revenues\"), Google Cloud, and Other Bets revenues\nhave been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n33",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "33",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf-page-38-text",
        "text": "Financial filing text section: Google Network\nGoogle Network revenues decreased $121 million from the three months ended September 30, 2023 to the\nthree months ended September 30, 2024, primarily driven by the unfavorable effect of foreign currency exchange\nrates, partially offset by an increase in AdSense revenues.\nGoogle Network revenues decreased $610 million from the nine months ended September 30, 2023 to the\nnine months ended September 30, 2024 primarily driven by the unfavorable effect of foreign currency exchange\nrates as well as a decrease in AdMob revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a\npercentage, from three and nine months ended September 30, 2023 to three and nine months ended September\n30, 2024:\nThree Months Nine Months\nEnded Ended\nSeptember 30, September 30,\n2024 2024\nGoogle Search & other\nPaid clicks change 4 % 5 %\nCost-per-click change 8 % 8 %\nGoogle Network\nImpressions change (14) % (15) %\nCost-per-impression change 15 % 14 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $2.3 billion and $4.8 billion from the three\nand nine months ended September 30, 2023 to the three and nine months ended September 30, 2024, respectively.\nThe growth was primarily driven by increases in subscriptions and devices revenues. The increase in subscriptions\nrevenues was largely from growth in the number of paid subscribers for YouTube services and to a lesser extent for\nGoogle One. The increase in devices revenues was primarily driven by increased sales of Pixel devices, due to\nPixel family product launch timing in the third quarter this year as compared to the fourth quarter last year.\nGoogle Cloud\nGoogle Cloud revenues increased $2.9 billion and $7.4 billion from the three and nine months ended\nSeptember 30, 2023 to the three and nine months ended September 30, 2024, respectively. The growth was\nprimarily driven by Google Cloud Platform followed by Google Workspace offerings. Google Cloud's infrastructure\nand platform services were the largest drivers of growth in Google Cloud Platform.\n38",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "38",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf-page-40-text",
        "text": "Financial filing text section: The following table presents the foreign currency exchange effect on international revenues and total revenues\n(in millions, except percentages):\nThree Months Ended September 30, 2024\n% Change from Prior Period\nThree Months Ended\nSeptember 30, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2023 2024 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 36,354 $ 43,139 $ 0 $ 43,139 19 % 0 % 19 %\nEMEA 22,661 25,472 (146) 25,618 12 % (1) % 13 %\nAPAC 13,126 14,547 (285) 14,832 11 % (2) % 13 %\nOther Americas 4,553 5,093 (586) 5,679 12 % (13) % 25 %\nRevenues, excluding hedging\neffect 76,694 88,251 (1,017) 89,268 15 % (1) % 16 %\nHedging gains (losses) (1) 17\nTotal revenues(1) $ 76,693 $ 88,268 $ 89,268 15 % 0 % (1) % 16 %\n(1) Total constant currency revenues of $89.3 billion for the three months ended September 30, 2024 increased $12.6 billion\ncompared to $76.7 billion in revenues, excluding hedging effect, for the three months ended September 30, 2023.\nEMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Turkish lira.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Argentine peso and the Brazilian real.\nNine Months Ended September 30, 2024\n% Change from Prior Period\nNine Months Ended\nSeptember 30, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2023 2024 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 104,291 $ 123,072 $ 0 $ 123,072 18 % 0 % 18 %\nEMEA 66,028 73,943 (309) 74,252 12 % 0 % 12 %\nAPAC 37,535 41,659 (1,319) 42,978 11 % (4) % 15 %\nOther Americas 13,144 14,684 (1,043) 15,727 12 % (8) % 20 %\nRevenues, excluding hedging\neffect 220,998 253,358 (2,671) 256,029 15 % (1) % 16 %\nHedging gains (losses) 86 191\nTotal revenues(1) $ 221,084 $ 253,549 $ 256,029 15 % 0 % (1) % 16 %\n(1) Total constant currency revenues of $256.0 billion for the nine months ended September 30, 2024 increased $35.0 billion\ncompared to $221.1 billion in revenues, excluding hedging effect, for the nine months ended September 30, 2023.\nEMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect\nof the U.S. dollar strengthening relative to the Turkish lira was largely offset by the U.S. dollar weakening relative to\nthe British pound.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Argentine peso.\nCosts and Expenses\n40",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "40",
            "page_section": "mdna",
            "chunk_type": "prose"
        }
    }
]