[
    {
        "id": "goog-10-k-2022.pdf_page_19_chunk_0",
        "text": "Table of Contents Alphabet Inc. product warranty, product liability, and consumer protection claims related to product defects, among other litigation, and we may also be subject to claims involving health and safety, hazardous materials usage, other environmental effects, or service disruptions or failures. Claims have been brought, and we expect will continue to be brought, against us for defamation, negligence, breaches of contract, copyright and trademark infringement, unfair competition, unlawful activity, torts, privacy rights violations, fraud, or other legal theories based on the nature and content of information available on or via our services or due to our involvement in hosting, transmitting, marketing, branding, or providing access to content created by third parties. For example, the U.S. Department of Justice, various U.S. states, and other plaintiffs have filed several antitrust lawsuits about various aspects of our business, including our advertising technologies and practices, the operation and distribution of Google Search, and the operation and distribution of the Android operating system and Play Store. Other regulatory agencies in the U.S. and around the world, including competition enforcers, consumer protection agencies, and data protection authorities, have challenged and may continue to challenge our business practices and compliance with laws and regulations. We are cooperating with these investigations and defending litigation where appropriate. Various laws, regulations, investigations, enforcement lawsuits, and regulatory actions have in the past, and may in the future result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. Any of these legal proceedings could result in legal costs, diversion of management resources, negative publicity and other harms to our business. Estimating liabilities for our pending litigation is a complex, fact-intensive process that requires significant judgment, and the amounts we are ultimately liable for may exceed our estimates. The resolution of one or more such proceedings has resulted in, and may in the future result in, additional substantial fines, penalties, injunctions, and other sanctions that could harm our business, reputation, financial condition, and operating results. Privacy, data protection, and data usage regulations are complex and rapidly evolving areas. Any failure or alleged failure to comply with these laws could harm our business, reputation, financial condition, and operating results. Authorities around the world have adopted and are considering a number of legislative and regulatory proposals concerning data protection, data usage, and encryption of user data. Adverse legal rulings, legislation, or regulation have resulted in, and may continue to result in, fines and orders requiring that we change our practices, which have had and could continue to have an adverse effect on how we provide services, harming our business, reputation, financial condition, and operating results. These laws and regulations are evolving and subject to interpretation, and compliance obligations could cause us to incur substantial costs or harm the quality and operations of our products and",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "19",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_19_chunk_1",
        "text": "services in ways that harm our business. Examples of these laws include: • The General Data Protection Regulation and the United Kingdom General Data Protection Regulations, which apply to all of our activities conducted from an establishment in the EU or the United Kingdom, respectively, or related to products and services that we offer to EU or the United Kingdom users or customers, respectively, or the monitoring of their behavior in the EU or the UK, respectively. • Various state and foreign privacy laws and regulations, such as the California Consumer Privacy Act of 2018, the California Privacy Rights Act, the Virginia Consumer Data Protection Act, the Colorado Privacy Act, the Connecticut Data Privacy Act, and the Utah Consumer Privacy Act, all of which give new data privacy rights to their respective residents (including, in California, a private right of action in the event of a data breach resulting from our failure to implement and maintain reasonable security procedures and practices) and impose significant obligations on controllers and processors of consumer data. • State laws governing the processing of biometric information, such as the Illinois Biometric Information Privacy Act and the Texas Capture or Use of Biometric Identifier Act, which impose obligations on businesses that collect or disclose consumer biometric information. • Various federal, state, and foreign laws governing how companies provide age appropriate experiences to children and minors, including the collection and processing of children and minor’s data. These include the Children’s Online Privacy Protection Act of 1998, the United Kingdom Age-Appropriate Design Code, and the California Age Appropriate Design Code, all of which address the use and disclosure of the personal data of children and minors and impose obligations on online services or products directed to or likely to be accessed by children. • The California Internet of Things Security Law, which regulates the security of data used in connection with internet-connected devices. 18",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "19",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_75_chunk_0",
        "text": "Table of Contents Alphabet Inc. Indemnifications In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents. It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period. As of December 31, 2022, we did not have any material indemnification claims that were probable or reasonably possible. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters include speculative, substantial or indeterminate monetary amounts. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "75",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_75_chunk_1",
        "text": "ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision, which remains pending. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. For example: 74",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "75",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_76_chunk_0",
        "text": "Table of Contents Alphabet Inc. • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint alleging that Google’s digital advertising technology products violate U.S. antitrust laws. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, most recently opening a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe these complaints are without merit and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "76",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_76_chunk_1",
        "text": "our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. We also periodically have data incidents that we report to relevant regulators as required by law. Such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. 75",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "76",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_83_chunk_0",
        "text": "Table of Contents Alphabet Inc. Uncertain Tax Positions The following table summarizes the activity related to our gross unrecognized tax benefits (in millions): Year Ended December 31, 2020 2021 2022 Beginning gross unrecognized tax benefits $ 3,377 $ 3,837 $ 5,158 Increases related to prior year tax positions 372 529 253 Decreases related to prior year tax positions (557) (263) (437) Decreases related to settlement with tax authorities (45) (329) (140) Increases related to current year tax positions 690 1,384 2,221 Ending gross unrecognized tax benefits $ 3,837 $ 5,158 $ 7,055 We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $3.8 billion, $5.2 billion, and $7.1 billion as of December 31, 2020, 2021, and 2022, respectively, of which $2.6 billion, $3.7 billion, and $5.3 billion, if recognized, would affect our effective tax rate, respectively. As of December 31, 2021 and 2022, we accrued $270 million and $346 million in interest and penalties in provision for income taxes, respectively. We file income tax returns in the U.S. federal jurisdiction and in many state and foreign jurisdictions. Our two major tax jurisdictions are the U.S. federal and Ireland. We are subject to the continuous examination of our income tax returns by the IRS and other tax authorities. The IRS is currently examining our 2016 through 2018 tax returns. We have also received tax assessments in multiple foreign jurisdictions asserting transfer pricing adjustments or permanent establishment. We continue to defend any and all such claims as presented. The tax years 2015 through 2021 remain subject to examination by the appropriate governmental agencies for Irish tax purposes. There are other ongoing audits in various other jurisdictions that are not material to our financial statements. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. We continue to monitor the progress of ongoing discussions with tax authorities and the effect, if any, of the expected expiration of the statute of limitations in various taxing jurisdictions. We believe that an adequate provision has been made for any adjustments that may result from tax examinations. However, the outcome of tax audits cannot be predicted with certainty. If any issues addressed in our tax audits are resolved in a manner not consistent with management's expectations, we could be required to adjust our provision for income taxes in the period such resolutions occur. Although the timing of resolution, settlement, and closure of audits is not certain, it is reasonably possible that our unrecognized tax benefits from certain U.S. federal, state, and non U.S. tax positions could decrease by approximately $1.8 billion in the next 12 months. Positions that may be resolved include various U.S. and non-U.S. matters. Note 15. Information about Segments and Geographic Areas We report our segment results as Google Services, Google Cloud, and Other",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "83",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_83_chunk_1",
        "text": "Bets: • Google Services includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; sales of apps and in-app purchases, and hardware; and fees received for subscription-based products such as YouTube Premium and YouTube TV. • Google Cloud includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. Google Cloud generates revenues from fees received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services. • Other Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of health technology and internet services. Revenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and hardware, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. The associated costs, including depreciation and impairment, are allocated to operating segments as a service cost generally based on usage or headcount. 82",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "83",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_11_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of December 31, 2023, Alphabet had 182,502 employees. We have work councils and statutory employee representation obligations in certain countries, and we are committed to supporting protected labor rights, maintaining an open culture, and listening to all employees. Supporting healthy and open dialogue is central to how we work, and we communicate information about the company through multiple internal channels to our employees. When necessary we contract with businesses around the world to provide specialized services where we do not have appropriate in-house expertise or resources, often in fields that require specialized training like cafe operations, content moderation, customer support, and physical security. We also contract with temporary staffing agencies when we need to cover short-term leaves, when we have spikes in business needs, or when we need to quickly incubate special projects. We choose our partners and staffing agencies carefully, and review their compliance with Google’s Supplier Code of Conduct. We continually make improvements to promote a respectful and positive working environment for everyone — employees, vendors, and temporary staff alike. Government Regulation We are subject to numerous United States (U.S.) federal, state, and local, as well as foreign laws and regulations covering a wide variety of subjects, and the scope of this coverage continues to broaden with continuing new legal and regulatory developments in the U.S. and internationally. Like other companies in the technology industry, we face increasingly heightened scrutiny from both U.S. and foreign governments with respect to our compliance with laws and regulations. Many of these laws and regulations are evolving and their applicability and scope, as interpreted by the courts, remain uncertain. Particularly with regard to AI; climate change and sustainability; competition; consumer protection; content moderation; data privacy and security; news publications; and reporting on human capital and diversity, we have seen an increase in new and evolving laws and regulations, as well as related enforcement actions and investigations, being proposed and implemented in recent years by legislative and regulatory bodies around the world. Our compliance with these laws and regulations may be onerous and could, individually or in the aggregate, increase our cost of doing business, make our products and services less useful, limit our ability to pursue certain business models, cause us to change our business practices, affect our competitive position relative to our peers, and/ or otherwise harm our business, reputation, financial condition, and operating results. For additional information about government regulation applicable to our business, see Item 1A Risk Factors; Trends in Our Business and Financial Effect in Part II, Item 7; and Legal Matters in Note 10 of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K. Intellectual Property We rely on various intellectual property laws, confidentiality procedures and contractual provisions to protect our proprietary technology and our brand. We have registered, and applied for the registration of, U.S. and international trademarks, service marks, domain names, and copyrights. We have also filed patent applications",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "11",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_11_chunk_1",
        "text": "in the U.S. and foreign countries covering certain of our technology, and acquired patent assets to supplement our portfolio. We have licensed in the past, and expect that we may license in the future, certain of our rights to other parties. For additional information, see Item 1A Risk Factors of this Annual Report on Form 10-K. Available Information Our website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor. Access to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and our Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of charge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov. We webcast via our investor relations website our earnings calls and certain events we participate in or host with members of the investment community. Our investor relations website also provides notifications of news or announcements regarding our financial performance and other items that may be material or of interest to our investors, including SEC filings, investor events, press and earnings releases, and blogs. We also share Google news and product updates on Google's Keyword blog at https://www.blog.google/, which may be of interest or material to our investors. Further, corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of conduct, is also available on our investor relations website under the heading \"Governance.\" The content of our websites are not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only. 10.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "11",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_20_chunk_0",
        "text": "Table of Contents Alphabet Inc. settlements in the U.S., South Korea, and elsewhere that affect Google Play’s billing policies, fees, and business model; as well as litigation and new regulations under consideration in a range of jurisdictions. • AI: Laws and regulations focused on the development, use, and provision of AI technologies and other digital products and services, which could result in monetary penalties or other regulatory actions. For example, while legislative text has yet to be finalized and formally approved, provisional political agreement on a proposed EU AI Act was reached between co-legislators in December 2023, including that specific transparency and other requirements would be introduced for general purpose AI systems and the models on which those systems are based. In addition, the White House's Executive Order on the Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence devises a framework for the U.S. government, among other things, to regulate private sector use and development of certain foundation models. • Data privacy, collection, and processing: Laws and regulations further restricting the collection, processing, and/or sharing of user or advertising-related data, including privacy and data protection laws; laws affecting the processing of children's data (as discussed further below), data breach notification laws, and laws limiting data transfers (including data localization laws). • Copyright and other intellectual property: Copyright and related laws, including the EU Directive on Copyright in the Digital Single Market and European Economic Area transpositions, which may introduce new licensing regimes, increase liability with respect to content uploaded by users or linked to from our platforms, or create property rights in news publications that could require payments to news agencies and publishers, which may result in other regulatory actions. • Content moderation: Various laws covering content moderation and removal, and related disclosure obligations, such as the EU's Digital Services Act, Florida’s Senate Bill 7072 and Texas’ House Bill 20, and laws and proposed legislation in Singapore, Australia, and the United Kingdom that impose penalties for failure to remove certain types of content or require disclosure of information about the operation of our services and algorithms, which may make it harder for services like Google Search and YouTube to detect and deal with low-quality, deceptive, or harmful content. • Consumer protection: Consumer protection laws, including the EU’s New Deal for Consumers, which could result in monetary penalties and create a range of new compliance obligations. In addition, the applicability and scope of these and other laws and regulations, as interpreted by courts, regulators, or administrative bodies, remain uncertain and could be interpreted in ways that harm our business. For example, we rely on statutory safe harbors, like those set forth in the Digital Millennium Copyright Act and Section 230 of the Communications Decency Act in the U.S. and the E-Commerce Directive in Europe, to protect against liability for various linking, caching, ranking, recommending, and hosting activities. Legislation or court rulings affecting these safe harbors may adversely affect us and may impose significant operational challenges. There are legislative proposals",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "20",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_20_chunk_1",
        "text": "and pending litigation in the U.S., EU, and around the world that could diminish or eliminate safe harbor protection for websites and online platforms. Our development, use, and commercialization of AI products and services (including our implementation of AI in our offerings and internal systems) could subject us to regulatory action and legal liability, including under specific legislation regulating AI, as well as new applications of existing data protection, cybersecurity, privacy, intellectual property, and other laws. We are and may continue to be subject to claims, lawsuits, regulatory and government investigations, enforcement actions, consent orders, and other forms of regulatory scrutiny and legal liability that could harm our business, reputation, financial condition, and operating results. We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, and other matters. We are also subject to a variety of claims including product warranty, product liability, and consumer protection claims related to product defects, among other litigation, and we may also be subject to claims involving health and safety, hazardous materials usage, other environmental effects, AI training, development, and commercialization, or service disruptions or failures. Claims have been brought, and we expect will continue to be brought, against us for defamation, negligence, breaches of contract, copyright and trademark infringement, unfair competition, unlawful activity, torts, privacy rights violations, fraud, or other legal theories based on the nature and content of information available on or via our services, the design and effect of our products and services, or due to our involvement in hosting, transmitting, marketing, branding, or providing access to content created by third parties. 19.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "20",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_21_chunk_0",
        "text": "Table of Contents Alphabet Inc. For example, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws related to Google Play's billing practices. The presiding judge will determine remedies in 2024 and the range of potential remedies vary widely. We plan to appeal. In addition, the U.S. Department of Justice, various U.S. states, and other plaintiffs have filed several antitrust lawsuits about various aspects of our business, including our advertising technologies and practices, the operation and distribution of Google Search, and the operation and distribution of the Android operating system and Play Store. Other regulatory agencies in the U.S. and around the world, including competition enforcers, consumer protection agencies, and data protection authorities, have challenged and may continue to challenge our business practices and compliance with laws and regulations. We are cooperating with these investigations and defending litigation or appealing decisions where appropriate. Various laws, regulations, investigations, enforcement lawsuits, and regulatory actions have involved in the past, and may in the future result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, including divestiture, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. Any of these legal proceedings could result in legal costs, diversion of management resources, negative publicity and other harms to our business. Estimating liabilities for our pending proceedings is a complex, fact-specific, and speculative process that requires significant judgment, and the amounts we are ultimately liable for may be less than or exceed our estimates. The resolution of one or more such proceedings has resulted in, and may in the future result in, additional substantial fines, penalties, injunctions, and other sanctions that could harm our business, reputation, financial condition, and operating results. For additional information about the ongoing material legal proceedings to which we are subject, see Legal Proceedings in Part I, Item 3 of this Annual Report on Form 10-K. Privacy, data protection, and data usage regulations are complex and rapidly evolving areas. Any failure or alleged failure to comply with these laws could harm our business, reputation, financial condition, and operating results. Authorities around the world have adopted and are considering a number of legislative and regulatory proposals concerning data protection, data usage, and encryption of user data. Adverse legal rulings, legislation, or regulation have resulted in, and may continue to result in, fines and orders requiring that we change our practices, which have had and could continue to have an adverse effect on how we provide services, harming our business, reputation, financial condition, and operating results. These laws and regulations are evolving and subject to interpretation, and compliance obligations could cause us to incur substantial costs or harm the quality and operations of our products and services in ways that harm our business. Examples of these laws include: • The General Data Protection Regulation and",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "21",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_21_chunk_1",
        "text": "the United Kingdom General Data Protection Regulations, which apply to all of our activities conducted from an establishment in the EU or the United Kingdom, respectively, or related to products and services that we offer to EU or the United Kingdom users or customers, respectively, or the monitoring of their behavior in the EU or the UK, respectively. • Various comprehensive U.S. state and foreign privacy laws, which give new data privacy rights to their respective residents (including, in California, a private right of action in the event of a data breach resulting from our failure to implement and maintain reasonable security procedures and practices) and impose significant obligations on controllers and processors of consumer data. • State laws governing the processing of biometric information, such as the Illinois Biometric Information Privacy Act and the Texas Capture or Use of Biometric Identifier Act, which impose obligations on businesses that collect or disclose consumer biometric information. • Various federal, state, and foreign laws governing how companies provide age appropriate experiences to children and minors, including the collection and processing of children and minor’s data. These include the Children’s Online Privacy Protection Act of 1998, and the United Kingdom Age-Appropriate Design Code, all of which address the use and disclosure of the personal data of children and minors and impose obligations on online services or products directed to or likely to be accessed by children. • The California Internet of Things Security Law, which regulates the security of data used in connection with internet-connected devices. • The EU’s Digital Markets Act, which will require in-scope companies to obtain user consent for combining data across certain products and require search engines to share anonymized data with rival companies, among other changes. 20.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "21",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_79_chunk_0",
        "text": "Table of Contents Alphabet Inc. Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. Examples, for which given their nature we cannot estimate a possible loss, include: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. The trial ended on November 16, 2023, and we expect a decision in 2024. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "79",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_79_chunk_1",
        "text": "distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We responded to the SO on December 1, 2023. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories. The U.S. District Court subsequently vacated the trial date with the states, and any final approval of the settlement is expected to occur in 2024. In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, including a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe we have strong arguments against these claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. 78.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "79",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_80_chunk_0",
        "text": "Table of Contents Alphabet Inc. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws related to Google Play's business. The presiding judge will determine remedies in 2024, and the range of potential remedies vary widely. We plan to appeal. We also periodically have data incidents that we report to relevant regulators as required by law. These claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "80",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_80_chunk_1",
        "text": "could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See, Note 14 for information regarding income tax contingencies. 79.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "80",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_21_chunk_0",
        "text": "Table of Contents Alphabet Inc. implementation of AI in our offerings and internal systems) could subject us to regulatory action and legal liability, including under specific legislation regulating AI, as well as new applications of existing data protection, cybersecurity, privacy, intellectual property, and other laws. Further, we are subject to evolving laws, regulations, policies, and international accords relating to matters beyond our core products and services, including environmental sustainability, climate change, human capital, and employment matters. In response, we have implemented robust programs, adopted reporting frameworks and principles, and announced a number of complex and ambitious goals and initiatives that may require considerable investments. We cannot guarantee that our goals and initiatives will be fully realized on the timelines we expect or at all, and projects that are completed as planned may not achieve the results we anticipate. We are and may continue to be subject to claims, lawsuits, regulatory and government inquiries and investigations, enforcement actions, consent orders, and other forms of regulatory scrutiny and legal liability, including competition matters, that could harm our business, reputation, financial condition, and operating results. We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, and other matters. The U.S. Department of Justice (DOJ), various U.S. states, and other plaintiffs have filed, and may continue to file in the future, several antitrust lawsuits about various aspects of our business, including our advertising technologies and practices, the operation and distribution of Google Search, and the operation and distribution of the Android operating system and Play Store. For example, the DOJ and a number of state Attorneys General filed a lawsuit alleging that Google violated antitrust laws relating to Search and Search advertising, and in August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. The Court is holding a separate proceeding to determine remedies, which could include alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes. While we plan to appeal, there can be no assurance that our appeal will succeed, or that we will be able to change or decrease the severity of any remedies that may be ordered, and any or all of these potential remedies could harm our business, reputation, financial condition, and operating results. Also, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws relating to Google Play's business. The presiding judge issued a remedies decision in October 2024 that ordered a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing the verdict, but if we are unsuccessful, we could face significant expenses to implement the",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "21",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_21_chunk_1",
        "text": "remedies, and such costs and alterations could harm our business, reputation, financial condition, and operating results. Furthermore, in December 2020, several State Attorneys General, led by the Texas Attorney General, filed an antitrust lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated antitrust and other laws relating to its advertising technology. This case is set for trial in March 2025, and we could face significant civil penalties. In January 2023, the DOJ and several Attorneys General sued in the Eastern District of Virginia alleging similar antitrust violations relating to Google’s advertising technology. Trial in the DOJ matter concluded in September 2024 with a decision expected in early 2025. If we are unsuccessful, we could face an order on remedies that could harm our business, reputation, financial condition, and operating results. In addition to these regulatory proceedings, private individual and collective actions that overlap with claims pursued by regulators are pending in the U.S. and in several other jurisdictions. Adverse results in these or similar future lawsuits may include awards of monetary damages and remedies that could harm our business, reputation, financial condition, and operating results. Other regulatory agencies in the U.S. and around the world, including competition enforcers, consumer protection agencies, and data protection authorities, have challenged and may continue to challenge our business practices and compliance with laws and regulations. We are cooperating with these investigations and defending litigation or appealing decisions where appropriate. We are also subject to a variety of claims including product warranty, product liability, and consumer protection claims related to product defects, among other litigation, and we may also be subject to claims involving health and safety, hazardous materials usage, other environmental effects, AI training, development, and commercialization, or service disruptions or failures. Claims have been brought, and we expect will continue to be brought, against us for 20.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "21",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_22_chunk_0",
        "text": "Table of Contents Alphabet Inc. defamation, negligence, breaches of contract, patent, copyright and trademark infringement, unfair competition, unlawful activity, torts, privacy rights violations, fraud, or other legal theories based on the nature and content of information available on or via our services, the design and effect of our products and services, or due to our involvement in hosting, transmitting, marketing, branding, or providing access to content created by third parties. Various laws, regulations, investigations, enforcement lawsuits, and regulatory actions have involved in the past, and may in the future result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, including divestiture, and collateral related civil litigation or other adverse consequences. Any of these legal proceedings could also result in legal costs, diversion of management resources, and negative publicity, all of which could harm our business, reputation, financial condition, and operating results. Estimating liabilities for our pending proceedings is a complex, fact-specific, and speculative process that requires significant judgment, and the amounts we are ultimately liable for may be less than or exceed our estimates. The resolution of one or more such proceedings has resulted in, and may in the future result in, additional substantial fines, penalties, injunctions, and other sanctions that could harm our business, reputation, financial condition, and operating results. For additional information about the ongoing material legal proceedings to which we are subject, see Legal Proceedings in Item 3 of this Annual Report on Form 10-K. Privacy, data protection, data usage, and portability regulations are complex and rapidly evolving areas. Any failure or alleged failure to comply with these laws could harm our business, reputation, financial condition, and operating results. Authorities around the world have adopted and are considering a number of legislative and regulatory proposals concerning data protection, data usage and portability, and encryption of user data. Additionally, the increasing adoption of AI technologies, which rely on the collection of large amounts of data and use of such data for training purposes, has led data protection authorities around the world to consider and adopt new and evolving interpretations of data protection laws, imposing specific obligations with respect to the processing of personal data, including required notices, consents, and opt-outs. Further, the increased risk of inadvertent disclosure of confidential information or personal data in connection with the utilization of AI technologies may result in stronger regulatory scrutiny, leading to legal and regulatory investigations and enforcement actions that may negatively affect our business, even if unfounded. Adverse legal rulings, legislation, or regulation have resulted in, and may continue to result in, fines and orders requiring that we change our practices, which have had and could continue to have an adverse effect on how we provide services, harming our business, reputation, financial condition, and operating results. These laws and regulations are evolving and subject to interpretation, and compliance obligations could cause us to incur substantial costs or harm the quality and operations of our",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "22",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_22_chunk_1",
        "text": "products and services in ways that harm our business. Examples of these laws include: • The EU General Data Protection Regulation and the United Kingdom General Data Protection Regulations, which apply to all of our activities conducted from an establishment in the EU or the United Kingdom, respectively, or related to products and services that we offer to EU or the United Kingdom users or customers, respectively, or the monitoring of their behavior in the EU or the UK, respectively. • Various U.S. federal, U.S. state, and foreign privacy laws related to the processing and security of personal data, including (1) comprehensive privacy laws that provide data privacy rights (including, in California, a private right of action in the event of a data breach resulting from our failure to implement and maintain reasonable security procedures and practices) and impose significant obligations on controllers and processors of consumer data; (2) laws imposing obligations on businesses that collect or disclose biometric information (including, in Illinois, Texas, and Washington); (3) laws governing the collection and processing of children and minor’s data and how companies provide age appropriate online experiences (including, in the U.S., the Children’s Online Privacy Protection Act of 1998, the pending Children and Teens' Online Privacy Protection Act (COPPA 2.0), which passed the U.S. Senate in 2024, and similar U.S. state laws related to children’s privacy, such as the New York Child Data Protection Act, and the United Kingdom’s Age-Appropriate Design Code); and (4) laws regulating internet-connected devices (such as, in California, the Internet of Things Security Law). • The EU’s Digital Markets Act, which will require in-scope companies to obtain user consent for combining data across certain products and require search engines to share anonymized data with rival companies, among other changes; and the EU Data Act, which introduces new data portability requirements with respect to connected products (i.e., ‘internet of things’ products) and related services, as well as interoperability obligations on data processing services. 21.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "22",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_79_chunk_0",
        "text": "Table of Contents Alphabet Inc. Google Services Google Cloud Other Bets Total Balance as of December 31, 2022 $ 20,847 $ 7,205 $ 908 $ 28,960 Additions 240 3 0 243 Foreign currency translation and other adjustments 31 (9) (27) (5) Balance as of December 31, 2023 21,118 7,199 881 29,198 Additions 2,441 295 0 2,736 Foreign currency translation and other adjustments (38) (4) (7) (49) Balance as of December 31, 2024 $ 23,521 $ 7,490 $ 874 $ 31,885 Note 10. Commitments and Contingencies Commitments We have content licensing agreements with future fixed or minimum guaranteed commitments of $8.8 billion as of December 31, 2024, of which the majority is paid quarterly through the first quarter of 2030. Indemnifications In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents. It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period. As of December 31, 2024, we did not have any material indemnification claims that were probable or reasonably possible. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "79",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_79_chunk_1",
        "text": "of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Matters We are subject to formal and informal inquiries and investigations as well as litigation on various competition matters by regulatory authorities and private parties in the U.S., Europe, and other jurisdictions globally, including the following: • Shopping: In June 2017, the EC announced its decision that certain actions taken by Google relating to its display and ranking of shopping search results and ads infringed European antitrust laws and imposed a €2.4 billion fine. We appealed the EC decision and implemented product changes to bring shopping ads into 78.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "79",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_80_chunk_0",
        "text": "Table of Contents Alphabet Inc. compliance with the EC's decision. In September 2024, the European Court of Justice rejected our appeal and upheld the €2.4 billion fine. In the third quarter of 2024, we made a cash payment of $3.0 billion for the fine. • Android: In July 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European antitrust laws, imposed a €4.3 billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. • AdSense for Search: In March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €1.5 billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice. • Search: In October 2020, the DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. In August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such U.S. antitrust laws. A separate proceeding is being held to determine remedies, the range of which vary widely. The DOJ has proposed a high level remedy framework, which includes alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes, some of which could have a material adverse effect on our business. We have filed our own remedies proposal ahead of a hearing on remedies in April 2025. We expect a decision likely in the second half of 2025, after which we intend to appeal. Further, in June 2022, the Australian Competition and Consumer Commission and in October 2023, the Japanese Fair Trade Commission each opened an investigation into Search distribution practices. Given the nature of these matters, we cannot estimate a possible loss. • Advertising Technology: In December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, in January",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "80",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_80_chunk_1",
        "text": "2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia alleging that Google violated U.S. antitrust laws relating to its advertising technology, and a number of additional state Attorneys General subsequently joined the lawsuit. The trial ended in September 2024, and we expect a decision in early 2025. Further, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology, to which we responded. Given the nature of these matters, we cannot estimate a possible loss. • Google Play: In July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent. In December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated U.S. antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing the verdict and the trial court judge temporarily paused the implementation of the remedies while the Court of Appeals considers our request to pause implementation of the remedies pending the duration of the appeal. Given the nature of this matter, we cannot estimate a possible loss. 79.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "80",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_81_chunk_0",
        "text": "Table of Contents Alphabet Inc. • European Digital Markets Act: In March 2024, the EC opened two investigations regarding Google's compliance with certain provisions of EU's Digital Markets Act relating to Google Play and Search. Given the preliminary stages of this matter, we cannot estimate a possible loss. In addition to these proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions. We believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Further, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "81",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_81_chunk_1",
        "text": "our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See Note 14 for information regarding income tax contingencies. 80.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "81",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_92_chunk_0",
        "text": "Table of Contents Alphabet Inc. Trading and actual sale transactions made pursuant to such trading arrangements will be disclosed publicly in Section 16 filings with the SEC in accordance with applicable securities laws, rules, and regulations. Compensatory Arrangements of Certain Officers On April 16, 2024, the Leadership Development, Inclusion and Compensation Committee of the Board of Directors of Alphabet approved the accrual of dividend equivalent units to current and future holders of all unvested stock units in connection with any regular cash dividend that may be declared by the Board of Directors of Alphabet from time to time. As stock units are not outstanding shares of stock and thus would not otherwise be entitled to participate in any dividends, the crediting of dividend equivalent units is intended to preserve the equity-based incentives intended by the company when the stock units were granted and to treat the holders of unvested stock units consistently with all stockholders. Required Disclosure Pursuant to Section 13(r) of the Exchange Act As previously disclosed, Google LLC, a subsidiary of Alphabet, filed notifications with the Russian Federal Security Service (FSB) pursuant to Russian encryption control requirements, which must be complied with prior to the import of covered items. The information provided pursuant to Section 13(r) of the Exchange Act in Part II, Item 5 of our Quarterly Report on Form 10-Q for the quarter ended September 30, 2024 is incorporated herein by reference. ITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS Not applicable. 91.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "92",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_24_chunk_0",
        "text": "Table of Contents Alphabet Inc. Expected amortization expense related to purchased intangible assets held as of March 31, 2022 was as follows (in millions): Remainder of 2022 $ 363 2023 274 2024 244 2025 116 2026 71 Thereafter 114 Total $ 1,182 Note 9. Contingencies Indemnifications In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents. It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, we have a limited history of prior indemnification claims and the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period. As of March 31, 2022, we did not have any material indemnification claims that were probable or reasonably possible. Legal Matters Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, which remains pending. On October 29, 2018, we implemented changes to certain of our Android distribution practices. We recognized",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "24",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_24_chunk_1",
        "text": "a charge of $5.1 billion for the fine in the second quarter of 2018. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision, which remains pending. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. While each EC decision is under appeal, we included the fines in accrued expenses and other current liabilities on our Consolidated Balance Sheets as we provided bank guarantees (in lieu of a cash payment) for the fines. 24",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "24",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_25_chunk_0",
        "text": "Table of Contents Alphabet Inc. From time to time we are subject to formal and informal inquiries and investigations on competition matters by regulatory authorities in the United States (U.S.), Europe, and other jurisdictions. In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. Separately, on December 16, 2020, a number of state Attorneys General filed an antitrust complaint against Google in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. On June 22, 2021, the EC opened a formal investigation into Google's advertising technology business practices. On July 7, 2021, a number of state Attorneys General filed an antitrust complaint against us in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. We believe these complaints are without merit and will defend ourselves vigorously. The DOJ, state Attorneys General, and EC continue their investigations into certain aspects of our business. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise,",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_25_chunk_1",
        "text": "which could result in loss of revenues and adversely affect our business. Other We are also regularly subject to claims, suits, regulatory and government investigations, other proceedings, and consent decrees involving competition, intellectual property, privacy and cybersecurity, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations and suits ongoing in multiple jurisdictions. Such claims, suits, regulatory and government investigations, other proceedings, and consent decrees could result in substantial fines and penalties, injunctive relief, ongoing auditing and monitoring obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters in Russia. We do not believe these ongoing legal matters will have a material adverse effect on our business, consolidated financial position, results of operations, or cash flows. Certain outstanding matters include speculative, substantial or indeterminate monetary amounts. We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Significant judgment is required to determine both the likelihood of there being and the estimated amount of a loss related to such matters. With respect to our outstanding matters, based on our current knowledge, we believe that the amount or range of reasonably possible loss will not, either individually or in aggregate, have a material adverse effect on our business, consolidated financial position, results of operations, or cash flows. However, the outcome of such matters is inherently unpredictable and subject to significant uncertainties. 25",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_25_chunk_0",
        "text": "Table of Contents Alphabet Inc. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters include speculative, substantial or indeterminate monetary amounts. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_25_chunk_1",
        "text": "EC decision, which remains pending. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. For example: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. 25",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_26_chunk_0",
        "text": "Table of Contents Alphabet Inc. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, most recently opening a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe these complaints are without merit and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. We also periodically have data incidents that we report to relevant regulators as required by law. Such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_26_chunk_1",
        "text": "to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. For information regarding income tax contingencies, see Note 13. 26",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_23_chunk_0",
        "text": "Indemnifications In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents. It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period. As of March 31, 2024, we did not have any material indemnification claims that were probable or reasonably possible. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Matters On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. • On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "23",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_23_chunk_1",
        "text": "27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. • On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. • On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. 23",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "23",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_24_chunk_0",
        "text": "In addition, on July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories. The U.S. District Court subsequently vacated the trial date with the states, and we expect any final approval of the settlement would come in 2024. In December 2023, a California jury delivered a verdict in a similar lawsuit in Epic Games v. Google. The jury found that Google violated antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge will determine non-monetary remedies in 2024, and the range of potential remedies vary widely. We plan to appeal. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. Examples, for which given their nature we cannot estimate a possible loss include: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. The trial ended on November 16, 2023, and we expect a decision in 2024. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. A trial is scheduled for September 2024. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We responded to the SO on December 1, 2023. • In May 2022, the EC and the CMA each opened investigations into",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "24",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_24_chunk_1",
        "text": "Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, including a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe we have strong arguments against these claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the European Union, including those relating to our collection and use of location information and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. 24",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "24",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_25_chunk_0",
        "text": "Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See Note 12 for information regarding income tax contingencies. Note 9. Stockholders' Equity Share Repurchases During the three months ended March 31, 2023 and 2024, we repurchased $15.1 billion and $16.1 billion, respectively, of Alphabet's Class A and Class C shares. In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. As of March 31, 2024, $20.4 billion remained available for Class A and Class C share repurchases. In April 2024, the Board of Directors of Alphabet authorized the company to repurchase up",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_25_chunk_1",
        "text": "to an additional $70.0 billion of its Class A and Class C shares. The following table presents Class A and Class C shares repurchased and subsequently retired (in millions): Three Months Ended March 31, 2024 Shares Amount Class A share repurchases 23 $ 3,350 Class C share repurchases 88 12,707 Total share repurchases(1) 111 $ 16,057 (1) Shares repurchased include unsettled repurchases as of March 31, 2024. Class A and Class C shares are repurchased in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. Repurchases are executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date. 25",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_26_chunk_0",
        "text": "prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice. • Search: In October 2020, the DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. In August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such U.S. antitrust laws. A separate proceeding is being held to determine remedies, the range of which vary widely. The DOJ has proposed a high level remedy framework, which includes alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes, some of which could have a material adverse effect on our business. We have filed our own remedies proposal ahead of a hearing on remedies in April 2025. We expect a decision likely in the second half of 2025, after which we intend to appeal. Further, in June 2022, the Australian Competition and Consumer Commission and in October 2023, the Japanese Fair Trade Commission (JFTC) each opened an investigation into Search distribution practices. In April 2025, the JFTC issued a cease-and-desist order requiring us to make changes to our Android agreements to ensure they are consistent with Japanese antitrust law. The JFTC did not impose monetary penalties. We are constructively engaging with JFTC regarding compliance with the order. Given the nature of these matters, we cannot estimate a possible loss. • Advertising Technology: In December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for August 2025. Additionally, in January 2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia alleging that Google violated U.S. antitrust laws relating to its advertising technology, and a number of additional state Attorneys General subsequently joined the lawsuit. In April 2025, the U.S. District Court for the Eastern District of Virginia issued a mixed decision in the DOJ case against Google, ruling that the DOJ failed to show that Google’s advertiser tools or acquisitions of DoubleClick and AdMeld were anticompetitive, but that Google’s publisher tools violated antitrust laws by excluding rivals. We plan to appeal the adverse portion of this decision. Further, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology, to which we responded. In September 2024, the UK also issued a Statement of Objections",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_26_chunk_1",
        "text": "on similar grounds, to which we responded. Given the nature of these matters, we cannot estimate a possible loss. • Google Play: In July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent. In December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated U.S. antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing the verdict and the trial court judge temporarily paused the implementation of the remedies while the Court of Appeals considers our request to pause implementation of the remedies pending the duration of the appeal. Given the nature of this matter, we cannot estimate a possible loss. • European Digital Markets Act: In March 2024, the EC opened two investigations regarding Google's compliance with certain provisions of EU's Digital Markets Act relating to Google Play and Search. In March 2025, the EC issued preliminary findings of non-compliance in both investigations, to which we plan to respond in the coming weeks. Given the preliminary stages of this matter, we cannot estimate a possible loss. In addition to these antitrust proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions, including across Europe. Given the nature of these matters, we cannot estimate a possible loss. 26",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_27_chunk_0",
        "text": "We believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Further, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_27_chunk_1",
        "text": "matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See Note 14 for information regarding income tax contingencies. 27",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_27_chunk_0",
        "text": "Table of Contents Alphabet Inc. compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, which remains pending. On October 29, 2018, we implemented changes to certain of our Android distribution practices. We recognized a charge of $5.1 billion for the fine in the second quarter of 2018. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision, which remains pending. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. While each EC decision is under appeal, we included the fines in accrued expenses and other current liabilities on our Consolidated Balance Sheets as we provided bank guarantees (in lieu of a cash payment) for the fines. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the United States (U.S.), Europe, and other jurisdictions globally. For example: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. The DOJ's investigation of similar issues remains ongoing. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_27_chunk_1",
        "text": "of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In May 2022, the EC and the CMA each opened a formal investigation into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, most recently opening a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe these complaints are without merit and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. 27",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_28_chunk_0",
        "text": "Table of Contents Alphabet Inc. Other We are also regularly subject to claims, suits, regulatory and government investigations, other proceedings, and consent decrees involving competition, intellectual property, privacy and cybersecurity, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations and suits ongoing in multiple jurisdictions. Such claims, suits, regulatory and government investigations, other proceedings, and consent decrees could result in substantial fines and penalties, injunctive relief, ongoing auditing and monitoring obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. We do not believe these ongoing legal matters will have a material adverse effect on our business, consolidated financial position, results of operations, or cash flows. Certain outstanding matters include speculative, substantial or indeterminate monetary amounts. We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Significant judgment is required to determine both the likelihood of there being and the estimated amount of a loss related to such matters. With respect to our outstanding matters, based on our current knowledge, we believe that the amount or range of reasonably possible loss will not, either individually or in aggregate, have a material adverse effect on our business, consolidated financial position, results of operations, or cash flows. However, the outcome of such matters is inherently unpredictable and subject to significant uncertainties. We expense legal fees in the period in which they are incurred. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. For information regarding income tax contingencies,",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_28_chunk_1",
        "text": "see Note 13. Note 10. Stockholders' Equity Stock Split On July 15, 2022, the company executed a 20-for-one stock split with a record date of July 1, 2022, effected in the form of a one-time special stock dividend on each share of the company's Class A, Class B, and Class C stock. All references made to share or per share amounts in the accompanying consolidated financial statements and applicable disclosures have been retroactively adjusted to reflect the effects of the Stock Split. See Note 1 for further details. Share Repurchases In April 2021, the Board of Directors of Alphabet authorized the company to repurchase up to $50.0 billion of its Class C stock. In July 2021, the Board of Directors of Alphabet approved an amendment to the April 2021 authorization, permitting the company to repurchase both Class A and Class C shares in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. The repurchases from the April 2021 authorization were completed during the second quarter of 2022. In April 2022, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of June 30, 2022, $58.9 billion remains available for Class A and Class C share repurchases from the April 2022 authorization. 28",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_27_chunk_0",
        "text": "Table of Contents Alphabet Inc. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_27_chunk_1",
        "text": "prior to the decision. On June 4, 2019, we appealed the EC decision, which remains pending. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. For example: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising, and a trial is scheduled for September 2023. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, 27",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_28_chunk_0",
        "text": "Table of Contents Alphabet Inc. the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We will respond to the SO by December 31, 2023. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, most recently opening a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe these complaints are without merit and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. We also periodically have data incidents that we",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_28_chunk_1",
        "text": "report to relevant regulators as required by law. Such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. For information regarding income tax contingencies, see Note 13. 28",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_25_chunk_0",
        "text": "Note 8. Commitments and Contingencies Commitments We have content licensing agreements with future fixed or minimum guaranteed commitments of $9.7 billion as of June 30, 2024, of which the majority is paid quarterly through the first quarter of 2030. Indemnifications In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents. It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period. As of June 30, 2024, we did not have any material indemnification claims that were probable or reasonably possible. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Matters On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. • On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_25_chunk_1",
        "text": "search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. • On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. 25",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "25",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_26_chunk_0",
        "text": "• On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. In addition, on July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories. The U.S. District Court subsequently vacated the trial date with the states, and we expect any final approval of the settlement would come in 2024. In May 2024, we funded the settlement amount to an escrow agent. In December 2023, a California jury delivered a verdict in a similar lawsuit in Epic Games v. Google. The jury found that Google violated antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge will determine non-monetary remedies in 2024, and the range of potential remedies vary widely. We plan to appeal. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. Examples, for which given their nature we cannot estimate a possible loss include: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. The trial ended on November 16, 2023, and we expect a decision in 2024. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023,",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_26_chunk_1",
        "text": "a number of additional state Attorneys General joined the complaint. A trial is scheduled for September 2024. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We responded to the SO on December 1, 2023. • In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, including a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe we have strong arguments against these claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the European Union, including those relating to our collection and use of location information, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss 26",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_27_chunk_0",
        "text": "of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See Note 12 for information regarding income tax contingencies. Note 9.",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_27_chunk_1",
        "text": "Stockholders' Equity Share Repurchases In the three and six months ended June 30, 2024, we continued to repurchase both Class A and Class C shares in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. During the three and six months ended June 30, 2024, we repurchased $15.6 billion and $31.7 billion, respectively, of Alphabet's Class A and Class C shares. In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. In April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of June 30, 2024, $74.9 billion remained available for Class A and Class C share repurchases. The following table presents Class A and Class C shares repurchased and subsequently retired (in millions): Three Months Ended June 30, Six Months Ended June 30, 2024 2024 Shares Amount Shares Amount Class A share repurchases 19 $ 3,265 43 $ 6,615 Class C share repurchases 73 12,333 160 25,040 Total share repurchases(1) 92 $ 15,598 203 $ 31,655 27",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_46_chunk_0",
        "text": "During the three and six months ended June 30, 2024, we repurchased and subsequently retired 92 million and 203 million shares for $15.6 billion and $31.7 billion, respectively. In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. In April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of June 30, 2024, $74.9 billion remained available for Class A and Class C share repurchases. The following table presents Class A and Class C shares repurchased and subsequently retired (in millions): Three Months Ended June 30, 2024 Six Months Ended June 30, 2024 Shares Amount Shares Amount Class A share repurchases 19 $ 3,265 43 $ 6,615 Class C share repurchases 73 12,333 160 25,040 Total share repurchases(1) 92 $ 15,598 203 $ 31,655 (1) Shares repurchased include unsettled repurchases as of June 30, 2024. For additional information, see Note 9 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Dividend Program On April 25, 2024, the Board of Directors of Alphabet declared a cash dividend of $0.20 per share to stockholders of record as of June 10, 2024, on each of the company’s Class A, Class B, and Class C shares. These dividends were paid on June 17, 2024, totaling to $1.2 billion, $173 million, and $1.1 billion for Class A, Class B, and Class C shares, respectively. The company intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion. European Commission Fines In 2017, 2018, and 2019, the EC announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €2.4 billion ($2.7 billion as of June 27, 2017), €4.3 billion ($5.1 billion as of June 30, 2018), and €1.5 billion ($1.7 billion as of March 20, 2019), respectively. On September 14, 2022, the General Court reduced the 2018 fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal to the European Court of Justice. While each EC decision is under appeal, we included the fines in accrued expenses and other current liabilities on our Consolidated Balance Sheets, as we provided bank guarantees (in lieu of a cash payment) for the fines. For additional information, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q. Taxes As of June 30, 2024, we had short-term income taxes payable of $2.7 billion, related to a one-time transition tax payable incurred as a result of the U.S. Tax Cuts and Jobs Act (\"Tax Act\"). As permitted by the Tax Act, we will pay the transition tax in annual interest-free installments through 2025. We also have long-term taxes payable of $7.7 billion primarily related to uncertain tax",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "46",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_46_chunk_1",
        "text": "positions as of June 30, 2024. 46",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "46",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_29_chunk_0",
        "text": "• Android: In July 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European antitrust laws, imposed a €4.3 billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. • AdSense for Search: In March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €1.5 billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice. • Search: In October 2020, the U.S. Department of Justice (DOJ) and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. In August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such U.S. antitrust laws. A separate proceeding to determine remedies, the range of which vary widely, concluded in May 2025. The DOJ's remedy proposal included alterations to our products and services and our business models and operations, including structural remedies, and our distribution arrangements, among other changes, some of which could have a material adverse effect on our business. We expect a decision on remedies in August 2025, after which we intend to appeal the August 2024 ruling and, potentially, aspects of the remedies decision following our review of that decision. Further, in June 2022, the Australian Competition and Consumer Commission and in October 2023, the Japanese Fair Trade Commission (JFTC) each opened an investigation into Search distribution practices. In April 2025, the JFTC issued a cease-and-desist order requiring us to make changes to our Android agreements to ensure they are consistent with Japanese antitrust law. The JFTC did not impose monetary penalties. We are constructively engaging with JFTC regarding compliance with the order. Given the nature of these matters, we cannot estimate a possible loss. • Advertising Technology: In December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. A trial will take place after a decision on remedies is",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "29",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_29_chunk_1",
        "text": "issued in the following DOJ case against Google relating to its advertising technology. In January 2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia alleging that Google violated U.S. antitrust laws relating to its advertising technology, and a number of additional state Attorneys General subsequently joined the lawsuit. In April 2025, the U.S. District Court for the Eastern District of Virginia issued a mixed decision in the DOJ case against Google, ruling that the DOJ failed to show that Google’s advertiser tools or acquisitions of DoubleClick and AdMeld were anticompetitive, but that Google’s publisher tools violated antitrust laws by excluding rivals. A separate proceeding to determine remedies, the range of which vary widely, is scheduled to take place in September 2025. The DOJ's remedy proposal includes structural remedies, which could have a material adverse effect on our business. We also filed a remedy proposal ahead of the September proceedings. After a decision on remedies, we plan to appeal the adverse portion of the April 2025 decision and, potentially, aspects of the remedies decision following our review of that decision. Further, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology, to which we responded. In September 2024, the UK also issued a Statement of Objections on similar grounds, to which we responded. Given the nature of these matters, we cannot estimate a possible loss. • Google Play: In July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent. 29",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "29",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_30_chunk_0",
        "text": "In December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated U.S. antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing the verdict and the trial court judge temporarily paused the implementation of the remedies while the Court of Appeals considers our request to pause implementation of the remedies pending the duration of the appeal. Given the nature of this matter, we cannot estimate a possible loss. • European Digital Markets Act: In March 2024, the EC opened two investigations regarding Google's compliance with certain provisions of the European Union's (EU) Digital Markets Act relating to Google Play and Search. In March 2025, the EC issued preliminary findings of non-compliance in both investigations, to which we responded. Given the nature of this matter, we cannot estimate a possible loss. In addition to these antitrust proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions, including across Europe. Given the nature of these matters, we cannot estimate a possible loss. We believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. In April 2025, we reached a $1.4 billion agreement in principle to settle certain privacy matters. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "30",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_30_chunk_1",
        "text": "from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Further, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, AI training, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal matters will have a material adverse effect. Non-Income Taxes 30",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "30",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_27_chunk_0",
        "text": "Table of Contents Alphabet Inc. Note 9. Contingencies Indemnifications In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents. It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, we have a limited history of prior indemnification claims and the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period. As of September 30, 2022, we did not have any material indemnification claims that were probable or reasonably possible. Legal Matters Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court rejected our appeal on three claims, accepted our appeal on one claim, and reduced the fine to €4.1 billion. We are preparing to appeal to the European Court of Justice. In the second quarter",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_27_chunk_1",
        "text": "of 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in the third quarter of 2022. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision, which remains pending. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. While each EC decision is under appeal, we included the fines in accrued expenses and other current liabilities on our Consolidated Balance Sheets as we provided bank guarantees (in lieu of a cash payment) for the fines. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the United States (U.S.), Europe, and other jurisdictions globally. For example: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state 27",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_28_chunk_0",
        "text": "Table of Contents Alphabet Inc. deceptive trade laws relating to its advertising technology. The DOJ's investigation of similar issues remains ongoing. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In May 2022, the EC and the CMA each opened a formal investigation into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, most recently opening a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe these complaints are without merit and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are also regularly subject to claims, suits, regulatory and government investigations, other proceedings, and consent decrees involving competition, intellectual property, privacy and cybersecurity, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_28_chunk_1",
        "text": "and suits ongoing in multiple jurisdictions. Such claims, suits, regulatory and government investigations, other proceedings, and consent decrees could result in substantial fines and penalties, injunctive relief, ongoing auditing and monitoring obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect on our business, consolidated financial position, results of operations, or cash flows. Certain outstanding matters include speculative, substantial or indeterminate monetary amounts. We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Significant judgment is required to determine both the likelihood of there being and the estimated amount of a loss related to such matters. With respect to our outstanding matters, based on our current knowledge, we believe that the amount or range of reasonably possible loss will not, either individually or in aggregate, have a material adverse effect on our business, consolidated financial position, results of operations, or cash flows. However, the outcome of such matters is inherently unpredictable and subject to significant uncertainties. 28",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_49_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART II. OTHER INFORMATION ITEM 1. LEGAL PROCEEDINGS For a description of our material pending legal proceedings, see Note 9 “Contingencies - Legal Matters” of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q, which is incorporated herein by reference. ITEM 1A. RISK FACTORS Our operations and financial results are subject to various risks and uncertainties, including those described in Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2021, which could adversely affect our business, financial condition, results of operations, cash flows, and the trading price of our stock. Below are material changes to our risk factors since our Annual Report on Form 10-K for the year ended December 31, 2021. A variety of new and existing laws and/or interpretations could harm our business. We are subject to numerous U.S. and foreign laws and regulations covering a wide variety of subject matters. New laws and regulations, or new interpretations or applications of existing laws and regulations in a manner inconsistent with our practices, have made, and may continue to make, our products and services less useful, limit our ability to pursue certain business models or offer certain products and services in certain jurisdictions, require us to incur substantial costs, expose us to civil or criminal liability, or cause us to change our business practices. These laws and regulations are evolving and involve matters central to our business, including, among others: • Laws and regulations around the world focused on large technology platforms, including the Digital Markets Act in the European Union and proposed antitrust legislation on self-preferencing and mergers and acquisitions in the U.S., which may limit certain business practices, and in some cases, create the risk of significant penalties. • Privacy laws, such as the GDPR, CCPA, CPRA, Virginia CDPA, and ColoPA (as defined and discussed further below). • Data protection laws passed by many states within the U.S. and by certain countries regarding notification to data subjects and/or regulators when there is a security breach of personal data. • Consumer protection laws, including EU’s New Deal for Consumers, which could result in monetary penalties and create a range of new compliance obligations. • New laws further restricting the collection, processing and/or sharing of advertising-related data. Copyright or similar laws around the world, including the EU Directive on Copyright in the Digital Single Market (EUCD) and EU member state transpositions. These and similar laws that have been adopted or proposed introduce new licensing regimes that could affect our ability to operate. The EUCD and similar laws could also increase the liability of some content-sharing services with respect to content uploaded by their users. Some of these laws, as well as follow-on administrative or judicial actions, have also created or may create a new property right in news publications that limits the ability of some online services to link to, interact with, or present",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "49",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_49_chunk_1",
        "text": "such content. They may also require individual or collective compensation negotiations with news agencies and publishers for the use of such content, which may result in payment obligations that significantly exceed the value that such content provides to Google and its users, potentially harming our services, commercial operations, and business results. • Data localization laws, which generally mandate that certain types of data collected in a particular country be stored and/or processed within that country. • Various U.S. and international laws that govern the distribution of certain materials to children and regulate the ability of online services to collect information from minors, including the Children’s Online Privacy Protection Act of 1998 and the United Kingdom’s Age-Appropriate Design Code. • Various laws with regard to content moderation and removal, and related disclosure obligations, such as Germany's Network Enforcement Act, the European Union's Digital Services Act, Florida's Senate Bill 7072 and Texas' House Bill 20, which may affect our businesses and operations and may subject us to significant litigation, damage claims, and fines if they are interpreted and applied in a manner inconsistent with our practices and policies, or if we remove or promote (or fail to remove or promote) content in ways inconsistent with those laws. Other countries, including Singapore, Australia, and the United Kingdom, have implemented or are considering similar legislation imposing penalties for failure to remove certain types of content. 49",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "49",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_51_chunk_0",
        "text": "Table of Contents Alphabet Inc. ITEM 5. OTHER INFORMATION Under Section 13(r) of the Exchange Act, we are required to disclose if we or any of our affiliates knowingly conducted a transaction or dealing with entities or individuals designated pursuant to certain Executive Orders. The U.S. government has designated the Russian Federal Security Service (the “FSB”) pursuant to one of those Executive Orders, and the U.S. Department of the Treasury’s Office of Foreign Assets Control has accordingly updated General License No. 1B (the “OFAC General License”), which generally permits U.S. persons to engage in transactions and activities prohibited by the relevant Executive Order involving the FSB that are necessary and ordinarily incident to requesting, receiving, utilizing, paying for or dealing in licenses, permits, certifications, or notifications issued or registered by the FSB for the importation, distribution, or use of information technology products in Russia. In the past year and during the quarter ended September 30, 2022, Google LLC, a subsidiary of Alphabet, filed notifications with the FSB as required pursuant to Russian encryption product import controls for the purpose of enabling the import of certain software in Russia. Neither we nor our subsidiaries generated any gross revenues or net profits directly from such approval activity and neither we nor our subsidiaries sell to the FSB. Alphabet expects that Google LLC will continue to file these notifications as required under Russia law. 51",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "51",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_27_chunk_0",
        "text": "Table of Contents Alphabet Inc. Legal Matters We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate. Certain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Investigations On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022. On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_27_chunk_1",
        "text": "prior to the decision. On June 4, 2019, we appealed the EC decision. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. For example: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. The trial commenced on September 12, 2023, and we expect a decision in 2024. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. • On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology 27",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_28_chunk_0",
        "text": "Table of Contents Alphabet Inc. business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We will respond to the SO by December 31, 2023. • On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories. The U.S. District Court subsequently vacated the trial date with the states, and any final approval of the settlement is expected to occur in 2024. In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, including a formal review in May 2022 of Google's compliance with the new app store billing regulations. On October 6, 2023, the Korea Communications Commission issued a preliminary decision that we are not in full compliance with the new regulations. We intend to respond in November 2023. We believe these complaints are without merit and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_28_chunk_1",
        "text": "loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we currently have a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. We also periodically have data incidents that we report to relevant regulators as required by law. Such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity 28",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_26_chunk_0",
        "text": "matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect. We expense legal fees in the period in which they are incurred. Antitrust Matters On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us. • On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. We appealed the EC decision and implemented product changes to bring shopping ads into compliance with the EC's decision. On September 10, 2024, the European Court of Justice rejected our appeal and upheld the €2.4 billion fine imposed in 2017. In the third quarter of 2024, we made a cash payment of $3.0 billion for the 2017 shopping fine. • On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. • On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019. On September 18, 2024, the European Union’s (EU) General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has until November 28, 2024 to appeal the decision. In addition, on July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories. The U.S. District Court subsequently vacated the trial date with the states, and we expect any final approval of the settlement would come in 2024. In May 2024, we funded the settlement amount to an escrow agent. In December 2023, a California jury",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_26_chunk_1",
        "text": "delivered a verdict in a similar lawsuit in Epic Games v. Google. The jury found that Google violated antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision on October 7, 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing and have filed a motion to pause the implementation of some of the remedies pending the appeal. The trial court judge has temporarily paused the implementation of the remedies while the Court of Appeals considers our request to pause implementation of the remedies pending the duration of the appeal. From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. Examples, for which given their nature we cannot estimate a possible loss include: • In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. The trial ended on November 16, 2023, and on August 5, 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. A separate proceeding is being held to determine remedies, the range of which vary widely. The DOJ has proposed a high level remedy framework, which includes alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes, some of which could have a material adverse effect on our financial statements. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices. 26",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "26",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_27_chunk_0",
        "text": "• On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. The trial ended on September 27, 2024, and we expect a decision in late 2024 or early 2025. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We responded to the SO on December 1, 2023. On September 6, 2024, the CMA issued an SO informing Google of its preliminary view that Google violated UK competition laws relating to its advertising technology. We will respond to the SO. • In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. The EC closed its initial investigation, but is now investigating Google Play’s compliance with certain provisions of EU’s Digital Markets Act. Korean regulators are investigating Google Play's billing practices, including a formal review in May 2022 of Google's compliance with the new app store billing regulations. We believe we have strong arguments against these claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_27_chunk_1",
        "text": "increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. 27",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "27",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_28_chunk_0",
        "text": "We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See Note 13 for information regarding income tax contingencies. Note 10. Stockholders' Equity Share Repurchases In the three and nine months ended September 30, 2024, we continued to repurchase both Class A and Class C shares in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. During the three and nine months ended September 30, 2024, we repurchased $15.3 billion and $47.0 billion, respectively, of Alphabet's Class A and Class C shares. In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its Class A and Class C shares. Repurchases made pursuant to the April 2023 authorization were completed during the third quarter of 2024. In April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of September 30, 2024, $59.7 billion remained available for Class A and Class C share repurchases. The following table presents Class A and Class C shares repurchased and subsequently retired (in millions): Three Months Ended Nine Months Ended September 30, 2024 September 30, 2024 Shares Amount Shares Amount Class A share repurchases 17 $ 2,846 59 $ 9,461 Class C share repurchases 73 12,453 234 37,493 Total share repurchases(1) 90 $ 15,299 293 $ 46,954 (1) Shares repurchased include unsettled repurchases as of September 30, 2024. Repurchases are executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date. Dividends During the three and nine months ended September 30, 2024, total cash dividends were $1.2 billion and $2.3",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_28_chunk_1",
        "text": "billion for Class A, $173 million and $346 million for Class B, and $1.1 billion and $2.2 billion for Class C shares, respectively. The company intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion. 28",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "28",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_49_chunk_0",
        "text": "PART II. OTHER INFORMATION ITEM 1. LEGAL PROCEEDINGS For a description of our material pending legal proceedings, see Note 9 “Commitments and Contingencies - Legal Matters” of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q, which is incorporated herein by reference. ITEM 1A. RISK FACTORS Our operations and financial results are subject to various risks and uncertainties, including but not limited to those described in Part I, Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2023, as updated in our subsequent Quarterly Reports on Form 10-Q, which could harm our business, reputation, financial condition, and operating results, and affect the trading price of our Class A and Class C stock. Below are material changes to our risk factors since our Quarterly Report on Form 10-Q for the quarter ended June 30, 2024. We are and may continue to be subject to claims, lawsuits, regulatory and government inquiries and investigations, enforcement actions, consent orders, and other forms of regulatory scrutiny and legal liability, including competition matters, that could harm our business, reputation, financial condition, and operating results. We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, and other matters. The DOJ, various U.S. states, and other plaintiffs have filed, and may continue to file in the future, several antitrust lawsuits about various aspects of our business, including our advertising technologies and practices, the operation and distribution of Google Search, and the operation and distribution of the Android operating system and Play Store. For example, the DOJ and a number of state Attorneys General filed a lawsuit alleging that Google violated antitrust laws relating to Search and Search advertising, and in August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. The Court is holding a separate proceeding to determine remedies, which could include alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes. While we plan to appeal, there can be no assurance that our appeal will succeed, or that we will be able to change or decrease the severity of any remedies that may be ordered, and any or all of these potential remedies could harm our business, reputation, financial condition, and operating results. Also, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws related to Google Play's business. The presiding judge issued a remedies decision on October 7, 2024 that ordered a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing and have filed a",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "49",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_49_chunk_1",
        "text": "motion to pause the implementation of some of the remedies pending the appeal, but there can be no assurance that we will be successful in our appeal or in our efforts to pause the implementation of the remedies pending the appeal. If we are unsuccessful, we could face significant expenses to implement the remedies, and such costs and alterations could harm our business, reputation, financial condition, and operating results. Other regulatory agencies in the U.S. and around the world, including competition enforcers, consumer protection agencies, and data protection authorities, have challenged and may continue to challenge our business practices and compliance with laws and regulations. We are cooperating with these investigations and defending litigation or appealing decisions where appropriate. We are also subject to a variety of claims including product warranty, product liability, and consumer protection claims related to product defects, among other litigation, and we may also be subject to claims involving health and safety, hazardous materials usage, other environmental effects, AI training, development, and commercialization, or service disruptions or failures. Claims have been brought, and we expect will continue to be brought, against us for defamation, negligence, breaches of contract, patent, copyright and trademark infringement, unfair competition, unlawful activity, torts, privacy rights violations, fraud, or other legal theories based on the nature and content of information available on or via our services, the design and effect of our products and services, or due to our involvement in hosting, transmitting, marketing, branding, or providing access to content created by third parties. 49",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "49",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_50_chunk_0",
        "text": "Various laws, regulations, investigations, enforcement lawsuits, and regulatory actions have involved in the past, and may in the future result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, including divestiture, and collateral related civil litigation or other adverse consequences. Any of these legal proceedings could also result in legal costs, diversion of management resources, and negative publicity, all of which could harm our business, reputation, financial condition, and operating results. Estimating liabilities for our pending proceedings is a complex, fact-specific, and speculative process that requires significant judgment, and the amounts we are ultimately liable for may be less than or exceed our estimates. The resolution of one or more such proceedings has resulted in, and may in the future result in, additional substantial fines, penalties, injunctions, and other sanctions that could harm our business, reputation, financial condition, and operating results. For additional information about the ongoing material legal proceedings to which we are subject, see Legal Proceedings in Part II, Item 1 of this Quarterly Report on Form 10-Q. ITEM 2. UNREGISTERED SALES OF EQUITY SECURITIES AND USE OF PROCEEDS Issuer Purchases of Equity Securities The following table presents information with respect to Alphabet's repurchases of Class A and Class C stock during the quarter ended September 30, 2024. Total Number of Approximate Shares Dollar Value of Purchased as Shares that May Total Number of Total Number of Part of Publicly Yet Be Class A Shares Class C Shares Announced Purchased Purchased Purchased Average Price Average Price Programs Under the (in thousands) (in thousands) Paid per Class Paid per Class (in thousands) Program Period (1) (1) A Share (2) C Share (2) (1) (in millions) July 1 - 31 6,230 24,043 $ 181.08 $ 182.81 30,273 $ 69,418 August 1 - 31 6,109 24,867 $ 165.21 $ 166.46 30,976 $ 64,304 September 1 - 30 4,431 24,451 $ 159.86 $ 160.26 28,882 $ 59,704 Total 16,770 73,361 90,131 (1) Repurchases are being executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date. For additional information related to share repurchases, see Note 10 of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q. (2) Average price paid per share includes costs associated with the repurchases. ITEM 5. OTHER INFORMATION 10b5-1 Trading Plans During the quarter ended September 30, 2024, the following Section 16 director adopted, modified, or terminated a “Rule 10b5-1 trading arrangement” (as defined in Item 408 of Regulation S-K of the Exchange Act): • Frances Arnold, a member of the Board of Directors of Alphabet, adopted a trading plan on July 26, 2024 (with the first trade under the plan scheduled for October 30, 2024). The trading plan will be effective until November 7,",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "50",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_50_chunk_1",
        "text": "2025 to sell 50% of the (net) shares resulting from the vesting of 3,345 (gross) shares of Class C Capital Stock, in addition to 50% of the (net) shares of any future grants awarded during the term of the plan. There were no “non-Rule 10b5-1 trading arrangements” (as defined in Item 408 of Regulation S-K of the Exchange Act) adopted, modified or terminated during the quarter ended September 30, 2024 by our directors and Section 16 officers. Each of the Rule 10b5-1 trading arrangements are in accordance with our Policy Against Insider Trading and actual sale transactions made pursuant to such trading arrangements will be disclosed publicly in Section 16 filings with the SEC in accordance with applicable securities laws, rules, and regulations. Compensatory Arrangements of Certain Officers On April 16, 2024, the Leadership Development, Inclusion and Compensation Committee of the Board of Directors of Alphabet approved the accrual of dividend equivalent units to holders of all unvested stock units, subject to the approval of a dividend declaration by the Board of Directors of the company (which was announced 50",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "50",
            "page_section": "legal_proceedings"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_51_chunk_0",
        "text": "on October 29, 2024). As stock units are not outstanding shares of stock and thus would not otherwise be entitled to participate in any dividends (including the one referenced above), the crediting of dividend equivalent units is intended to preserve the equity-based incentives intended by the company when the stock units were granted and to treat the holders of stock units consistently with all stockholders. Required Disclosure Pursuant to Section 13(r) of the Exchange Act During the quarter ended September 30, 2024, Google LLC, a subsidiary of Alphabet, filed a notification with the Russian Federal Security Service (FSB) pursuant to Russian encryption control requirements, which must be complied with prior to the import of covered items. Neither we nor our subsidiaries generated any gross revenues or net profits directly from such activity and neither we nor our subsidiaries sell to the FSB. In the ordinary course of its business, Alphabet expects that Google LLC will continue to file these notifications as required under Russian law. 51",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "51",
            "page_section": "legal_proceedings"
        }
    }
]