[
    {
        "id": "goog-10-k-2022.pdf_page_42_chunk_0",
        "text": "Table of Contents Alphabet Inc. If an adverse 10% foreign currency exchange rate change was applied to total monetary assets, liabilities, and commitments denominated in currencies other than the functional currencies at the balance sheet date, it would have resulted in an adverse effect on income before income taxes of approximately $285 million and $136 million as of December 31, 2021 and 2022, respectively, after consideration of the effect of foreign exchange contracts in place for the years ended December 31, 2021 and 2022. We use foreign currency forward and option contracts, including collars (an option strategy comprised of a combination of purchased and written options) to protect forecasted U.S. dollar-equivalent earnings from changes in foreign currency exchange rates. When the U.S. dollar strengthens, gains from foreign currency forward and option contacts reduce the foreign currency losses related to our earnings. When the U.S. dollar weakens, losses from foreign currency forward and option contracts offset the foreign currency gains related to our earnings. These hedging contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements. We designate these contracts as cash flow hedges for accounting purposes. We reflect the gains or losses of foreign currency spot rate changes as a component of accumulated other comprehensive income (AOCI) and subsequently reclassify them into revenues to offset the hedged exposures as they occur. If the U.S. dollar weakened by 10% as of December 31, 2021 and 2022, the amount recorded in AOCI related to our cash flow hedges before tax effect would have been approximately $1.3 billion lower for both December 31, 2021 and 2022. The change in the value recorded in AOCI would be expected to offset a corresponding foreign currency change in forecasted hedged revenues when recognized. We use foreign exchange forward contracts designated as net investment hedges to hedge the foreign currency risks related to investment in foreign subsidiaries. These forward contracts serve to offset the foreign currency translation risk from our foreign operations. If the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $975 million and $903 million lower as of December 31, 2021 and 2022, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries. Interest Rate Risk Our Corporate Treasury investment strategy is to achieve a return that will allow us to preserve capital and maintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities, mortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate derivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and floating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair market value adversely affected due to a rise in interest rates,",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "42",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_42_chunk_1",
        "text": "while floating rate securities may produce less income than predicted if interest rates fall. Unrealized gains or losses on our marketable debt securities are primarily due to interest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt securities, we have elected the fair value option for which changes in fair value are recorded in other income (expense), net. We measure securities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until the securities are sold, less any expected credit losses. We use value-at-risk (VaR) analysis to determine the potential effect of fluctuations in interest rates on the value of our marketable debt security portfolio. The VaR is the expected loss in fair value, for a given confidence interval, for our investment portfolio due to adverse movements in interest rates. We use a variance/covariance VaR model with 95% confidence interval. The estimated one-day loss in fair value of marketable debt securities as of December 31, 2021 and 2022 are shown below (in millions): 12-Month Average As of December 31, As of December 31, 2021 2022 2021 2022 Risk category - interest rate $ 139 $ 256 $ 148 $ 198 Actual future gains and losses associated with our marketable debt security portfolio may differ materially from the sensitivity analyses performed as of December 31, 2021 and 2022 due to the inherent limitations associated with predicting the timing and amount of changes in interest rates and our actual exposures and positions. VaR analysis is not intended to represent actual losses but is used as a risk estimation. Equity Investment Risk Our marketable and non-marketable equity securities are subject to a wide variety of market-related risks that could substantially reduce or increase the fair value of our holdings. 41",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "42",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_43_chunk_0",
        "text": "Table of Contents Alphabet Inc. Our marketable equity securities are publicly traded stocks or funds and our non-marketable equity securities are investments in privately held companies, some of which are in the startup or development stages. We record marketable equity securities not accounted for under the equity method at fair value based on readily determinable market values, of which publicly traded stocks and mutual funds are subject to market price volatility, and represent $7.8 billion and $5.2 billion of our investments as of December 31, 2021 and 2022, respectively. A hypothetical adverse price change of 10% on our December 31, 2022 balance would decrease the fair value of marketable equity securities by $516 million. From time to time, we may enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Our non-marketable equity securities not accounted for under the equity method are adjusted to fair value for observable transactions for identical or similar investments of the same issuer or impairment (referred to as the measurement alternative). The fair value measured at the time of the observable transaction is not necessarily an indication of the current fair value as of the balance sheet date. These investments, especially those that are in the early stages, are inherently risky because the technologies or products these companies have under development are typically in the early phases and may never materialize, and they may experience a decline in financial condition, which could result in a loss of a substantial part of our investment in these companies. Valuations of our equity investments in private companies are inherently more complex due to the lack of readily available market data and observable transactions at lower valuations could result in significant losses. In addition, global economic conditions could result in additional volatility. The success of our investment in any private company is also typically dependent on the likelihood of our ability to realize appreciation in the value of investments through liquidity events such as public offerings, acquisitions, private sales or other market events. Changes in the valuation of non-marketable equity securities may not directly correlate with changes in valuation of marketable equity securities. As of December 31, 2021 and 2022, the carrying value of our non-marketable equity securities, which were accounted for under the measurement alternative, was $27.6 billion and $28.5 billion, respectively. The carrying values of our equity method investments, which totaled approximately $1.5 billion as of December 31, 2021 and 2022, generally do not fluctuate based on market price changes. However, these investments could be impaired if the carrying value exceeds the fair value and is not expected to recover. For further information about our equity investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. 42",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "43",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_56_chunk_0",
        "text": "Table of Contents Alphabet Inc. liabilities recorded at fair value are measured and classified in accordance with a three-tier fair value hierarchy based on the observability of the inputs available in the market used to measure fair value: Level 1 - Observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets. Level 2 - Inputs that are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant inputs are observable in the market or can be derived from observable market data. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, foreign exchange rates, and credit ratings. Level 3 - Unobservable inputs that are supported by little or no market activities. The fair value hierarchy requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The determination of fair value involves the use of appropriate valuation methods and relevant inputs into valuation models. Our financial assets and liabilities that are measured at fair value on a recurring basis include cash equivalents, marketable securities, derivative financial instruments, and certain non-marketable debt securities. Our financial assets measured at fair value on a nonrecurring basis include non-marketable equity securities. Other financial assets and liabilities are carried at cost with fair value disclosed, if required. We measure certain other instruments, including stock-based compensation awards settled in the stock of certain Other Bets, and certain assets and liabilities acquired in a business combination, also at fair value on a nonrecurring basis. Financial Instruments Our financial instruments include cash, cash equivalents, marketable and non-marketable securities, derivative financial instruments and accounts receivable. Credit Risks We are subject to credit risk from cash equivalents, marketable securities, derivative financial instruments, including foreign exchange contracts, and accounts receivable. We manage our credit risk exposure through timely assessment of our counterparty creditworthiness, credit limits and use of collateral management. Foreign exchange contracts are transacted with various financial institutions with high credit standing. Accounts receivable are typically unsecured and are derived from revenues earned from customers located around the world. We manage our credit risk exposure by performing ongoing evaluations to determine customer credit and we limit the amount of credit we extend. We generally do not require collateral from our customers. Cash Equivalents We invest excess cash primarily in government bonds, corporate debt securities, mortgage-backed and asset- backed securities, time deposits, and money market funds. Marketable Securities We classify all marketable debt securities that have effective maturities of three months or less from the date of purchase as cash equivalents and those with effective maturities of greater than three months as marketable securities on our Consolidated Balance Sheets. We determine the appropriate classification of our investments in marketable debt securities at the time of purchase and reevaluate such designation",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "56",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_56_chunk_1",
        "text": "at each balance sheet date. We have classified and accounted for our marketable debt securities as available-for-sale. After consideration of our risk versus reward objectives, as well as our liquidity requirements, we may sell these debt securities prior to their effective maturities. As we view these securities as available to support current operations, we classify highly liquid securities with maturities beyond 12 months as current assets under the caption marketable securities on the Consolidated Balance Sheets. We carry these securities at fair value, and report the unrealized gains and losses, net of taxes, as a component of stockholders’ equity, except for the changes in allowance for expected credit losses, which are recorded in other income (expense), net. For certain marketable debt securities we have elected the fair value option, for which changes in fair value are recorded in other income (expense), net. We determine any realized gains or losses on the sale of marketable debt securities on a specific identification method, and we record such gains and losses as a component of other income (expense), net. Our investments in marketable equity securities are measured at fair value with the related gains and losses, including unrealized, recognized in other income (expense), net. We classify our marketable equity securities subject 55",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "56",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_65_chunk_0",
        "text": "Table of Contents Alphabet Inc. Equity securities accounted for under the equity method As of December 31, 2021 and 2022, equity securities accounted for under the equity method had a carrying value of approximately $1.5 billion for both years. Our share of gains and losses, including impairments, are included as a component of other income (expense), net, in the Consolidated Statements of Income. See Note 7 for further details on other income (expense), net. Derivative Financial Instruments We use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns. We recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation. Cash Flow Hedges We designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the U.S. dollar. These contracts have maturities of 24 months or less. Cash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI. As of December 31, 2022, the net accumulated gain on our foreign currency cash flow hedges before tax effect was $171 million, which is expected to be reclassified from AOCI into revenues within the next 12 months. Fair Value Hedges We designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in other income (expense), net, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in other income (expense), net. Net Investment Hedges We designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "65",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_65_chunk_1",
        "text": "forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in other income (expense), net. Other Derivatives We enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in other income (expense), net along with the foreign currency gains and losses on monetary assets and liabilities. We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other derivatives are primarily reflected within the “other” component of other income (expense), net. See Note 7 for further details. 64",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "65",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_66_chunk_0",
        "text": "Table of Contents Alphabet Inc. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, 2021 2022 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 16,362 $ 15,972 Fair value hedges $ 2,556 $ 2,117 Net investment hedges $ 10,159 $ 8,751 Derivatives not designated as hedging instruments: Foreign exchange contracts $ 41,031 $ 34,979 Other contracts $ 4,275 $ 7,932 The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2021 As of December 31, 2022 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 867 $ 8 $ 271 $ 556 Derivatives not designated as hedging instruments: Foreign exchange contracts 42 452 365 207 Other contracts 52 121 40 47 Total derivatives not designated as hedging instruments 94 573 405 254 Total $ 961 $ 581 $ 676 $ 810 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Gains (Losses) Recognized in OCI on Derivatives Before Tax Effect Year Ended December 31, 2020 2021 2022 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ 102 $ 806 $ 1,699 Amount excluded from the assessment of effectiveness (37) 48 (188) Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness (851) 754 608 Total $ (786) $ 1,608 $ 2,119 65",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "66",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_67_chunk_0",
        "text": "Table of Contents Alphabet Inc. The table below presents the gains (losses) of our derivatives on the Consolidated Statements of Income: (in millions): Gains (Losses) Recognized in Income Year Ended December 31, 2020 2021 2022 Other Other Other income income income (expense), (expense), (expense), Revenues net Revenues net Revenues net Total amounts in the Consolidated Statements of Income $ 182,527 $ 6,858 $ 257,637 $ 12,020 $ 282,836 $ (3,514) Effect of cash flow hedges: Foreign exchange contracts Amount reclassified from AOCI to income $ 144 $ 0 $ 165 $ 0 $ 2,046 $ 0 Amount excluded from the assessment of effectiveness (amortized) 33 0 (16) 0 (85) 0 Effect of fair value hedges: Foreign exchange contracts Hedged items 0 18 0 (95) 0 (162) Derivatives designated as hedging instruments 0 (18) 0 95 0 163 Amount excluded from the assessment of effectiveness 0 4 0 8 0 16 Effect of net investment hedges: Foreign exchange contracts Amount excluded from the assessment of effectiveness 0 151 0 82 0 171 Effect of non designated hedges: Foreign exchange contracts 0 718 0 (860) 0 (395) Other contracts 0 (906) 0 101 0 144 Total gains (losses) $ 177 $ (33) $ 149 $ (669) $ 1,961 $ (63) Offsetting of Derivatives We enter into master netting arrangements and collateral security arrangements to reduce credit risk. Cash collateral received related to derivative instruments under our collateral security arrangements are included in other current assets with a corresponding liability. Cash and non-cash collateral pledged related to derivative instruments under our collateral security arrangements are included in other current assets. 66",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "67",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK We are exposed to financial market risks, including changes in foreign currency exchange rates, interest rates, and equity investment risks. Foreign Currency Exchange Risk We transact business globally in multiple currencies. International revenues, as well as costs and expenses denominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the U.S. dollar. As discussed below, we enter into derivative instruments to hedge foreign currency risk. Principal currencies hedged included the Australian dollar, British pound, Canadian dollar, Euro, and Japanese yen. For the purpose of analyzing foreign currency exchange risk, we considered the historical trends in foreign currency exchange rates and determined that it was reasonably possible that adverse changes in exchange rates of 10% could be experienced. We use foreign currency forward and option contracts to offset the foreign exchange risk on assets and liabilities denominated in currencies other than the functional currency of the subsidiary. These forward and option contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements on our assets and liabilities. The foreign currency gains and losses on these assets and liabilities are recorded in OI&E, which are offset by the gains and losses on the forward and option contracts. If an adverse 10% foreign currency exchange rate change was applied to total monetary assets, liabilities, and commitments denominated in currencies other than the functional currencies at the balance sheet date, it would have resulted in an adverse effect on income before income taxes of approximately $136 million and $503 million as of December 31, 2022 and 2023, respectively, after consideration of the effect of foreign exchange contracts in place for the years ended December 31, 2022 and 2023. We use foreign currency forward and option contracts, including collars (an option strategy comprised of a combination of purchased and written options) to protect forecasted U.S. dollar-equivalent earnings from changes in foreign currency exchange rates. When the U.S. dollar strengthens, gains from foreign currency forward and option contacts reduce the foreign currency losses related to our earnings. When the U.S. dollar weakens, losses from foreign currency forward and option contracts offset the foreign currency gains related to our earnings. These hedging contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements. We designate these contracts as cash flow hedges for accounting purposes. We reflect the gains or losses of foreign currency spot rate changes as a component of accumulated other comprehensive income (AOCI) and subsequently reclassify them into revenues to offset the hedged exposures as they occur. If the U.S. dollar weakened by 10% as of December 31, 2022 and 2023, the amount recorded in AOCI related to our cash flow hedges before tax effect would have been approximately $1.3 billion and $1.5 billion lower as of December 31, 2022 and 2023, respectively. The change in the value recorded in AOCI would be expected to offset",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "46",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_46_chunk_1",
        "text": "a corresponding foreign currency change in forecasted hedged revenues when recognized. We use foreign exchange forward contracts designated as net investment hedges to hedge the foreign currency risks related to investment in foreign subsidiaries. These forward contracts serve to offset the foreign currency translation risk from our foreign operations. If the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $903 million and $946 million lower as of December 31, 2022 and 2023, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries. Interest Rate Risk Our Corporate Treasury investment strategy is to achieve a return that will allow us to preserve capital and maintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities, mortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate derivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and floating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair market value adversely affected due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. Unrealized gains or losses on our marketable debt securities are primarily due to interest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. We measure securities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until the securities are sold, less any expected credit losses. 45.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "46",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_47_chunk_0",
        "text": "Table of Contents Alphabet Inc. We use value-at-risk (VaR) analysis to determine the potential effect of fluctuations in interest rates on the value of our marketable debt security portfolio. The VaR is the expected loss in fair value, for a given confidence interval, for our investment portfolio due to adverse movements in interest rates. We use a variance/covariance VaR model with 95% confidence interval. The estimated one-day loss in fair value of marketable debt securities as of December 31, 2022 and 2023 are shown below (in millions): 12-Month Average As of December 31, As of December 31, 2022 2023 2022 2023 Risk category - interest rate $ 256 $ 296 $ 198 $ 271 Actual future gains and losses associated with our marketable debt security portfolio may differ materially from the sensitivity analyses performed as of December 31, 2022 and 2023 due to the inherent limitations associated with predicting the timing and amount of changes in interest rates and our actual exposures and positions. VaR analysis is not intended to represent actual losses but is used as a risk estimation. Equity Investment Risk Our marketable and non-marketable equity securities are subject to a wide variety of market-related risks that could substantially reduce or increase the fair value of our holdings. Our marketable equity securities are publicly traded stocks or funds and our non-marketable equity securities are investments in privately held companies, some of which are in the startup or development stages. We record marketable equity securities not accounted for under the equity method at fair value based on readily determinable market values, of which publicly traded stocks and mutual funds are subject to market price volatility, and represent $5.2 billion and $6.0 billion of our investments as of December 31, 2022 and 2023, respectively. A hypothetical adverse price change of 10% on our December 31, 2023 balance would decrease the fair value of marketable equity securities by $597 million. From time to time, we may enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Our non-marketable equity securities not accounted for under the equity method are adjusted to fair value for observable transactions for identical or similar investments of the same issuer or impairment (referred to as the measurement alternative). The fair value measured at the time of the observable transaction is not necessarily an indication of the current fair value as of the balance sheet date. These investments, especially those that are in the early stages, are inherently risky because the technologies or products these companies have under development are typically in the early phases and may never materialize, and they may experience a decline in financial condition, which could result in a loss of a substantial part of our investment in these companies. Valuations of our equity investments in private companies are inherently more complex due to the lack of readily available market data and observable transactions at lower valuations could result in significant losses. In addition, global economic conditions could",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "47",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_47_chunk_1",
        "text": "result in additional volatility. The success of our investment in any private company is also typically dependent on the likelihood of our ability to realize appreciation in the value of investments through liquidity events such as public offerings, acquisitions, private sales or other market events. Changes in the valuation of non-marketable equity securities may not directly correlate with changes in valuation of marketable equity securities. As of December 31, 2022 and 2023, the carrying value of our non-marketable equity securities, which were accounted for under the measurement alternative, was $28.5 billion and $28.8 billion, respectively. The carrying values of our equity method investments, which totaled approximately $1.7 billion as of December 31, 2022 and 2023, generally do not fluctuate based on market price changes. However, these investments could be impaired if the carrying value exceeds the fair value and is not expected to recover. For additional information about our equity investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. 46.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "47",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_60_chunk_0",
        "text": "Table of Contents Alphabet Inc. Level 2 - Inputs that are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant inputs are observable in the market or can be derived from observable market data. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, foreign exchange rates, and credit ratings. Level 3 - Unobservable inputs that are supported by little or no market activities. The fair value hierarchy requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The determination of fair value involves the use of appropriate valuation methods and relevant inputs into valuation models. Our financial assets and liabilities that are measured at fair value on a recurring basis include cash equivalents, marketable securities, derivative financial instruments, and certain non-marketable debt securities. Our financial assets measured at fair value on a nonrecurring basis include non-marketable equity securities. Other financial assets and liabilities are carried at cost with fair value disclosed, if required. We measure certain other instruments, including SBC awards settled in the stock of Other Bet companies, and certain assets and liabilities acquired in a business combination, also at fair value on a nonrecurring basis. Financial Instruments Our financial instruments include cash, cash equivalents, marketable and non-marketable securities, derivative financial instruments and accounts receivable. Credit Risks We are subject to credit risk primarily from cash equivalents, marketable debt securities, derivative financial instruments, including foreign exchange contracts, and accounts receivable. We manage our credit risk exposure through timely assessment of our counterparty creditworthiness, credit limits and use of collateral management. Foreign exchange contracts are transacted with various financial institutions with high credit standing. Accounts receivable are typically unsecured and are derived from revenues earned from customers located around the world. We manage our credit risk exposure by performing ongoing evaluations to determine customer credit and we limit the amount of credit we extend. We generally do not require collateral from our customers. Cash Equivalents We invest excess cash primarily in government bonds, corporate debt securities, mortgage-backed and asset- backed securities, time deposits, and money market funds. Marketable Securities We classify all marketable debt securities that have effective maturities of three months or less from the date of purchase as cash equivalents and those with effective maturities of greater than three months as marketable securities on our Consolidated Balance Sheets. We determine the appropriate classification of our investments in marketable debt securities at the time of purchase and reevaluate such designation at each balance sheet date. We have classified and accounted for our marketable debt securities as available-for-sale. After consideration of our risk versus reward objectives, as well as our liquidity requirements, we may sell these debt securities prior to their effective maturities. As we view these securities as available to",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "60",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_60_chunk_1",
        "text": "support current operations, we classify highly liquid securities with maturities beyond 12 months as current assets under the caption marketable securities on the Consolidated Balance Sheets. We carry these securities at fair value, and report the unrealized gains and losses, net of taxes, as a component of stockholders’ equity, except for the changes in allowance for expected credit losses, which are recorded in OI&E. For certain marketable debt securities we have elected the fair value option, for which changes in fair value are recorded in OI&E. We determine any realized gains or losses on the sale of marketable debt securities on a specific identification method, and we record such gains and losses as a component of OI&E. Our investments in marketable equity securities are measured at fair value with the related gains and losses, including unrealized, recognized in OI&E. We classify our marketable equity securities subject to long-term lock-up restrictions beyond 12 months as other non-current assets on the Consolidated Balance Sheets. Non-Marketable Securities Non-marketable securities primarily consist of equity securities. We account for non-marketable equity securities through which we exercise significant influence but do not have control over the investee under the equity method. All other non-marketable equity securities that we hold are primarily accounted for under the measurement alternative. Under the measurement alternative, the carrying value is measured at cost, less any impairment, plus or minus 59.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "60",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_66_chunk_0",
        "text": "Table of Contents Alphabet Inc. As of December 31, 2023 Gross Gross Cash and Fair Value Adjusted Unrealized Unrealized Cash Marketable Hierarchy Cost Gains Losses Fair Value Equivalents Securities Fair value changes recorded in other comprehensive income Time deposits Level 2 $ 2,628 $ 0 $ 0 $ 2,628 $ 2,628 $ 0 Government bonds Level 2 38,106 233 (679) 37,660 1,993 35,667 Corporate debt securities Level 2 22,457 112 (637) 21,932 0 21,932 Mortgage-backed and 17,243 88 (634) 16,697 0 16,697 asset-backed securities Level 2 Total investments with fair value change reflected in other comprehensive income(1) $ 80,434 $ 433 $ (1,950) $ 78,917 $ 4,621 $ 74,296 Fair value adjustments recorded in net income Money market funds Level 1 $ 6,480 $ 6,480 $ 0 Current marketable equity securities(2) Level 1 4,282 0 4,282 Mutual funds Level 2 311 0 311 Government bonds Level 2 1,952 347 1,605 Corporate debt securities Level 2 3,782 91 3,691 Mortgage-backed and Level 2 asset-backed securities 2,683 0 2,683 Total investments with fair value change recorded in net income $ 19,490 $ 6,918 $ 12,572 Cash 0 12,509 0 Total $ 80,434 $ 433 $ (1,950) $ 98,407 $ 24,048 $ 86,868 (1) Represents gross unrealized gains and losses for debt securities recorded to AOCI. (2) The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $1.4 billion as of December 31, 2023 is included within other non-current assets. Investments Measured at Fair Value on a Nonrecurring Basis Our non-marketable equity securities are investments in privately held companies without readily determinable market values. The carrying value of our non-marketable equity securities is adjusted to fair value upon observable transactions for identical or similar investments of the same issuer or impairment. Non-marketable equity securities that have been remeasured during the period based on observable transactions are classified within Level 2 or Level 3 in the fair value hierarchy because we estimate the value based on valuation methods, including option pricing models, market comparable approach, and common stock equivalent method, which may include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, expected time to exit, risk free rate, and the rights, and obligations of the securities we hold. These inputs significantly vary based on investment type. The fair value of non-marketable equity securities that have been remeasured due to impairment are classified within Level 3. As of December 31, 2023, the carrying value of our non-marketable equity securities was $28.8 billion, of which $13.7 billion were remeasured at fair value during the year ended December 31, 2023, and primarily classified within Level 2 of the fair value hierarchy at the time of measurement. 65.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "66",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_67_chunk_0",
        "text": "Table of Contents Alphabet Inc. Debt Securities The following table summarizes the estimated fair value of investments in available-for-sale marketable debt securities by effective contractual maturity dates (in millions): As of December 31, 2023 Due in one year or less $ 11,231 Due in one year through five years 41,477 Due in five years through 10 years 15,351 Due after 10 years 14,216 Total $ 82,275 The following tables present fair values and gross unrealized losses recorded to AOCI, aggregated by investment category and the length of time that individual securities have been in a continuous loss position (in millions): As of December 31, 2022 Less than 12 Months 12 Months or Greater Total Unrealized Unrealized Unrealized Fair Value Loss Fair Value Loss Fair Value Loss Government bonds $ 21,039 $ (1,004) $ 13,438 $ (1,041) $ 34,477 $ (2,045) Corporate debt securities 11,228 (440) 15,125 (1,052) 26,353 (1,492) Mortgage-backed and asset-backed securities 7,725 (585) 6,964 (657) 14,689 (1,242) Total $ 39,992 $ (2,029) $ 35,527 $ (2,750) $ 75,519 $ (4,779) As of December 31, 2023 Less than 12 Months 12 Months or Greater Total Unrealized Unrealized Unrealized Fair Value Loss Fair Value Loss Fair Value Loss Government bonds $ 1,456 $ (22) $ 13,897 $ (657) $ 15,353 $ (679) Corporate debt securities 827 (5) 15,367 (592) 16,194 (597) Mortgage-backed and asset-backed securities 2,945 (26) 7,916 (608) 10,861 (634) Total $ 5,228 $ (53) $ 37,180 $ (1,857) $ 42,408 $ (1,910) We determine realized gains or losses on the sale or extinguishment of debt securities on a specific identification method.The following table summarizes gains and losses for debt securities, reflected as a component of OI&E (in millions): Year Ended December 31, 2021 2022 2023 Unrealized gain (loss) on fair value option debt securities $ (122) $ (557) $ 386 Gross realized gain on debt securities 432 103 182 Gross realized loss on debt securities (329) (1,588) (1,833) (Increase) decrease in allowance for credit losses (91) (22) 50 Total gain (loss) on debt securities recognized in other income (expense), net $ (110) $ (2,064) $ (1,215) 66.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "67",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_69_chunk_0",
        "text": "Table of Contents Alphabet Inc. Derivative Financial Instruments We use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns. We recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation. Cash Flow Hedges We designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the U.S. dollar. These contracts have maturities of 24 months or less. Cash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI. As of December 31, 2023, the net accumulated gain on our foreign currency cash flow hedges before tax effect was $47 million, which is expected to be reclassified from AOCI into revenues within the next 12 months. Fair Value Hedges We designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E. Net Investment Hedges We designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E. Other Derivatives We enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in OI&E along",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "69",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_69_chunk_1",
        "text": "with the foreign currency gains and losses on monetary assets and liabilities. We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details. 68.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "69",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_70_chunk_0",
        "text": "Table of Contents Alphabet Inc. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, 2022 2023 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 15,972 $ 18,039 Fair value hedges $ 2,117 $ 2,065 Net investment hedges $ 8,751 $ 9,472 Derivatives not designated as hedging instruments: Foreign exchange contracts $ 34,979 $ 39,722 Other contracts $ 7,932 $ 10,818 The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2022 As of December 31, 2023 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 271 $ 556 $ 205 $ 242 Derivatives not designated as hedging instruments: Foreign exchange contracts 365 207 134 156 Other contracts 40 47 114 47 Total derivatives not designated as hedging instruments 405 254 248 203 Total $ 676 $ 810 $ 453 $ 445 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Year Ended December 31, 2021 2022 2023 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ 806 $ 1,699 $ 90 Amount excluded from the assessment of effectiveness 48 (188) 84 Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness 754 608 (287) Total $ 1,608 $ 2,119 $ (113) 69.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "70",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. differences will affect the provision for income taxes and the effective tax rate in the period in which such determination is made. The provision for income taxes includes the effect of reserve provisions and changes to reserves as well as the related net interest and penalties. In addition, we are subject to the continuous examination of our income tax returns by the IRS and other tax authorities which may assert assessments against us. We regularly assess the likelihood of adverse outcomes resulting from these examinations and assessments to determine the adequacy of our provision for income taxes. Loss Contingencies We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. Certain of these matters include speculative claims for substantial or indeterminate amounts of damages. We record a liability when we believe that it is probable that a loss has been incurred and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the possible loss in Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. We evaluate, on a regular basis, developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments and changes to our disclosures. Significant judgment is required to determine both the likelihood and the estimated amount of a loss related to such matters. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK We are exposed to financial market risks, including changes in foreign currency exchange rates, interest rates, and equity investment risks. Foreign Currency Exchange Risk We transact business globally in multiple currencies. International revenues, as well as costs and expenses denominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the U.S. dollar. As discussed below, we enter into derivative instruments to hedge foreign currency risk. Principal currencies hedged included the Australian dollar, British pound, Canadian dollar, Euro, and Japanese yen. For the purpose of analyzing foreign currency exchange risk, we considered the historical trends in foreign currency exchange rates and determined that it was reasonably possible that adverse changes in exchange rates of 10% could be experienced. We use foreign currency forward and option contracts to offset the foreign exchange risk on monetary assets and liabilities denominated in currencies other than the functional currency of the subsidiary. These forward and option contracts reduce, but",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "46",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_46_chunk_1",
        "text": "do not entirely eliminate, the effect of foreign currency exchange rate movements on our assets and liabilities. The foreign currency gains and losses on these assets and liabilities are recorded in OI&E, which are offset by the gains and losses on the forward and option contracts. If an adverse 10% foreign currency exchange rate change was applied to net monetary assets, liabilities, and commitments denominated in currencies other than the functional currencies at the balance sheet date, it would have resulted in an adverse effect on income before income taxes of approximately $503 million and $135 million as of December 31, 2023 and 2024, respectively, after consideration of the effect of foreign exchange contracts in place for the years ended December 31, 2023 and 2024. We use foreign currency forward and option contracts, including collars (an option strategy comprised of a combination of purchased and written options) to protect forecasted U.S. dollar-equivalent earnings from changes in foreign currency exchange rates. When the U.S. dollar strengthens, gains from foreign currency forward and option contacts reduce the foreign currency losses related to our earnings. When the U.S. dollar weakens, losses from foreign currency forward and option contracts offset the foreign currency gains related to our earnings. These hedging contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements. We designate these contracts as cash flow hedges for accounting purposes. We reflect the gains and losses of foreign currency spot rate changes as a component of accumulated other comprehensive income (AOCI) and subsequently reclassify them into revenues to offset the hedged exposures as they occur. If the U.S. dollar weakened by 10% as of December 31, 2023 and 2024, the amount recorded in AOCI related to our cash flow hedges before tax effect would have been approximately $1.5 billion and $1.6 billion lower as of 45.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "46",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_47_chunk_0",
        "text": "Table of Contents Alphabet Inc. December 31, 2023 and 2024, respectively. The change in the value recorded in AOCI would be expected to offset a corresponding foreign currency change in forecasted hedged revenues when recognized. We use foreign exchange forward contracts designated as net investment hedges to hedge the foreign currency risks related to investment in foreign subsidiaries. These forward contracts serve to offset the foreign currency translation risk from our foreign operations. If the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $946 million and $660 million lower as of December 31, 2023 and 2024, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries. Interest Rate Risk Our Corporate Treasury investment strategy is to achieve a return that will allow us to preserve capital and maintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities, mortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate derivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and floating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair market value adversely affected due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. Unrealized gains and losses on our marketable debt securities are primarily due to interest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. We measure securities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until the securities are sold, less any expected credit losses. We use value-at-risk (VaR) analysis to determine the potential effect of fluctuations in interest rates on the value of our investment portfolio. The VaR is the expected loss in fair value, for a given confidence interval, for our investment portfolio due to adverse movements in interest rates. We use a variance/covariance VaR model with 95% confidence interval. The estimated one-day loss in fair value of our investment portfolio as of December 31, 2023 and 2024 are shown below (in millions): 12-Month Average As of December 31, As of December 31, 2023 2024 2023 2024 Risk category - interest rate $ 296 $ 208 $ 271 $ 230 Actual future gains and losses associated with our investment portfolio may differ materially from the sensitivity analyses performed as of December 31, 2023 and 2024 due to the inherent limitations associated with predicting the timing and amount of changes in interest rates and our actual exposures and positions. VaR analysis is not",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "47",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_47_chunk_1",
        "text": "intended to represent actual losses but is used as a risk estimation. Equity Investment Risk Our marketable and non-marketable equity securities are subject to a wide variety of market-related risks that could substantially reduce or increase the fair value of our holdings. Our marketable equity securities are publicly traded stocks or funds and our non-marketable equity securities are investments in privately held companies, some of which are in the startup or development stages. We record marketable equity securities not accounted for under the equity method at fair value based on readily determinable market values, of which publicly traded stocks and mutual funds are subject to market price volatility, and represent $6.0 billion and $5.1 billion of our investments as of December 31, 2023 and 2024, respectively. A hypothetical adverse price change of 10% on our December 31, 2024 balance would decrease the fair value of marketable equity securities by $508 million. From time to time, we may enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Our non-marketable equity securities not accounted for under the equity method are primarily adjusted to fair value for observable transactions for identical or similar investments of the same issuer or impairment (referred to as the measurement alternative). The fair value measured at the time of the observable transaction is not necessarily an indication of the current fair value as of the balance sheet date. These investments, especially those that are in the early stages, are inherently risky because the technologies or products these companies have under development are typically in the early phases and may never materialize, and they may experience a decline in financial condition, which could result in a loss of a substantial part of our investment in these companies. Valuations of our equity investments in private companies are inherently more complex due to the lack of readily available market data and 46.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "47",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_16_chunk_0",
        "text": "Table of Contents Alphabet Inc. Fair Value Hedges We designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our investments denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in other income (expense), net, along with the offsetting gains and losses of the related hedged items. We exclude changes in forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in other income (expense), net. Net Investment Hedges We designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude changes in forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in other income (expense), net. Other Derivatives Other derivatives not designated as hedging instruments consist primarily of foreign currency forward contracts that we use to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these contracts, as well as the related costs, are recognized in other income (expense), net, along with the foreign currency gains and losses on monetary assets and liabilities. We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures and to enhance investment returns. Additionally, from time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains (losses) arising from these derivatives are reflected within the \"other\" component of other income (expense), net and the offsetting recognized gains (losses) on the marketable equity securities are reflected within the gain (loss) on equity securities, net component of other income (expense), net. See Note 6 for further details on other income (expense), net. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, As of March 31, 2021 2022 Derivatives Designated as Hedging Instruments: Foreign exchange contracts Cash flow hedges $ 16,362 $ 17,817 Fair value hedges $ 2,556 $ 2,438 Net investment hedges $ 10,159 $ 9,933 Derivatives Not Designated as Hedging Instruments: Foreign exchange contracts $ 41,031 $ 42,338 Other contracts $ 4,275 $ 6,052 16",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "16",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_17_chunk_0",
        "text": "Table of Contents Alphabet Inc. The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2021 Fair Value of Fair Value of Derivatives Derivatives Not Designated as Designated as Balance Sheet Location Hedging Instruments Hedging Instruments Total Fair Value Derivative Assets: Level 2: Foreign exchange Other current and non-current contracts assets $ 867 $ 42 $ 909 Other contracts Other current and non-current assets 0 52 52 Total $ 867 $ 94 $ 961 Derivative Liabilities: Level 2: Foreign exchange Accrued expenses and other contracts liabilities, current and non-current $ 8 $ 452 $ 460 Other contracts Accrued expenses and other liabilities, current and non-current 0 121 121 Total $ 8 $ 573 $ 581 As of March 31, 2022 Fair Value of Fair Value of Derivatives Derivatives Not Designated as Designated as Balance Sheet Location Hedging Instruments Hedging Instruments Total Fair Value Derivative Assets: Level 2: Foreign exchange Other current and non-current contracts assets $ 705 $ 26 $ 731 Other contracts Other current and non-current assets 0 76 76 Total $ 705 $ 102 $ 807 Derivative Liabilities: Level 2: Foreign exchange Accrued expenses and other contracts liabilities, current and non-current $ 163 $ 404 $ 567 Other contracts Accrued expenses and other liabilities, current and non-current 0 76 76 Total $ 163 $ 480 $ 643 17",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "17",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_17_chunk_0",
        "text": "Table of Contents Alphabet Inc. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, As of March 31, 2022 2023 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 15,972 $ 17,140 Fair value hedges $ 2,117 $ 1,439 Net investment hedges $ 8,751 $ 9,036 Derivatives not designated as hedging instruments: Foreign exchange contracts $ 34,979 $ 33,715 Other contracts $ 7,932 $ 8,423 The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2022 As of March 31, 2023 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 271 $ 556 $ 111 $ 510 Derivatives not designated as hedging instruments: Foreign exchange contracts 365 207 284 201 Other contracts 40 47 48 65 Total derivatives not designated as hedging instruments 405 254 332 266 Total $ 676 $ 810 $ 443 $ 776 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Gains (Losses) Recognized in OCI on Derivatives Before Tax Effect Three Months Ended March 31, 2022 2023 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ 135 $ (138) Amount excluded from the assessment of effectiveness (15) 47 Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness 149 (215) Total $ 269 $ (306) 17",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "17",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_17_chunk_0",
        "text": "The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, As of March 31, 2023 2024 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 18,039 $ 17,726 Fair value hedges $ 2,065 $ 1,847 Net investment hedges $ 9,472 $ 9,321 Derivatives not designated as hedging instruments: Foreign exchange contracts(1) $ 39,722 $ 107,978 Other contracts $ 10,818 $ 10,902 (1) The gross notional amounts of these derivative instruments as of March 31, 2024 reflect a rollover in timing of settlement into our second quarter as a result of a holiday market closure. The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2023 As of March 31, 2024 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 205 $ 242 $ 150 $ 125 Derivatives not designated as hedging instruments: Foreign exchange contracts 134 156 317 221 Other contracts 114 47 164 40 Total derivatives not designated as hedging instruments 248 203 481 261 Total $ 453 $ 445 $ 631 $ 386 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Three Months Ended March 31, 2023 2024 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ (138) $ 155 Amount excluded from the assessment of effectiveness 47 58 Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness (215) 82 Total $ (306) $ 295 17",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "17",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_17_chunk_0",
        "text": "Table of Contents Alphabet Inc. Fair Value Hedges We designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our investments denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in other income (expense), net, along with the offsetting gains and losses of the related hedged items. We exclude changes in forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in other income (expense), net. Net Investment Hedges We designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude changes in forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in other income (expense), net. Other Derivatives Other derivatives not designated as hedging instruments consist primarily of foreign currency forward contracts that we use to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these contracts, as well as the related costs, are recognized in other income (expense), net, along with the foreign currency gains and losses on monetary assets and liabilities. We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures and to enhance investment returns. Additionally, from time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains (losses) arising from these derivatives are reflected within the \"other\" component of other income (expense), net and the offsetting recognized gains (losses) on the marketable equity securities are reflected within the gain (loss) on equity securities, net component of other income (expense), net. See Note 6 for further details on other income (expense), net. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, As of June 30, 2022 2021 Derivatives Designated as Hedging Instruments: Foreign exchange contracts Cash flow hedges $ 16,362 $ 17,871 Fair value hedges $ 2,556 $ 2,151 Net investment hedges $ 10,159 $ 9,801 Derivatives Not Designated as Hedging Instruments: Foreign exchange contracts $ 41,031 $ 42,270 Other contracts $ 4,275 $ 7,347 17",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "17",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_19_chunk_0",
        "text": "Table of Contents Alphabet Inc. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Gains (Losses) Recognized in OCI on Derivatives Before Tax Effect Three Months Ended Six Months Ended June 30, June 30, 2021 2022 2021 2022 Derivatives in Cash Flow Hedging Relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ (60) $ 1,131 $ 102 $ 1,266 Amount excluded from the assessment of effectiveness (4) (39) 45 (54) Derivatives in Net Investment Hedging Relationship: Foreign exchange contracts Amount included in the assessment of effectiveness (179) 509 199 658 Total $ (243) $ 1,601 $ 346 $ 1,870 The effect of derivative instruments on income is summarized below (in millions): Gains (Losses) Recognized in Income Three Months Ended June 30, 2021 2022 Other income Other income Revenues (expense), net Revenues (expense), net Total amounts presented in the Consolidated Statements of Income in which the effects of cash flow and fair value hedges are recorded $ 61,880 $ 2,624 $ 69,685 $ (439) Gains (Losses) on Derivatives in Cash Flow Hedging Relationship: Foreign exchange contracts Amount of gains (losses) reclassified from AOCI to income $ (3) $ 0 $ 400 $ 0 Amount excluded from the assessment of effectiveness recognized in earnings based on an amortization approach (4) 0 (24) 0 Gains (Losses) on Derivatives in Fair Value Hedging Relationship: Foreign exchange contracts Hedged items 0 28 0 (136) Derivatives designated as hedging instruments 0 (28) 0 136 Amount excluded from the assessment of effectiveness 0 2 0 2 Gains (Losses) on Derivatives in Net Investment Hedging Relationship: Foreign exchange contracts Amount excluded from the assessment of effectiveness 0 21 0 28 Gains (Losses) on Derivatives Not Designated as Hedging Instruments: Foreign exchange contracts 0 (64) 0 (149) Other Contracts 0 (142) 0 86 Total gains (losses) $ (7) $ (183) $ 376 $ (33) 19",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "19",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_18_chunk_0",
        "text": "Table of Contents Alphabet Inc. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, 2022 As of June 30, 2023 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 15,972 $ 15,823 Fair value hedges $ 2,117 $ 1,472 Net investment hedges $ 8,751 $ 9,371 Derivatives not designated as hedging instruments: Foreign exchange contracts $ 34,979 $ 34,185 Other contracts $ 7,932 $ 9,133 The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2022 As of June 30, 2023 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 271 $ 556 $ 228 $ 201 Derivatives not designated as hedging instruments: Foreign exchange contracts 365 207 130 136 Other contracts 40 47 39 67 Total derivatives not designated as hedging instruments 405 254 169 203 Total $ 676 $ 810 $ 397 $ 404 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Gains (Losses) Recognized in OCI on Derivatives Before Tax Effect Three Months Ended Six Months Ended June 30, June 30, 2022 2023 2022 2023 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ 1,131 $ 77 $ 1,266 $ (61) Amount excluded from the assessment of effectiveness (39) 80 (54) 127 Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness 509 (59) 658 (274) Total $ 1,601 $ 98 $ 1,870 $ (208) 18",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "18",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_17_chunk_0",
        "text": "Table of Contents Alphabet Inc. Equity Securities Accounted for Under the Equity Method As of December 31, 2023 and June 30, 2024, equity securities accounted for under the equity method had a carrying value of approximately $1.7 billion and $2.1 billion, respectively. Our share of gains and losses, including impairments, are included as a component of OI&E, in the Consolidated Statements of Income. See Note 6 for further details on OI&E. Derivative Financial Instruments We use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns. We recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation. Cash Flow Hedges We designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the United States (U.S.) dollar. These contracts have maturities of 24 months or less. Cash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI. As of June 30, 2024, the net accumulated gain on our foreign currency cash flow hedges before tax effect was $300 million, which is expected to be reclassified from AOCI into revenues within the next 12 months. Fair Value Hedges We designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E. Net Investment Hedges We designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude forward points from the assessment of hedge",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "17",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_17_chunk_1",
        "text": "effectiveness and recognize changes in the excluded component in OI&E. Other Derivatives We enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and liabilities. We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, and credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 6 for further details. 17",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "17",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_18_chunk_0",
        "text": "The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of December 31, 2023 As of June 30, 2024 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 18,039 $ 18,803 Fair value hedges $ 2,065 $ 1,649 Net investment hedges $ 9,472 $ 9,355 Derivatives not designated as hedging instruments: Foreign exchange contracts $ 39,722 $ 42,006 Other contracts $ 10,818 $ 11,542 The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2023 As of June 30, 2024 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 205 $ 242 $ 365 $ 22 Derivatives not designated as hedging instruments: Foreign exchange contracts 134 156 26 171 Other contracts 114 47 172 26 Total derivatives not designated as hedging instruments 248 203 198 197 Total $ 453 $ 445 $ 563 $ 219 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Three Months Ended Six Months Ended June 30, June 30, 2023 2024 2023 2024 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ 77 $ 277 $ (61) $ 432 Amount excluded from the assessment of effectiveness 80 (7) 127 51 Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness (59) 120 (274) 202 Total $ 98 $ 390 $ (208) $ 685 18",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "18",
            "page_section": "market_risk_disclosures"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_18_chunk_0",
        "text": "We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, and credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 6 for further details. The gross notional amounts of outstanding derivative instruments were as follows (in millions): As of As of December 31, 2023 September 30, 2024 Derivatives designated as hedging instruments: Foreign exchange contracts Cash flow hedges $ 18,039 $ 22,693 Fair value hedges $ 2,065 $ 1,714 Net investment hedges $ 9,472 $ 7,047 Derivatives not designated as hedging instruments: Foreign exchange contracts $ 39,722 $ 49,303 Other contracts $ 10,818 $ 16,756 The fair values of outstanding derivative instruments were as follows (in millions): As of December 31, 2023 As of September 30, 2024 Assets(1) Liabilities(2) Assets(1) Liabilities(2) Derivatives designated as hedging instruments: Foreign exchange contracts $ 205 $ 242 $ 8 $ 587 Derivatives not designated as hedging instruments: Foreign exchange contracts 134 156 186 154 Other contracts 114 47 451 29 Total derivatives not designated as hedging instruments 248 203 637 183 Total $ 453 $ 445 $ 645 $ 770 (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets. (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets. The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2023 2024 2023 2024 Derivatives in cash flow hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness $ 652 $ (738) $ 591 $ (306) Amount excluded from the assessment of effectiveness 16 (103) 143 (52) Derivatives in net investment hedging relationship: Foreign exchange contracts Amount included in the assessment of effectiveness 336 (424) 62 (222) Total $ 1,004 $ (1,265) $ 796 $ (580) 18",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "18",
            "page_section": "market_risk_disclosures"
        }
    }
]