[
    {
        "id": "goog-10-k-2022.pdf_page_86_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE The information required by this item will be included under the caption “Directors, Executive Officers, and Corporate Governance” in our Proxy Statement for the 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2022 (2023 Proxy Statement) and is incorporated herein by reference. The information required by this item regarding delinquent filers pursuant to Item 405 of Regulation S-K will be included under the caption “Delinquent Section 16(a) Reports” in the 2023 Proxy Statement and is incorporated herein by reference. ITEM 11. EXECUTIVE COMPENSATION The information required by this item will be included under the captions “Director Compensation,” “Executive Compensation” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Compensation Committee Interlocks and Insider Participation” in the 2023 Proxy Statement and is incorporated herein by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS The information required by this item will be included under the captions “Common Stock Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in the 2023 Proxy Statement and is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE The information required by this item will be included under the captions “Certain Relationships and Related Transactions” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Director Independence” in the 2023 Proxy Statement and is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES The information required by this item will be included under the caption “Independent Registered Public Accounting Firm” in the 2023 Proxy Statement and is incorporated herein by reference. 85",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "86",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_91_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized. Date: February 2, 2023 ALPHABET INC. By: /S/ SUNDAR PICHAI Sundar Pichai Chief Executive Officer (Principal Executive Officer of the Registrant) POWER OF ATTORNEY KNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Sundar Pichai and Ruth M. Porat, jointly and severally, his or her attorney-in-fact, with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his or her substitute or substitutes, may do or cause to be done by virtue hereof. Pursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated. 90",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "91",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2022.pdf_page_92_chunk_0",
        "text": "Table of Contents Alphabet Inc. Signature Title Date Chief Executive Officer and Director (Principal /S/ SUNDAR PICHAI Executive Officer) February 2, 2023 Sundar Pichai Senior Vice President and Chief Financial /S/ RUTH M. PORAT Officer (Principal Financial Officer) February 2, 2023 Ruth M. Porat Vice President and Chief Accounting Officer /S/ AMIE THUENER O'TOOLE (Principal Accounting Officer) February 2, 2023 Amie Thuener O'Toole /S/ FRANCES H. ARNOLD Director February 2, 2023 Frances H. Arnold /S/ SERGEY BRIN Co-Founder and Director February 2, 2023 Sergey Brin /S/ R. MARTIN CHAVEZ Director February 2, 2023 R. Martin Chávez /S/ L. JOHN DOERR Director February 2, 2023 L. John Doerr /S/ ROGER W. FERGUSON JR. Director February 2, 2023 Roger W. Ferguson Jr. /S/ JOHN L. HENNESSY Director, Chair February 2, 2023 John L. Hennessy /S/ ANN MATHER Director February 2, 2023 Ann Mather /S/ LARRY PAGE Co-Founder and Director February 2, 2023 Larry Page /S/ K. RAM SHRIRAM Director February 2, 2023 K. Ram Shriram /S/ ROBIN L. WASHINGTON Director February 2, 2023 Robin L. Washington 91",
        "metadata": {
            "document": "goog-10-k-2022.pdf",
            "page_number": "92",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_91_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE The information required by this item will be included under the caption “Directors, Executive Officers, and Corporate Governance” in our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2023 (2024 Proxy Statement) and is incorporated herein by reference. The information required by this item regarding delinquent filers pursuant to Item 405 of Regulation S-K will be included under the caption “Delinquent Section 16(a) Reports” in the 2024 Proxy Statement and is incorporated herein by reference. ITEM 11. EXECUTIVE COMPENSATION The information required by this item will be included under the captions “Director Compensation,” “Executive Compensation” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Compensation Committee Interlocks and Insider Participation” in the 2024 Proxy Statement and is incorporated herein by reference, except as to information disclosed therein pursuant to Item 402(v) of Regulation S-K relating to pay versus performance. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS The information required by this item will be included under the captions “Common Stock Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in the 2024 Proxy Statement and is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE The information required by this item will be included under the captions “Certain Relationships and Related Transactions” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Director Independence” in the 2024 Proxy Statement and is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES The information required by this item will be included under the caption “Independent Registered Public Accounting Firm” in the 2024 Proxy Statement and is incorporated herein by reference. 90.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "91",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_96_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized. Date: January 30, 2024 ALPHABET INC. By: /S/ SUNDAR PICHAI Sundar Pichai Chief Executive Officer (Principal Executive Officer of the Registrant) POWER OF ATTORNEY KNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Sundar Pichai and Ruth M. Porat, jointly and severally, his or her attorney-in-fact, with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his or her substitute or substitutes, may do or cause to be done by virtue hereof. Pursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated. 95.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "96",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2023-final.pdf_page_97_chunk_0",
        "text": "Table of Contents Alphabet Inc. Signature Title Date Chief Executive Officer and Director (Principal /S/ SUNDAR PICHAI Executive Officer) January 30, 2024 Sundar Pichai President and Chief Investment Officer; Chief /S/ RUTH M. PORAT Financial Officer (Principal Financial Officer) January 30, 2024 Ruth M. Porat Vice President, Corporate Controller and /S/ AMIE THUENER O'TOOLE Principal Accounting Officer January 30, 2024 Amie Thuener O'Toole /S/ FRANCES H. ARNOLD Director January 30, 2024 Frances H. Arnold /S/ SERGEY BRIN Co-Founder and Director January 30, 2024 Sergey Brin /S/ R. MARTIN CHAVEZ Director January 30, 2024 R. Martin Chávez /S/ L. JOHN DOERR Director January 30, 2024 L. John Doerr /S/ ROGER W. FERGUSON JR. Director January 30, 2024 Roger W. Ferguson Jr. /S/ JOHN L. HENNESSY Director, Chair January 30, 2024 John L. Hennessy /S/ LARRY PAGE Co-Founder and Director January 30, 2024 Larry Page /S/ K. RAM SHRIRAM Director January 30, 2024 K. Ram Shriram /S/ ROBIN L. WASHINGTON Director January 30, 2024 Robin L. Washington 96.",
        "metadata": {
            "document": "goog-10-k-2023-final.pdf",
            "page_number": "97",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_93_chunk_0",
        "text": "Table of Contents Alphabet Inc. PART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE The information required by this item will be included under the caption “Directors, Executive Officers, and Corporate Governance” in our Proxy Statement for the 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2024 (2025 Proxy Statement) and is incorporated herein by reference. The information required by this item regarding delinquent filers pursuant to Item 405 of Regulation S-K will be included under the caption “Delinquent Section 16(a) Reports” in the 2025 Proxy Statement and is incorporated herein by reference. We have adopted insider trading policies and procedures governing the purchase, sale, and other dispositions of securities of Alphabet by directors, officers, and employees that we believe are reasonably designed to promote compliance with insider trading laws, rules and regulations, and applicable Nasdaq listing standards. Our insider trading policy states, among other things, that our directors, officers, and employees are prohibited from trading in such securities while in possession of material, nonpublic information. The foregoing summary of our insider trading policies and procedures does not purport to be complete and is qualified by reference to our Policy Against Insider Trading filed as an exhibit to this Annual Report on Form 10-K. ITEM 11. EXECUTIVE COMPENSATION The information required by this item will be included under the captions “Director Compensation,” “Executive Compensation” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Compensation Committee Interlocks and Insider Participation” in the 2025 Proxy Statement and is incorporated herein by reference, except as to information disclosed therein pursuant to Item 402(v) of Regulation S-K relating to pay versus performance. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS The information required by this item will be included under the captions “Common Stock Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in the 2025 Proxy Statement and is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE The information required by this item will be included under the captions “Certain Relationships and Related Transactions” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Director Independence” in the 2025 Proxy Statement and is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES The information required by this item will be included under the caption “Independent Registered Public Accounting Firm” in the 2025 Proxy Statement and is incorporated herein by reference. 92.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "93",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_98_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized. Date: February 4, 2025 ALPHABET INC. By: /S/ SUNDAR PICHAI Sundar Pichai Chief Executive Officer (Principal Executive Officer of the Registrant) POWER OF ATTORNEY KNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Sundar Pichai and Anat Ashkenazi, jointly and severally, his or her attorney-in-fact, with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his or her substitute or substitutes, may do or cause to be done by virtue hereof. Pursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated. 97.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "98",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-k-2024.pdf_page_99_chunk_0",
        "text": "Table of Contents Alphabet Inc. Signature Title Date Chief Executive Officer and Director (Principal /S/ SUNDAR PICHAI Executive Officer) February 4, 2025 Sundar Pichai Senior Vice President and Chief Financial /S/ ANAT ASHKENAZI Officer (Principal Financial Officer) February 4, 2025 Anat Ashkenazi Vice President, Corporate Controller and /S/ AMIE THUENER O'TOOLE Principal Accounting Officer February 4, 2025 Amie Thuener O'Toole /S/ FRANCES H. ARNOLD Director February 4, 2025 Frances H. Arnold /S/ SERGEY BRIN Co-Founder and Director February 4, 2025 Sergey Brin /S/ R. MARTIN CHAVEZ Director February 4, 2025 R. Martin Chávez /S/ L. JOHN DOERR Director February 4, 2025 L. John Doerr /S/ ROGER W. FERGUSON JR. Director February 4, 2025 Roger W. Ferguson Jr. /S/ JOHN L. HENNESSY Director, Chair February 4, 2025 John L. Hennessy /S/ LARRY PAGE Co-Founder and Director February 4, 2025 Larry Page /S/ K. RAM SHRIRAM Director February 4, 2025 K. Ram Shriram /S/ ROBIN L. WASHINGTON Director February 4, 2025 Robin L. Washington 98.",
        "metadata": {
            "document": "goog-10-k-2024.pdf",
            "page_number": "99",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q1-2022.pdf_page_45_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURE Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. April 26, 2022 By: /s/ RUTH M. PORAT Ruth M. Porat Senior Vice President and Chief Financial Officer ALPHABET INC. April 26, 2022 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President and Chief Accounting Officer 45",
        "metadata": {
            "document": "goog-10-q-q1-2022.pdf",
            "page_number": "45",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q1-2023.pdf_page_46_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. April 25, 2023 By: /s/ RUTH M. PORAT Ruth M. Porat Senior Vice President and Chief Financial Officer ALPHABET INC. April 25, 2023 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President and Principal Accounting Officer 46",
        "metadata": {
            "document": "goog-10-q-q1-2023.pdf",
            "page_number": "46",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q1-2024.pdf_page_46_chunk_0",
        "text": "SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. April 25, 2024 By: /s/ RUTH M. PORAT Ruth M. Porat President and Chief Investment Officer; Chief Financial Officer ALPHABET INC. April 25, 2024 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 46",
        "metadata": {
            "document": "goog-10-q-q1-2024.pdf",
            "page_number": "46",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q1-2025.pdf_page_49_chunk_0",
        "text": "SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. April 24, 2025 By: /s/ ANAT ASHKENAZI Anat Ashkenazi Senior Vice President, Chief Financial Officer ALPHABET INC. April 24, 2025 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 49",
        "metadata": {
            "document": "goog-10-q-q1-2025.pdf",
            "page_number": "49",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q2-2022.pdf_page_49_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. July 26, 2022 By: /s/ RUTH M. PORAT Ruth M. Porat Senior Vice President and Chief Financial Officer ALPHABET INC. July 26, 2022 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President and Chief Accounting Officer 49",
        "metadata": {
            "document": "goog-10-q-q2-2022.pdf",
            "page_number": "49",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q2-2023.pdf_page_53_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. July 25, 2023 By: /s/ RUTH M. PORAT Ruth M. Porat Senior Vice President and Chief Financial Officer ALPHABET INC. July 25, 2023 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 53",
        "metadata": {
            "document": "goog-10-q-q2-2023.pdf",
            "page_number": "53",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q2-2024.pdf_page_52_chunk_0",
        "text": "SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. July 23, 2024 By: /s/ RUTH M. PORAT Ruth M. Porat President and Chief Investment Officer; Chief Financial Officer ALPHABET INC. July 23, 2024 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 52",
        "metadata": {
            "document": "goog-10-q-q2-2024.pdf",
            "page_number": "52",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q2-2025.pdf_page_57_chunk_0",
        "text": "SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. July 23, 2025 By: /s/ ANAT ASHKENAZI Anat Ashkenazi Senior Vice President, Chief Financial Officer ALPHABET INC. July 23, 2025 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 57",
        "metadata": {
            "document": "goog-10-q-q2-2025.pdf",
            "page_number": "57",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q3-2022.pdf_page_53_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. October 25, 2022 By: /s/ RUTH M. PORAT Ruth M. Porat Senior Vice President and Chief Financial Officer ALPHABET INC. October 25, 2022 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President and Chief Accounting Officer 53",
        "metadata": {
            "document": "goog-10-q-q3-2022.pdf",
            "page_number": "53",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q3-2023.pdf_page_53_chunk_0",
        "text": "Table of Contents Alphabet Inc. SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. October 24, 2023 By: /s/ RUTH M. PORAT Ruth M. Porat President and Chief Investment Officer; Chief Financial Officer ALPHABET INC. October 24, 2023 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 53",
        "metadata": {
            "document": "goog-10-q-q3-2023.pdf",
            "page_number": "53",
            "page_section": "signatures"
        }
    },
    {
        "id": "goog-10-q-q3-2024.pdf_page_53_chunk_0",
        "text": "SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. ALPHABET INC. October 29, 2024 By: /s/ Anat Ashkenazi Anat Ashkenazi Senior Vice President, Chief Financial Officer ALPHABET INC. October 29, 2024 By: /s/ AMIE THUENER O'TOOLE Amie Thuener O'Toole Vice President, Corporate Controller and Principal Accounting Officer 53",
        "metadata": {
            "document": "goog-10-q-q3-2024.pdf",
            "page_number": "53",
            "page_section": "signatures"
        }
    }
]